[Killed] BlockStatement
src/rules/async-keyword.ts:21:42
   },
   defaultOptions: [],
   create(context) {
-    function report(node: TSESTree.Node) {
-      context.report({ node, messageId: "asyncKeyword" });
-    }
+    function report(node: TSESTree.Node) {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/async-keyword fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1054679479, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/async-keyword.ts:26:33
     }
 
     return {
-      FunctionDeclaration(node) {
-        if (node.async) report(node);
-      },
+      FunctionDeclaration(node) {},
       FunctionExpression(node) {
         if (!node.async) return;
killedBy: property: rule correctness Property 2: agent-code-guard/async-keyword fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1641846594, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/async-keyword.ts:27:13
 
     return {
       FunctionDeclaration(node) {
-        if (node.async) report(node);
+        if (false) report(node);
       },
       FunctionExpression(node) {
killedBy: property: rule correctness Property 2: agent-code-guard/async-keyword fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -348736910, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/async-keyword.ts:27:13
 
     return {
       FunctionDeclaration(node) {
-        if (node.async) report(node);
+        if (true) report(node);
       },
       FunctionExpression(node) {
killedBy: property: rule correctness Property 1: no recommended rule fires on safe TS sources
statusReason: Property failed after 2 tests
{ seed: 1853366747, path: "1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["function a(a: number): number { return a + 0; }"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/async-keyword.ts:29:32
       FunctionDeclaration(node) {
         if (node.async) report(node);
       },
-      FunctionExpression(node) {
-        if (!node.async) return;
-        const parent = node.parent;
-        if (
-          parent &&
-          (parent.type === "MethodDefinition" ||
-            (parent.type === "Property" && parent.method))
-        ) {
-          return;
-        }
-        report(node);
-      },
+      FunctionExpression(node) {},
       ArrowFunctionExpression(node) {
         if (node.async) report(node);
killedBy: async-keyword invalid const foo = async function () { return 1; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:30:13
         if (node.async) report(node);
       },
       FunctionExpression(node) {
-        if (!node.async) return;
+        if (false) return;
         const parent = node.parent;
         if (
killedBy: async-keyword valid const baz = function () { return 1; };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 13,
    nodeType: 'FunctionExpression',

[Killed] BooleanLiteral
src/rules/async-keyword.ts:30:13
         if (node.async) report(node);
       },
       FunctionExpression(node) {
-        if (!node.async) return;
+        if (node.async) return;
         const parent = node.parent;
         if (
killedBy: async-keyword valid const baz = function () { return 1; };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 13,
    nodeType: 'FunctionExpression',

[Killed] ConditionalExpression
src/rules/async-keyword.ts:33:11
         if (!node.async) return;
         const parent = node.parent;
         if (
-          parent &&
-          (parent.type === "MethodDefinition" ||
-            (parent.type === "Property" && parent.method))
+          true
         ) {
           return;
killedBy: async-keyword invalid const foo = async function () { return 1; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:33:11
         if (!node.async) return;
         const parent = node.parent;
         if (
-          parent &&
-          (parent.type === "MethodDefinition" ||
-            (parent.type === "Property" && parent.method))
+          false
         ) {
           return;
killedBy: async-keyword invalid class C { async m() { return 1; } }
statusReason: Should have 1 error but had 2: [
  {
    ruleId: 'async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 11,
    nodeType: 'MethodDefinition',

[Killed] ConditionalExpression
src/rules/async-keyword.ts:34:12
         const parent = node.parent;
         if (
           parent &&
-          (parent.type === "MethodDefinition" ||
+          (false ||
             (parent.type === "Property" && parent.method))
         ) {
killedBy: async-keyword invalid class C { async m() { return 1; } }
statusReason: Should have 1 error but had 2: [
  {
    ruleId: 'async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 11,
    nodeType: 'MethodDefinition',

[Killed] ConditionalExpression
src/rules/async-keyword.ts:34:12
         const parent = node.parent;
         if (
           parent &&
-          (parent.type === "MethodDefinition" ||
-            (parent.type === "Property" && parent.method))
+          (true)
         ) {
           return;
killedBy: async-keyword invalid const foo = async function () { return 1; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:35:14
         if (
           parent &&
           (parent.type === "MethodDefinition" ||
-            (parent.type === "Property" && parent.method))
+            (false))
         ) {
           return;
killedBy: async-keyword invalid const obj = { async m() { return 1; } };
statusReason: Should have 1 error but had 2: [
  {
    ruleId: 'async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 15,
    nodeType: 'Property',

[Killed] BlockStatement
src/rules/async-keyword.ts:36:11
           parent &&
           (parent.type === "MethodDefinition" ||
             (parent.type === "Property" && parent.method))
-        ) {
-          return;
-        }
+        ) {}
         report(node);
       },
killedBy: async-keyword invalid class C { async m() { return 1; } }
statusReason: Should have 1 error but had 2: [
  {
    ruleId: 'async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 11,
    nodeType: 'MethodDefinition',

[Killed] BlockStatement
src/rules/async-keyword.ts:41:37
         }
         report(node);
       },
-      ArrowFunctionExpression(node) {
-        if (node.async) report(node);
-      },
+      ArrowFunctionExpression(node) {},
       MethodDefinition(node) {
         if (node.value.type === "FunctionExpression" && node.value.async) {
killedBy: async-keyword invalid const foo = async () => 1;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:42:13
         report(node);
       },
       ArrowFunctionExpression(node) {
-        if (node.async) report(node);
+        if (false) report(node);
       },
       MethodDefinition(node) {
killedBy: async-keyword invalid const foo = async () => 1;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:42:13
         report(node);
       },
       ArrowFunctionExpression(node) {
-        if (node.async) report(node);
+        if (true) report(node);
       },
       MethodDefinition(node) {
killedBy: async-keyword valid const bar = () => 1;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 13,
    nodeType: 'ArrowFunctionExpression',

[Killed] BlockStatement
src/rules/async-keyword.ts:44:30
       ArrowFunctionExpression(node) {
         if (node.async) report(node);
       },
-      MethodDefinition(node) {
-        if (node.value.type === "FunctionExpression" && node.value.async) {
-          report(node);
-        }
-      },
+      MethodDefinition(node) {},
       Property(node) {
         if (
killedBy: async-keyword invalid class C { async m() { return 1; } }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/async-keyword.ts:45:75
         if (node.async) report(node);
       },
       MethodDefinition(node) {
-        if (node.value.type === "FunctionExpression" && node.value.async) {
-          report(node);
-        }
+        if (node.value.type === "FunctionExpression" && node.value.async) {}
       },
       Property(node) {
killedBy: async-keyword invalid class C { async m() { return 1; } }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] LogicalOperator
src/rules/async-keyword.ts:45:13
         if (node.async) report(node);
       },
       MethodDefinition(node) {
-        if (node.value.type === "FunctionExpression" && node.value.async) {
+        if (node.value.type === "FunctionExpression" || node.value.async) {
           report(node);
         }
killedBy: async-keyword valid class C { m() { return 1; } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/async-keyword',
    severity: 2,
    message: 'async keyword — prefer Effect.gen / Effect handlers',
    line: 1,
    column: 11,
    nodeType: 'MethodDefinition',

[Killed] BlockStatement
src/rules/async-keyword.ts:49:22
           report(node);
         }
       },
-      Property(node) {
-        if (
-          node.method &&
-          node.value.type === "FunctionExpression" &&
-          node.value.async
-        ) {
-          report(node);
-        }
-      },
+      Property(node) {},
     };
   },
killedBy: async-keyword invalid const obj = { async m() { return 1; } };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/async-keyword.ts:51:11
       },
       Property(node) {
         if (
-          node.method &&
-          node.value.type === "FunctionExpression" &&
-          node.value.async
+          true
         ) {
           report(node);
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -619270315, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/async-keyword.ts:51:11
       },
       Property(node) {
         if (
-          node.method &&
-          node.value.type === "FunctionExpression" &&
-          node.value.async
+          false
         ) {
           report(node);
killedBy: async-keyword invalid const obj = { async m() { return 1; } };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/async-keyword.ts:54:11
           node.method &&
           node.value.type === "FunctionExpression" &&
           node.value.async
-        ) {
-          report(node);
-        }
+        ) {}
       },
     };
killedBy: async-keyword invalid const obj = { async m() { return 1; } };
statusReason: Should have 1 error but had 0: []

0 !== 1
