[Killed] ConditionalExpression
src/rules/as-unknown-as.ts:13:5
   node: TSESTree.Expression,
 ): node is TSESTree.TSAsExpression | TSESTree.TSTypeAssertion {
   return (
-    (node.type === AST_NODE_TYPES.TSAsExpression ||
-      node.type === AST_NODE_TYPES.TSTypeAssertion) &&
-    isUnknownKeyword(node.typeAnnotation)
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/as-unknown-as fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 25999802, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/as-unknown-as.ts:13:5
   node: TSESTree.Expression,
 ): node is TSESTree.TSAsExpression | TSESTree.TSTypeAssertion {
   return (
-    (node.type === AST_NODE_TYPES.TSAsExpression ||
-      node.type === AST_NODE_TYPES.TSTypeAssertion) &&
-    isUnknownKeyword(node.typeAnnotation)
+    true
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-tagged-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 204512804, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/as-unknown-as.ts:14:7
 ): node is TSESTree.TSAsExpression | TSESTree.TSTypeAssertion {
   return (
     (node.type === AST_NODE_TYPES.TSAsExpression ||
-      node.type === AST_NODE_TYPES.TSTypeAssertion) &&
+      false) &&
     isUnknownKeyword(node.typeAnnotation)
   );
killedBy: as-unknown-as invalid const value = <Foo>(<unknown>raw);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/as-unknown-as.ts:39:13
   create(context) {
     function maybeReport(
       node: TSESTree.TSAsExpression | TSESTree.TSTypeAssertion,
-    ): void {
-      if (!isCastToUnknown(node.expression)) return;
-      context.report({ node, messageId: "asUnknownAs" });
-    }
+    ): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/as-unknown-as fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1497498311, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/as-unknown-as.ts:40:11
     function maybeReport(
       node: TSESTree.TSAsExpression | TSESTree.TSTypeAssertion,
     ): void {
-      if (!isCastToUnknown(node.expression)) return;
+      if (false) return;
       context.report({ node, messageId: "asUnknownAs" });
     }
killedBy: as-unknown-as valid const value = raw as unknown;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/as-unknown-as',
    severity: 2,
    message: '`as unknown as` bypasses the type system — replace it with a type guard, schema decode, or typed constructor.',
    line: 1,
    column: 15,
    nodeType: 'TSAsExpression',

[Killed] BooleanLiteral
src/rules/as-unknown-as.ts:40:11
     function maybeReport(
       node: TSESTree.TSAsExpression | TSESTree.TSTypeAssertion,
     ): void {
-      if (!isCastToUnknown(node.expression)) return;
+      if (isCastToUnknown(node.expression)) return;
       context.report({ node, messageId: "asUnknownAs" });
     }
killedBy: as-unknown-as valid const value = raw as unknown;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/as-unknown-as',
    severity: 2,
    message: '`as unknown as` bypasses the type system — replace it with a type guard, schema decode, or typed constructor.',
    line: 1,
    column: 15,
    nodeType: 'TSAsExpression',
