[Killed] ArithmeticOperator
src/rules/bare-catch.ts:26:35
       CatchClause(node) {
         const param = node.param;
         if (param === null) {
-          const catchKeywordEnd = node.range[0] + "catch".length;
+          const catchKeywordEnd = node.range[0] - "catch".length;
           context.report({
             node,
killedBy: bare-catch invalid try { doThing(); } catch {}
statusReason: Expected the applied suggestion fix to match the test suggestion output for suggestion at index: 0 on error with message: "Silently swallowed error — always bind and log it"
+ actual - expected

+ 'try { doThing( (err)); } catch {}'
- 'try { doThing(); } catch (err) {}'
                 ^

[Killed] StringLiteral
src/rules/bare-catch.ts:26:51
       CatchClause(node) {
         const param = node.param;
         if (param === null) {
-          const catchKeywordEnd = node.range[0] + "catch".length;
+          const catchKeywordEnd = node.range[0] + "".length;
           context.report({
             node,
killedBy: bare-catch invalid try { doThing(); } catch {}
statusReason: A fatal parsing error occurred in suggestion fix.
Error: Parsing error: 'catch' or 'finally' expected.
Suggestion output:
try { doThing(); }  (err)catch {}

[Killed] StringLiteral
src/rules/bare-catch.ts:36:21
                 fix: (fixer) =>
                   fixer.insertTextAfterRange(
                     [node.range[0], catchKeywordEnd],
-                    " (err)",
+                    "",
                   ),
               },
killedBy: bare-catch invalid try { doThing(); } catch {}
statusReason: Expected the applied suggestion fix to match the test suggestion output for suggestion at index: 0 on error with message: "Silently swallowed error — always bind and log it"
+ actual - expected

+ 'try { doThing(); } catch {}'
- 'try { doThing(); } catch (err) {}'
                            ^

[Killed] ConditionalExpression
src/rules/bare-catch.ts:44:11
           return;
         }
         if (
-          param.type === AST_NODE_TYPES.Identifier &&
-          param.name.startsWith("_")
+          true
         ) {
           context.report({
killedBy: bare-catch valid try { doThing(); } catch (err) { console.error(err); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/bare-catch',
    severity: 2,
    message: 'Silently swallowed error — always bind and log it',
    line: 1,
    column: 20,
    nodeType: 'CatchClause',

[Killed] MethodExpression
src/rules/bare-catch.ts:45:11
         }
         if (
           param.type === AST_NODE_TYPES.Identifier &&
-          param.name.startsWith("_")
+          param.name.endsWith("_")
         ) {
           context.report({
killedBy: bare-catch invalid try { doThing(); } catch (_err) { /* ignore */ }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] StringLiteral
src/rules/bare-catch.ts:45:33
         }
         if (
           param.type === AST_NODE_TYPES.Identifier &&
-          param.name.startsWith("_")
+          param.name.startsWith("")
         ) {
           context.report({
killedBy: bare-catch valid try { doThing(); } catch (err) { console.error(err); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/bare-catch',
    severity: 2,
    message: 'Silently swallowed error — always bind and log it',
    line: 1,
    column: 20,
    nodeType: 'CatchClause',

[Killed] BlockStatement
src/rules/bare-catch.ts:46:11
         if (
           param.type === AST_NODE_TYPES.Identifier &&
           param.name.startsWith("_")
-        ) {
-          context.report({
-            node,
-            messageId: "bareCatch",
-            suggest: [
-              {
-                messageId: "bindError",
-                fix: (fixer) => fixer.replaceText(param, "err"),
-              },
-            ],
-          });
-        }
+        ) {}
       },
     };
killedBy: bare-catch invalid try { doThing(); } catch (_) {}
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrayDeclaration
src/rules/bare-catch.ts:50:22
           context.report({
             node,
             messageId: "bareCatch",
-            suggest: [
-              {
-                messageId: "bindError",
-                fix: (fixer) => fixer.replaceText(param, "err"),
-              },
-            ],
+            suggest: [],
           });
         }
killedBy: bare-catch invalid try { doThing(); } catch (_) {}
statusReason: Error should have suggestions on error with message: "Silently swallowed error — always bind and log it"
