[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:36:7
 ];
 
 function isSuspiciousSecretValue(value: string): boolean {
-  if (PLACEHOLDER_VALUES.test(value)) return false;
+  if (true) return false;
   return /[a-zA-Z0-9_-]{20,}/.test(value);
 }
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1972581636, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["00aAAAaAa0AaAaaaaA0a"]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:36:7
 ];
 
 function isSuspiciousSecretValue(value: string): boolean {
-  if (PLACEHOLDER_VALUES.test(value)) return false;
+  if (false) return false;
   return /[a-zA-Z0-9_-]{20,}/.test(value);
 }
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: -1715464838, path: "0", endOnFailure: true }
Counterexample: ["\"your-api-key-goes-here\""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:41:50
 }
 
 function matchSecretShape(value: string): string | null {
-  for (const { name, pattern } of SECRET_SHAPES) {
-    if (pattern.test(value)) return name;
-  }
+  for (const { name, pattern } of SECRET_SHAPES) {}
   return null;
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-secrets fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -2119983886, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:42:9
 
 function matchSecretShape(value: string): string | null {
   for (const { name, pattern } of SECRET_SHAPES) {
-    if (pattern.test(value)) return name;
+    if (false) return name;
   }
   return null;
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-secrets fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -187419273, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:42:9
 
 function matchSecretShape(value: string): string | null {
   for (const { name, pattern } of SECRET_SHAPES) {
-    if (pattern.test(value)) return name;
+    if (true) return name;
   }
   return null;
killedBy: property: rule correctness Property 1: no recommended rule fires on safe TS sources
statusReason: Property failed after 2 tests
{ seed: 993073704, path: "1:0:0:1", endOnFailure: true }
Counterexample: ["const a: string = \"\";"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:51:77
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
 ): string | null {
   if (key.type === AST_NODE_TYPES.Identifier) return key.name;
-  if (key.type === AST_NODE_TYPES.Literal && typeof key.value === "string") {
-    return key.value;
-  }
+  if (key.type === AST_NODE_TYPES.Literal && typeof key.value === "string") {}
   return null;
 }
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1868915542, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaAaAaaaaaaaaaaaAaAa"]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:101:7
       field: string,
       valueNode: TSESTree.Node,
       reportNode: TSESTree.Node,
-    ) {
-      if (
-        valueNode.type !== AST_NODE_TYPES.Literal ||
-        typeof valueNode.value !== "string"
-      ) {
-        return;
-      }
-      handledLiterals.add(valueNode);
-      if (!isSuspiciousSecretValue(valueNode.value)) return;
-      context.report({
-        node: reportNode,
-        messageId: "hardcodedSecret",
-        data: { field },
-      });
-    }
+    ) {}
 
     return {
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 703795782, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["0AaAAAaaaAAaAA0aaa0a"]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:109:11
         return;
       }
       handledLiterals.add(valueNode);
-      if (!isSuspiciousSecretValue(valueNode.value)) return;
+      if (false) return;
       context.report({
         node: reportNode,
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 2135617628, path: "0", endOnFailure: true }
Counterexample: ["\"not a secret because it has spaces\""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-hardcoded-secrets.ts:109:11
         return;
       }
       handledLiterals.add(valueNode);
-      if (!isSuspiciousSecretValue(valueNode.value)) return;
+      if (isSuspiciousSecretValue(valueNode.value)) return;
       context.report({
         node: reportNode,
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 673586516, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["A0aA0AAAAa0AAaaAaa0A"]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:118:22
     }
 
     return {
-      Property(node) {
-        const name = keyName(node.key);
-        if (!name || !SECRET_KEY_NAMES.test(name)) return;
-        checkLiteralFor(name, node.value, node);
-      },
+      Property(node) {},
       VariableDeclarator(node) {
         if (node.id.type !== AST_NODE_TYPES.Identifier) return;
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1196486654, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aa0aaaaaaaaAaAaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-hardcoded-secrets.ts:120:22
     return {
       Property(node) {
         const name = keyName(node.key);
-        if (!name || !SECRET_KEY_NAMES.test(name)) return;
+        if (!name || SECRET_KEY_NAMES.test(name)) return;
         checkLiteralFor(name, node.value, node);
       },
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1328665228, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaaAaAaaaaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:123:32
         if (!name || !SECRET_KEY_NAMES.test(name)) return;
         checkLiteralFor(name, node.value, node);
       },
-      VariableDeclarator(node) {
-        if (node.id.type !== AST_NODE_TYPES.Identifier) return;
-        if (!SECRET_KEY_NAMES.test(node.id.name)) return;
-        if (!node.init) return;
-        checkLiteralFor(node.id.name, node.init, node);
-      },
+      VariableDeclarator(node) {},
       AssignmentExpression(node) {
         const left = node.left;
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 258054659, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaAaaaaaAaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:125:13
       },
       VariableDeclarator(node) {
         if (node.id.type !== AST_NODE_TYPES.Identifier) return;
-        if (!SECRET_KEY_NAMES.test(node.id.name)) return;
+        if (false) return;
         if (!node.init) return;
         checkLiteralFor(node.id.name, node.init, node);
killedBy: no-hardcoded-secrets invalid const a = 'wJalrXUtnFEMI/K7MDENG/bPxRfiCYEXAMPLEKEY';
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/no-hardcoded-secrets.ts:125:13
       },
       VariableDeclarator(node) {
         if (node.id.type !== AST_NODE_TYPES.Identifier) return;
-        if (!SECRET_KEY_NAMES.test(node.id.name)) return;
+        if (SECRET_KEY_NAMES.test(node.id.name)) return;
         if (!node.init) return;
         checkLiteralFor(node.id.name, node.init, node);
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: -1478248268, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaaaAaAaaaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:129:34
         if (!node.init) return;
         checkLiteralFor(node.id.name, node.init, node);
       },
-      AssignmentExpression(node) {
-        const left = node.left;
-        let field: string | null = null;
-        if (left.type === AST_NODE_TYPES.Identifier) field = left.name;
-        else if (
-          left.type === AST_NODE_TYPES.MemberExpression &&
-          !left.computed &&
-          left.property.type === AST_NODE_TYPES.Identifier
-        ) {
-          field = left.property.name;
-        }
-        if (!field || !SECRET_KEY_NAMES.test(field)) return;
-        checkLiteralFor(field, node.right, node);
-      },
+      AssignmentExpression(node) {},
       Literal(node) {
         if (handledLiterals.has(node)) return;
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: -150485515, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["0aAaaAa0aAA0000a0aA0"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-hardcoded-secrets.ts:135:11
         if (left.type === AST_NODE_TYPES.Identifier) field = left.name;
         else if (
           left.type === AST_NODE_TYPES.MemberExpression &&
-          !left.computed &&
+          left.computed &&
           left.property.type === AST_NODE_TYPES.Identifier
         ) {
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1900986601, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["AaaaaaaaaaaaAaAaaaaa"]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:136:11
         else if (
           left.type === AST_NODE_TYPES.MemberExpression &&
           !left.computed &&
-          left.property.type === AST_NODE_TYPES.Identifier
+          true
         ) {
           field = left.property.name;
killedBy: no-hardcoded-secrets valid class Client { #apiKey = ''; run() { this.#apiKey = 'abcdefghijklmnopqrst'; } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-secrets',
    severity: 2,
    message: 'Hardcoded apiKey literal — use process.env.* (or your config loader) instead',
    line: 1,
    column: 38,
    nodeType: 'AssignmentExpression',

[Killed] EqualityOperator
src/rules/no-hardcoded-secrets.ts:136:11
         else if (
           left.type === AST_NODE_TYPES.MemberExpression &&
           !left.computed &&
-          left.property.type === AST_NODE_TYPES.Identifier
+          left.property.type !== AST_NODE_TYPES.Identifier
         ) {
           field = left.property.name;
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 1405203172, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaaAaAaaaaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:137:11
           left.type === AST_NODE_TYPES.MemberExpression &&
           !left.computed &&
           left.property.type === AST_NODE_TYPES.Identifier
-        ) {
-          field = left.property.name;
-        }
+        ) {}
         if (!field || !SECRET_KEY_NAMES.test(field)) return;
         checkLiteralFor(field, node.right, node);
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: -1172136866, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaaAaAaaaaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-hardcoded-secrets.ts:140:23
         ) {
           field = left.property.name;
         }
-        if (!field || !SECRET_KEY_NAMES.test(field)) return;
+        if (!field || SECRET_KEY_NAMES.test(field)) return;
         checkLiteralFor(field, node.right, node);
       },
killedBy: property: rule correctness Property 8: no-hardcoded-secrets keeps name-gated detection across declaration shapes
statusReason: Property failed after 1 tests
{ seed: 972242413, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["aaaaaaaaaaAaAaaaaaaa"]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-secrets.ts:143:21
         if (!field || !SECRET_KEY_NAMES.test(field)) return;
         checkLiteralFor(field, node.right, node);
       },
-      Literal(node) {
-        if (handledLiterals.has(node)) return;
-        if (typeof node.value !== "string") return;
-        const shape = matchSecretShape(node.value);
-        if (!shape) return;
-        context.report({
-          node,
-          messageId: "hardcodedSecret",
-          data: { field: shape },
-        });
-      },
+      Literal(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-secrets fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1654822514, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:144:13
         checkLiteralFor(field, node.right, node);
       },
       Literal(node) {
-        if (handledLiterals.has(node)) return;
+        if (false) return;
         if (typeof node.value !== "string") return;
         const shape = matchSecretShape(node.value);
killedBy: no-hardcoded-secrets invalid const apiKey = 'sk_live_abc123xyz0987654321';
statusReason: Should have 1 error but had 2: [
  {
    ruleId: 'no-hardcoded-secrets',
    severity: 2,
    message: 'Hardcoded apiKey literal — use process.env.* (or your config loader) instead',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:147:13
         if (handledLiterals.has(node)) return;
         if (typeof node.value !== "string") return;
         const shape = matchSecretShape(node.value);
-        if (!shape) return;
+        if (true) return;
         context.report({
           node,
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-secrets fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1542269354, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-secrets.ts:147:13
         if (handledLiterals.has(node)) return;
         if (typeof node.value !== "string") return;
         const shape = matchSecretShape(node.value);
-        if (!shape) return;
+        if (false) return;
         context.report({
           node,
killedBy: property: rule correctness Property 1: no recommended rule fires on safe TS sources
statusReason: Property failed after 1 tests
{ seed: 1308304054, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["const a = \"\";"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/rules/no-hardcoded-secrets.ts:151:17
         context.report({
           node,
           messageId: "hardcodedSecret",
-          data: { field: shape },
+          data: {},
         });
       },
killedBy: no-hardcoded-secrets invalid const a = 'sk_live_abcdefghij1234567890';
statusReason: The reported message has an unsubstituted placeholder 'field'. Please provide the missing value via the 'data' property in the context.report() call.
