[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:12:5
   node: TSESTree.Node | null,
 ): node is TSESTree.NewExpression {
   return (
-    node?.type === AST_NODE_TYPES.NewExpression &&
-    node.callee.type === AST_NODE_TYPES.Identifier &&
-    GENERIC_ERROR_CTORS.has(node.callee.name)
+    true
   );
 }
killedBy: effect-error-erasure valid const fail = () => Effect.fail(new NotConnectedError({ message: "nope" }));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 20,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:12:5
   node: TSESTree.Node | null,
 ): node is TSESTree.NewExpression {
   return (
-    node?.type === AST_NODE_TYPES.NewExpression &&
-    node.callee.type === AST_NODE_TYPES.Identifier &&
-    GENERIC_ERROR_CTORS.has(node.callee.name)
+    false
   );
 }
killedBy: effect-error-erasure valid // eslint-disable-next-line @rule-tester/effect-error-erasure -- suppression test
const fail = () => Effect.fail(new Error('boom'));
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/effect-error-erasure').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:26:5
   node: TSESTree.Expression,
 ): boolean {
   if (
-    node.type !== AST_NODE_TYPES.ArrowFunctionExpression &&
+    true &&
     node.type !== AST_NODE_TYPES.FunctionExpression
   ) {
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError(() => new Error('boom')));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:27:5
 ): boolean {
   if (
     node.type !== AST_NODE_TYPES.ArrowFunctionExpression &&
-    node.type !== AST_NODE_TYPES.FunctionExpression
+    true
   ) {
     return false;
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError(function (err) { return new RangeError(String(err)); }));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] MethodExpression
src/rules/effect-error-erasure.ts:36:10
     return isGenericErrorCtor(node.body);
   }
 
-  return node.body.body.some(
-    (statement) =>
-      statement.type === AST_NODE_TYPES.ReturnStatement &&
-      isGenericErrorCtor(statement.argument),
-  );
+  return node.body.body.every(statement => statement.type === AST_NODE_TYPES.ReturnStatement && isGenericErrorCtor(statement.argument));
 }
 
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError((err) => { return new Error('boom'); return new ConfigLoadError({ cause: err }); }));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrowFunction
src/rules/effect-error-erasure.ts:37:5
   }
 
   return node.body.body.some(
-    (statement) =>
-      statement.type === AST_NODE_TYPES.ReturnStatement &&
-      isGenericErrorCtor(statement.argument),
+    () => undefined,
   );
 }
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError(function (err) { return new RangeError(String(err)); }));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:38:7
 
   return node.body.body.some(
     (statement) =>
-      statement.type === AST_NODE_TYPES.ReturnStatement &&
-      isGenericErrorCtor(statement.argument),
+      false,
   );
 }
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError(function (err) { return new RangeError(String(err)); }));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/effect-error-erasure.ts:38:7
 
   return node.body.body.some(
     (statement) =>
-      statement.type === AST_NODE_TYPES.ReturnStatement &&
-      isGenericErrorCtor(statement.argument),
+      true,
   );
 }

[Killed] BlockStatement
src/rules/effect-error-erasure.ts:62:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        const firstArgument = node.arguments[0] ?? null;
-        if (
-          isEffectCall(node, "fail") &&
-          isGenericErrorCtor(firstArgument)
-        ) {
-          context.report({ node, messageId: "effectErrorErasure" });
-          return;
-        }
-
-        if (!isEffectCall(node, "mapError")) return;
-        const mapper = node.arguments[0];
-        if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
-          return;
-        }
-        if (!functionReturnsGenericError(mapper)) {
-          return;
-        }
-        context.report({ node, messageId: "effectErrorErasure" });
-      },
+      CallExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/effect-error-erasure fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -377032512, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/rules/effect-error-erasure.ts:63:31
   create(context) {
     return {
       CallExpression(node) {
-        const firstArgument = node.arguments[0] ?? null;
+        const firstArgument = node.arguments[0] && null;
         if (
           isEffectCall(node, "fail") &&
killedBy: property: rule correctness Property 2: agent-code-guard/effect-error-erasure fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 765022519, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:65:11
       CallExpression(node) {
         const firstArgument = node.arguments[0] ?? null;
         if (
-          isEffectCall(node, "fail") &&
-          isGenericErrorCtor(firstArgument)
+          false
         ) {
           context.report({ node, messageId: "effectErrorErasure" });
killedBy: property: rule correctness Property 2: agent-code-guard/effect-error-erasure fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1283915799, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/rules/effect-error-erasure.ts:65:11
       CallExpression(node) {
         const firstArgument = node.arguments[0] ?? null;
         if (
-          isEffectCall(node, "fail") &&
-          isGenericErrorCtor(firstArgument)
+          isEffectCall(node, "fail") || isGenericErrorCtor(firstArgument)
         ) {
           context.report({ node, messageId: "effectErrorErasure" });
killedBy: effect-error-erasure valid const fail = () => Effect.fail(new NotConnectedError({ message: "nope" }));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 20,
    nodeType: 'CallExpression',

[Killed] BlockStatement
src/rules/effect-error-erasure.ts:67:11
         if (
           isEffectCall(node, "fail") &&
           isGenericErrorCtor(firstArgument)
-        ) {
-          context.report({ node, messageId: "effectErrorErasure" });
-          return;
-        }
+        ) {}
 
         if (!isEffectCall(node, "mapError")) return;
killedBy: property: rule correctness Property 2: agent-code-guard/effect-error-erasure fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1919678694, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:72:13
           return;
         }
 
-        if (!isEffectCall(node, "mapError")) return;
+        if (false) return;
         const mapper = node.arguments[0];
         if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
killedBy: effect-error-erasure valid const mapped = effect.pipe(Effect.map(() => new Error('boom')));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 28,
    nodeType: 'CallExpression',

[Killed] BooleanLiteral
src/rules/effect-error-erasure.ts:72:13
           return;
         }
 
-        if (!isEffectCall(node, "mapError")) return;
+        if (isEffectCall(node, "mapError")) return;
         const mapper = node.arguments[0];
         if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
killedBy: effect-error-erasure valid const mapped = effect.pipe(Effect.map(() => new Error('boom')));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 28,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:74:13
 
         if (!isEffectCall(node, "mapError")) return;
         const mapper = node.arguments[0];
-        if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
+        if (false || mapper.type === AST_NODE_TYPES.SpreadElement) {
           return;
         }
killedBy: effect-error-erasure valid const mapped = effect.pipe(Effect.mapError());
statusReason: Cannot read properties of undefined (reading 'type')
Occurred while linting file.ts:1
Rule: "@rule-tester/effect-error-erasure"

[Killed] ConditionalExpression
src/rules/effect-error-erasure.ts:77:13
         if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
           return;
         }
-        if (!functionReturnsGenericError(mapper)) {
+        if (true) {
           return;
         }
killedBy: effect-error-erasure invalid const mapped = effect.pipe(Effect.mapError(() => new Error('boom')));
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/effect-error-erasure.ts:77:51
         if (mapper === undefined || mapper.type === AST_NODE_TYPES.SpreadElement) {
           return;
         }
-        if (!functionReturnsGenericError(mapper)) {
-          return;
-        }
+        if (!functionReturnsGenericError(mapper)) {}
         context.report({ node, messageId: "effectErrorErasure" });
       },
killedBy: effect-error-erasure valid const run = effect.pipe(Effect.mapError((err) => new ConfigLoadError({ cause: err })));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 25,
    nodeType: 'CallExpression',
