[Killed] ObjectLiteral
src/rules/effect-promise.ts:22:12
   },
   defaultOptions: [],
   create(context) {
-    return {
-      CallExpression(node) {
-        if (!isNamedMemberCall(node, "Effect", "promise")) return;
-        context.report({ node, messageId: "effectPromise" });
-      },
-    };
+    return {};
   },
 });
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1256822891, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/effect-promise.ts:23:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        if (!isNamedMemberCall(node, "Effect", "promise")) return;
-        context.report({ node, messageId: "effectPromise" });
-      },
+      CallExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1379015196, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/effect-promise.ts:24:13
   create(context) {
     return {
       CallExpression(node) {
-        if (!isNamedMemberCall(node, "Effect", "promise")) return;
+        if (isNamedMemberCall(node, "Effect", "promise")) return;
         context.report({ node, messageId: "effectPromise" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 823422164, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/effect-promise.ts:24:13
   create(context) {
     return {
       CallExpression(node) {
-        if (!isNamedMemberCall(node, "Effect", "promise")) return;
+        if (true) return;
         context.report({ node, messageId: "effectPromise" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1369616648, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
