[Killed] ConditionalExpression
src/rules/either-discriminant.ts:11:5
 
 function isEitherTagLiteral(node: TSESTree.Node | null): boolean {
   return (
-    node?.type === AST_NODE_TYPES.Literal &&
-    typeof node.value === "string" &&
-    EITHER_TAGS.has(node.value)
+    true
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 434015670, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:11:5
 
 function isEitherTagLiteral(node: TSESTree.Node | null): boolean {
   return (
-    node?.type === AST_NODE_TYPES.Literal &&
-    typeof node.value === "string" &&
-    EITHER_TAGS.has(node.value)
+    false
   );
 }
killedBy: either-discriminant valid // eslint-disable-next-line @rule-tester/either-discriminant -- suppression test
if (result._tag === 'Left') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/either-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/either-discriminant.ts:18:53
 }
 
 function isTagAccess(node: TSESTree.Node): boolean {
-  if (node.type === AST_NODE_TYPES.ChainExpression) {
-    return isTagAccess(node.expression);
-  }
+  if (node.type === AST_NODE_TYPES.ChainExpression) {}
   return (
     node.type === AST_NODE_TYPES.MemberExpression &&
killedBy: either-discriminant invalid if (result?._tag === "Right") return;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:22:5
     return isTagAccess(node.expression);
   }
   return (
-    node.type === AST_NODE_TYPES.MemberExpression &&
-    !node.computed &&
-    node.property.type === AST_NODE_TYPES.Identifier &&
-    node.property.name === "_tag"
+    false
   );
 }
killedBy: either-discriminant valid // eslint-disable-next-line @rule-tester/either-discriminant -- suppression test
if (result._tag === 'Left') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/either-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:22:5
     return isTagAccess(node.expression);
   }
   return (
-    node.type === AST_NODE_TYPES.MemberExpression &&
-    !node.computed &&
-    node.property.type === AST_NODE_TYPES.Identifier &&
-    node.property.name === "_tag"
+    true
   );
 }
killedBy: either-discriminant valid switch (result.tag) { case "Left": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] BooleanLiteral
src/rules/either-discriminant.ts:23:5
   }
   return (
     node.type === AST_NODE_TYPES.MemberExpression &&
-    !node.computed &&
+    node.computed &&
     node.property.type === AST_NODE_TYPES.Identifier &&
     node.property.name === "_tag"
killedBy: either-discriminant valid // eslint-disable-next-line @rule-tester/either-discriminant -- suppression test
if (result._tag === 'Left') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/either-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] EqualityOperator
src/rules/either-discriminant.ts:24:5
   return (
     node.type === AST_NODE_TYPES.MemberExpression &&
     !node.computed &&
-    node.property.type === AST_NODE_TYPES.Identifier &&
+    node.property.type !== AST_NODE_TYPES.Identifier &&
     node.property.name === "_tag"
   );
killedBy: either-discriminant valid class Box { #_tag = "Left"; run() { if ("Left" === this.#_tag) return; } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 41,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:24:5
   return (
     node.type === AST_NODE_TYPES.MemberExpression &&
     !node.computed &&
-    node.property.type === AST_NODE_TYPES.Identifier &&
+    true &&
     node.property.name === "_tag"
   );
killedBy: either-discriminant valid class Box { #_tag = "Left"; run() { if ("Left" === this.#_tag) return; } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 41,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:25:5
     node.type === AST_NODE_TYPES.MemberExpression &&
     !node.computed &&
     node.property.type === AST_NODE_TYPES.Identifier &&
-    node.property.name === "_tag"
+    true
   );
 }
killedBy: either-discriminant valid switch (result.tag) { case "Left": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] EqualityOperator
src/rules/either-discriminant.ts:25:5
     node.type === AST_NODE_TYPES.MemberExpression &&
     !node.computed &&
     node.property.type === AST_NODE_TYPES.Identifier &&
-    node.property.name === "_tag"
+    node.property.name !== "_tag"
   );
 }
killedBy: either-discriminant valid switch (result.tag) { case "Left": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] BlockStatement
src/rules/either-discriminant.ts:47:48
   },
   defaultOptions: [],
   create(context) {
-    function report(node: TSESTree.Node): void {
-      context.report({ node, messageId: "eitherDiscriminant" });
-    }
+    function report(node: TSESTree.Node): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/either-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -958785498, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/either-discriminant.ts:52:28
     }
 
     return {
-      CallExpression(node) {
-        const callee = node.callee;
-        if (callee.type !== AST_NODE_TYPES.MemberExpression || callee.computed) {
-          return;
-        }
-        if (
-          callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Either"
-        ) {
-          return;
-        }
-        if (
-          callee.property.type !== AST_NODE_TYPES.Identifier ||
-          !EITHER_GUARDS.has(callee.property.name)
-        ) {
-          return;
-        }
-        report(node);
-      },
+      CallExpression(node) {},
       BinaryExpression(node) {
         if (!EQUALITY_OPERATORS.has(node.operator)) return;
killedBy: either-discriminant invalid if (Either.isLeft(result)) return result.left;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:58:11
           return;
         }
         if (
-          callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Either"
+          false
         ) {
           return;
killedBy: either-discriminant valid const ok = Maybe.isLeft(result);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 12,
    nodeType: 'CallExpression',

[Killed] EqualityOperator
src/rules/either-discriminant.ts:59:11
         }
         if (
           callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Either"
+          callee.object.name === "Either"
         ) {
           return;
killedBy: either-discriminant valid const ok = Maybe.isLeft(result);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 12,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:59:11
         }
         if (
           callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Either"
+          false
         ) {
           return;
killedBy: either-discriminant valid const ok = Maybe.isLeft(result);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 12,
    nodeType: 'CallExpression',

[Killed] BlockStatement
src/rules/either-discriminant.ts:60:11
         if (
           callee.object.type !== AST_NODE_TYPES.Identifier ||
           callee.object.name !== "Either"
-        ) {
-          return;
-        }
+        ) {}
         if (
           callee.property.type !== AST_NODE_TYPES.Identifier ||
killedBy: either-discriminant valid const ok = Maybe.isLeft(result);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 12,
    nodeType: 'CallExpression',

[Killed] EqualityOperator
src/rules/either-discriminant.ts:64:11
           return;
         }
         if (
-          callee.property.type !== AST_NODE_TYPES.Identifier ||
+          callee.property.type === AST_NODE_TYPES.Identifier ||
           !EITHER_GUARDS.has(callee.property.name)
         ) {
killedBy: property: rule correctness Property 2: agent-code-guard/either-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1998843227, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:64:11
           return;
         }
         if (
-          callee.property.type !== AST_NODE_TYPES.Identifier ||
-          !EITHER_GUARDS.has(callee.property.name)
+          false
         ) {
           return;
killedBy: either-discriminant valid const rendered = Either.match({ onLeft: (left) => left, onRight: (right) => right })(either);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 18,
    nodeType: 'CallExpression',

[Killed] BooleanLiteral
src/rules/either-discriminant.ts:65:11
         }
         if (
           callee.property.type !== AST_NODE_TYPES.Identifier ||
-          !EITHER_GUARDS.has(callee.property.name)
+          EITHER_GUARDS.has(callee.property.name)
         ) {
           return;
killedBy: either-discriminant valid const rendered = Either.match({ onLeft: (left) => left, onRight: (right) => right })(either);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 18,
    nodeType: 'CallExpression',

[Killed] BlockStatement
src/rules/either-discriminant.ts:66:11
         if (
           callee.property.type !== AST_NODE_TYPES.Identifier ||
           !EITHER_GUARDS.has(callee.property.name)
-        ) {
-          return;
-        }
+        ) {}
         report(node);
       },
killedBy: either-discriminant valid const rendered = Either.match({ onLeft: (left) => left, onRight: (right) => right })(either);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 18,
    nodeType: 'CallExpression',

[Killed] BlockStatement
src/rules/either-discriminant.ts:71:30
         }
         report(node);
       },
-      BinaryExpression(node) {
-        if (!EQUALITY_OPERATORS.has(node.operator)) return;
-        const leftIsTag = isTagAccess(node.left);
-        const rightIsTag = isTagAccess(node.right);
-        if (leftIsTag === rightIsTag) return;
-        if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
-        report(node);
-      },
+      BinaryExpression(node) {},
       SwitchStatement(node) {
         if (!isTagAccess(node.discriminant)) return;
killedBy: either-discriminant valid // eslint-disable-next-line @rule-tester/either-discriminant -- suppression test
if (result._tag === 'Left') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/either-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:72:13
         report(node);
       },
       BinaryExpression(node) {
-        if (!EQUALITY_OPERATORS.has(node.operator)) return;
+        if (true) return;
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
killedBy: either-discriminant valid // eslint-disable-next-line @rule-tester/either-discriminant -- suppression test
if (result._tag === 'Left') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/either-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/rules/either-discriminant.ts:72:13
         report(node);
       },
       BinaryExpression(node) {
-        if (!EQUALITY_OPERATORS.has(node.operator)) return;
+        if (EQUALITY_OPERATORS.has(node.operator)) return;
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
killedBy: either-discriminant valid if (result._tag > "Left") return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] EqualityOperator
src/rules/either-discriminant.ts:75:13
         if (!EQUALITY_OPERATORS.has(node.operator)) return;
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
-        if (leftIsTag === rightIsTag) return;
+        if (leftIsTag !== rightIsTag) return;
         if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
         report(node);
killedBy: either-discriminant valid if ("Left" === kind) return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:75:13
         if (!EQUALITY_OPERATORS.has(node.operator)) return;
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
-        if (leftIsTag === rightIsTag) return;
+        if (false) return;
         if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
         report(node);
killedBy: either-discriminant valid if ("Left" === kind) return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] BooleanLiteral
src/rules/either-discriminant.ts:76:13
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
         if (leftIsTag === rightIsTag) return;
-        if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
+        if (isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
         report(node);
       },
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 401185300, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:76:13
         const leftIsTag = isTagAccess(node.left);
         const rightIsTag = isTagAccess(node.right);
         if (leftIsTag === rightIsTag) return;
-        if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
+        if (false) return;
         report(node);
       },
killedBy: either-discriminant valid if (opt._tag === "Some") return opt.value;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] BlockStatement
src/rules/either-discriminant.ts:79:29
         if (!isEitherTagLiteral(leftIsTag ? node.right : node.left)) return;
         report(node);
       },
-      SwitchStatement(node) {
-        if (!isTagAccess(node.discriminant)) return;
-        if (!node.cases.some((caseNode) => isEitherTagLiteral(caseNode.test))) {
-          return;
-        }
-        report(node);
-      },
+      SwitchStatement(node) {},
     };
   },
killedBy: either-discriminant invalid switch (result._tag) { case "Right": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/either-discriminant.ts:80:13
         report(node);
       },
       SwitchStatement(node) {
-        if (!isTagAccess(node.discriminant)) return;
+        if (isTagAccess(node.discriminant)) return;
         if (!node.cases.some((caseNode) => isEitherTagLiteral(caseNode.test))) {
           return;
killedBy: either-discriminant valid switch (result.tag) { case "Left": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/either-discriminant',
    severity: 2,
    message: 'Manual Either discriminant — use Either.match(...) instead of isLeft/isRight or `_tag` checks.',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:80:13
         report(node);
       },
       SwitchStatement(node) {
-        if (!isTagAccess(node.discriminant)) return;
+        if (true) return;
         if (!node.cases.some((caseNode) => isEitherTagLiteral(caseNode.test))) {
           return;
killedBy: either-discriminant invalid switch (result._tag) { case "Right": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/either-discriminant.ts:81:13
       },
       SwitchStatement(node) {
         if (!isTagAccess(node.discriminant)) return;
-        if (!node.cases.some((caseNode) => isEitherTagLiteral(caseNode.test))) {
+        if (true) {
           return;
         }
killedBy: either-discriminant invalid switch (result._tag) { case "Right": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrowFunction
src/rules/either-discriminant.ts:81:30
       },
       SwitchStatement(node) {
         if (!isTagAccess(node.discriminant)) return;
-        if (!node.cases.some((caseNode) => isEitherTagLiteral(caseNode.test))) {
+        if (!node.cases.some(() => undefined)) {
           return;
         }
killedBy: either-discriminant invalid switch (result._tag) { case "Right": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1
