[Killed] BlockStatement
src/rules/manual-brand.ts:28:82
   },
   defaultOptions: [],
   create(context) {
-    function maybeReport(node: Parameters<typeof findManualBrandMatch>[0]): void {
-      const result = findManualBrandMatch(node);
-      if (result === null) return;
-      context.report({
-        node: result.node,
-        messageId: "manualBrand",
-        data: { name: result.displayName },
-      });
-    }
+    function maybeReport(node: Parameters<typeof findManualBrandMatch>[0]): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2147300090, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
