[Killed] BlockStatement
src/rules/manual-option.ts:28:83
   },
   defaultOptions: [],
   create(context) {
-    function maybeReport(node: Parameters<typeof findManualOptionMatch>[0]): void {
-      const result = findManualOptionMatch(node);
-      if (result === null) return;
-      context.report({
-        node: result.node,
-        messageId: "manualOption",
-        data: { name: result.displayName },
-      });
-    }
+    function maybeReport(node: Parameters<typeof findManualOptionMatch>[0]): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1872309695, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/rules/manual-option.ts:38:12
       });
     }
 
-    return {
-      TSTypeAliasDeclaration: maybeReport,
-      TSInterfaceDeclaration: maybeReport,
-      ClassDeclaration: maybeReport,
-      FunctionDeclaration: maybeReport,
-      [VARIABLE_SURFACE_SELECTOR]: maybeReport,
-    };
+    return {};
   },
 });
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1897823420, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
