[Killed] BlockStatement
src/rules/manual-result.ts:28:83
   },
   defaultOptions: [],
   create(context) {
-    function maybeReport(node: Parameters<typeof findManualResultMatch>[0]): void {
-      const result = findManualResultMatch(node);
-      if (result === null) return;
-      context.report({
-        node: result.node,
-        messageId: "manualResult",
-        data: { name: result.displayName },
-      });
-    }
+    function maybeReport(node: Parameters<typeof findManualResultMatch>[0]): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 980025593, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
