[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:15:10
 const ERROR_NAME_RE = /(Error|Failure|Failed|Exception)$/;
 
 function looksErrorLike(name: string | null | undefined): boolean {
-  return typeof name === "string" && ERROR_NAME_RE.test(name);
+  return false;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-tagged-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1761970093, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:15:10
 const ERROR_NAME_RE = /(Error|Failure|Failed|Exception)$/;
 
 function looksErrorLike(name: string | null | undefined): boolean {
-  return typeof name === "string" && ERROR_NAME_RE.test(name);
+  return true;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -185937214, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/manual-tagged-error.ts:31:10
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
   computed: boolean,
 ): boolean {
-  return getStaticStringKey(key, computed) === "_tag";
+  return getStaticStringKey(key, computed) !== "_tag";
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-tagged-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 472152711, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:31:10
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
   computed: boolean,
 ): boolean {
-  return getStaticStringKey(key, computed) === "_tag";
+  return true;
 }
 
killedBy: manual-tagged-error valid interface RpcFailure { readonly message: string; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSInterfaceDeclaration',

[Killed] MethodExpression
src/rules/manual-tagged-error.ts:35:10
 }
 
 function classHasManualTagField(node: TSESTree.ClassDeclaration | TSESTree.ClassExpression): boolean {
-  return node.body.body.some(
-    (member) =>
-      member.type === AST_NODE_TYPES.PropertyDefinition &&
-      isManualTagKey(member.key, member.computed),
-  );
+  return node.body.body.every(member => member.type === AST_NODE_TYPES.PropertyDefinition && isManualTagKey(member.key, member.computed));
 }
 
killedBy: manual-tagged-error valid class RunError extends Data.TaggedError("RunError")<{}> {}
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RunError — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',

[Killed] ArrowFunction
src/rules/manual-tagged-error.ts:36:5
 
 function classHasManualTagField(node: TSESTree.ClassDeclaration | TSESTree.ClassExpression): boolean {
   return node.body.body.some(
-    (member) =>
-      member.type === AST_NODE_TYPES.PropertyDefinition &&
-      isManualTagKey(member.key, member.computed),
+    () => undefined,
   );
 }
killedBy: manual-tagged-error invalid class RunError extends Error { readonly _tag = "RunError" as const; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:37:7
 function classHasManualTagField(node: TSESTree.ClassDeclaration | TSESTree.ClassExpression): boolean {
   return node.body.body.some(
     (member) =>
-      member.type === AST_NODE_TYPES.PropertyDefinition &&
-      isManualTagKey(member.key, member.computed),
+      true,
   );
 }
killedBy: manual-tagged-error valid class RunError extends Error { readonly code = "RunError" as const; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RunError — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:37:7
 function classHasManualTagField(node: TSESTree.ClassDeclaration | TSESTree.ClassExpression): boolean {
   return node.body.body.some(
     (member) =>
-      member.type === AST_NODE_TYPES.PropertyDefinition &&
-      isManualTagKey(member.key, member.computed),
+      false,
   );
 }
killedBy: manual-tagged-error invalid class RunError extends Error { readonly _tag = "RunError" as const; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:49:10
 }
 
 function typeElementIsTag(member: TSESTree.TypeElement): boolean {
-  return member.type === AST_NODE_TYPES.TSPropertySignature &&
-    isManualTagKey(member.key, member.computed);
+  return false;
 }
 
killedBy: manual-tagged-error valid // eslint-disable-next-line @rule-tester/manual-tagged-error -- suppression test
type RpcFailure = { readonly _tag: 'RpcFailure'; readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-tagged-error').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:49:10
 }
 
 function typeElementIsTag(member: TSESTree.TypeElement): boolean {
-  return member.type === AST_NODE_TYPES.TSPropertySignature &&
-    isManualTagKey(member.key, member.computed);
+  return true;
 }
 
killedBy: manual-tagged-error valid interface RpcFailure { readonly message: string; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSInterfaceDeclaration',

[Killed] MethodExpression
src/rules/manual-tagged-error.ts:56:14
 function typeContainsManualTag(node: TSESTree.TypeNode): boolean {
   switch (node.type) {
     case AST_NODE_TYPES.TSTypeLiteral:
-      return node.members.some(typeElementIsTag);
+      return node.members.every(typeElementIsTag);
     case AST_NODE_TYPES.TSUnionType:
     case AST_NODE_TYPES.TSIntersectionType:
killedBy: manual-tagged-error valid // eslint-disable-next-line @rule-tester/manual-tagged-error -- suppression test
type RpcFailure = { readonly _tag: 'RpcFailure'; readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-tagged-error').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:58:5
     case AST_NODE_TYPES.TSTypeLiteral:
       return node.members.some(typeElementIsTag);
     case AST_NODE_TYPES.TSUnionType:
-    case AST_NODE_TYPES.TSIntersectionType:
-      return node.types.some(typeContainsManualTag);
+    case AST_NODE_TYPES.TSIntersectionType:
     default:
       return false;
killedBy: manual-tagged-error invalid type MoltAmountError = { readonly _tag: 'NotInteger'; readonly value: number } | { readonly _tag: 'Negative'; readonly value: number };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] MethodExpression
src/rules/manual-tagged-error.ts:59:14
       return node.members.some(typeElementIsTag);
     case AST_NODE_TYPES.TSUnionType:
     case AST_NODE_TYPES.TSIntersectionType:
-      return node.types.some(typeContainsManualTag);
+      return node.types.every(typeContainsManualTag);
     default:
       return false;
killedBy: manual-tagged-error invalid type RpcFailure = { readonly '_tag': 'RpcFailure'; readonly message: string } & { readonly cause: unknown };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] MethodExpression
src/rules/manual-tagged-error.ts:70:10
 }
 
 function objectHasManualTag(node: TSESTree.ObjectExpression): boolean {
-  return node.properties.some(
-    (member) =>
-      member.type === AST_NODE_TYPES.Property && objectPropertyIsTag(member),
-  );
+  return node.properties.every(member => member.type === AST_NODE_TYPES.Property && objectPropertyIsTag(member));
 }
 
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrowFunction
src/rules/manual-tagged-error.ts:71:5
 
 function objectHasManualTag(node: TSESTree.ObjectExpression): boolean {
   return node.properties.some(
-    (member) =>
-      member.type === AST_NODE_TYPES.Property && objectPropertyIsTag(member),
+    () => undefined,
   );
 }
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:72:7
 function objectHasManualTag(node: TSESTree.ObjectExpression): boolean {
   return node.properties.some(
     (member) =>
-      member.type === AST_NODE_TYPES.Property && objectPropertyIsTag(member),
+      true,
   );
 }
killedBy: manual-tagged-error valid const err = new PlannedHarnessIngressError({ cause: ParseFailure({ path, message }) });
statusReason: Should have no errors but had 2: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface tagged value — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 44,
    nodeType: 'ObjectExpression',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:72:7
 function objectHasManualTag(node: TSESTree.ObjectExpression): boolean {
   return node.properties.some(
     (member) =>
-      member.type === AST_NODE_TYPES.Property && objectPropertyIsTag(member),
+      false,
   );
 }
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:77:41
 }
 
 function getObjectTagName(node: TSESTree.ObjectExpression): string | null {
-  for (const member of node.properties) {
-    if (member.type !== AST_NODE_TYPES.Property) continue;
-    if (!objectPropertyIsTag(member)) continue;
-    return getStringLiteralValue(member.value);
-  }
+  for (const member of node.properties) {}
   return null;
 }
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:79:9
 function getObjectTagName(node: TSESTree.ObjectExpression): string | null {
   for (const member of node.properties) {
     if (member.type !== AST_NODE_TYPES.Property) continue;
-    if (!objectPropertyIsTag(member)) continue;
+    if (objectPropertyIsTag(member)) continue;
     return getStringLiteralValue(member.value);
   }
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:79:9
 function getObjectTagName(node: TSESTree.ObjectExpression): string | null {
   for (const member of node.properties) {
     if (member.type !== AST_NODE_TYPES.Property) continue;
-    if (!objectPropertyIsTag(member)) continue;
+    if (false) continue;
     return getStringLiteralValue(member.value);
   }

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:99:5
     case AST_NODE_TYPES.TSAsExpression:
     case AST_NODE_TYPES.TSNonNullExpression:
     case AST_NODE_TYPES.TSSatisfiesExpression:
-    case AST_NODE_TYPES.TSTypeAssertion:
-      return true;
+    case AST_NODE_TYPES.TSTypeAssertion:
     default:
       return false;
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message } as const);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:100:14
     case AST_NODE_TYPES.TSNonNullExpression:
     case AST_NODE_TYPES.TSSatisfiesExpression:
     case AST_NODE_TYPES.TSTypeAssertion:
-      return true;
+      return false;
     default:
       return false;
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message } as const);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Timeout] BlockStatement
src/rules/manual-tagged-error.ts:109:28
 function objectIsReturnedValue(node: TSESTree.ObjectExpression): boolean {
   let child: TSESTree.Node = node;
   let current = getParent(node);
-  while (current !== null) {
-    if (current.type === AST_NODE_TYPES.ReturnStatement) {
-      return current.argument === child;
-    }
-    if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
-      current.expression &&
-      current.body === child
-    ) {
-      return true;
-    }
-    if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
-      current.type === AST_NODE_TYPES.FunctionDeclaration ||
-      current.type === AST_NODE_TYPES.FunctionExpression
-    ) {
-      return false;
-    }
-    if (!isTransparentReturnWrapper(current)) return false;
-    child = current;
-    current = getParent(current);
-  }
+  while (current !== null) {}
   return false;
 }

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:110:58
   let child: TSESTree.Node = node;
   let current = getParent(node);
   while (current !== null) {
-    if (current.type === AST_NODE_TYPES.ReturnStatement) {
-      return current.argument === child;
-    }
+    if (current.type === AST_NODE_TYPES.ReturnStatement) {}
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/manual-tagged-error.ts:111:14
   let current = getParent(node);
   while (current !== null) {
     if (current.type === AST_NODE_TYPES.ReturnStatement) {
-      return current.argument === child;
+      return current.argument !== child;
     }
     if (
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:111:14
   let current = getParent(node);
   while (current !== null) {
     if (current.type === AST_NODE_TYPES.ReturnStatement) {
-      return current.argument === child;
+      return false;
     }
     if (
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:114:7
       return current.argument === child;
     }
     if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
-      current.expression &&
-      current.body === child
+      false
     ) {
       return true;
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/manual-tagged-error.ts:116:7
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
       current.expression &&
-      current.body === child
+      current.body !== child
     ) {
       return true;
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:116:7
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
       current.expression &&
-      current.body === child
+      true
     ) {
       return true;

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:117:7
       current.type === AST_NODE_TYPES.ArrowFunctionExpression &&
       current.expression &&
       current.body === child
-    ) {
-      return true;
-    }
+    ) {}
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:121:7
       return true;
     }
     if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
-      current.type === AST_NODE_TYPES.FunctionDeclaration ||
-      current.type === AST_NODE_TYPES.FunctionExpression
+      false
     ) {
       return false;

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:121:7
       return true;
     }
     if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
-      current.type === AST_NODE_TYPES.FunctionDeclaration ||
+      false ||
       current.type === AST_NODE_TYPES.FunctionExpression
     ) {

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:122:7
     }
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
-      current.type === AST_NODE_TYPES.FunctionDeclaration ||
+      false ||
       current.type === AST_NODE_TYPES.FunctionExpression
     ) {

[Killed] EqualityOperator
src/rules/manual-tagged-error.ts:123:7
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
       current.type === AST_NODE_TYPES.FunctionDeclaration ||
-      current.type === AST_NODE_TYPES.FunctionExpression
+      current.type !== AST_NODE_TYPES.FunctionExpression
     ) {
       return false;
killedBy: manual-tagged-error invalid const parse = () => ({ _tag: "ParseFailure", path, message } as const);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/manual-tagged-error.ts:123:7
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
       current.type === AST_NODE_TYPES.FunctionDeclaration ||
-      current.type === AST_NODE_TYPES.FunctionExpression
+      false
     ) {
       return false;

[NoCoverage] BlockStatement
src/rules/manual-tagged-error.ts:124:7
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
       current.type === AST_NODE_TYPES.FunctionDeclaration ||
       current.type === AST_NODE_TYPES.FunctionExpression
-    ) {
-      return false;
-    }
+    ) {}
     if (!isTransparentReturnWrapper(current)) return false;
     child = current;

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:127:9
     ) {
       return false;
     }
-    if (!isTransparentReturnWrapper(current)) return false;
+    if (isTransparentReturnWrapper(current)) return false;
     child = current;
     current = getParent(current);
killedBy: manual-tagged-error valid const parse = () => new Box({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface ParseFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 38,
    nodeType: 'ObjectExpression',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:127:9
     ) {
       return false;
     }
-    if (!isTransparentReturnWrapper(current)) return false;
+    if (false) return false;
     child = current;
     current = getParent(current);
killedBy: manual-tagged-error valid const parse = () => new Box({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface ParseFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 38,
    nodeType: 'ObjectExpression',

[Timeout] BlockStatement
src/rules/manual-tagged-error.ts:136:28
 
 function objectIsErrorPayload(node: TSESTree.ObjectExpression): boolean {
   let current = getParent(node);
-  while (current !== null) {
-    if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
-      return true;
-    }
-    if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
-      return true;
-    }
-    if (
-      current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
-      current.type === AST_NODE_TYPES.FunctionDeclaration ||
-      current.type === AST_NODE_TYPES.FunctionExpression
-    ) {
-      return false;
-    }
-    current = getParent(current);
-  }
+  while (current !== null) {}
   return false;
 }

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:137:96
 function objectIsErrorPayload(node: TSESTree.ObjectExpression): boolean {
   let current = getParent(node);
   while (current !== null) {
-    if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
-      return true;
-    }
+    if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {}
     if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
       return true;
killedBy: manual-tagged-error invalid const parse = () => new PlannedHarnessIngressError({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:137:9
 function objectIsErrorPayload(node: TSESTree.ObjectExpression): boolean {
   let current = getParent(node);
   while (current !== null) {
-    if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
+    if (false) {
       return true;
     }
killedBy: manual-tagged-error invalid const parse = () => new PlannedHarnessIngressError({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:138:14
   let current = getParent(node);
   while (current !== null) {
     if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
-      return true;
+      return false;
     }
     if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
killedBy: manual-tagged-error invalid const parse = () => new PlannedHarnessIngressError({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:140:86
     if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
       return true;
     }
-    if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
-      return true;
-    }
+    if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {}
     if (
       current.type === AST_NODE_TYPES.ArrowFunctionExpression ||
killedBy: manual-tagged-error invalid const parse = () => Effect.fail({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:140:9
     if (current.type === AST_NODE_TYPES.NewExpression && newExpressionLooksErrorLike(current)) {
       return true;
     }
-    if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
+    if (false) {
       return true;
     }
killedBy: manual-tagged-error invalid const parse = () => Effect.fail({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:141:14
       return true;
     }
     if (current.type === AST_NODE_TYPES.CallExpression && isEffectFailCall(current)) {
-      return true;
+      return false;
     }
     if (
killedBy: manual-tagged-error invalid const parse = () => Effect.fail({ _tag: "ParseFailure", path, message });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:173:62
   },
   defaultOptions: [],
   create(context) {
-    function report(node: TSESTree.Node, name: string): void {
-      context.report({
-        node,
-        messageId: "manualTaggedError",
-        data: { name },
-      });
-    }
+    function report(node: TSESTree.Node, name: string): void {}
 
     function maybeReportClass(
killedBy: property: rule correctness Property 2: agent-code-guard/manual-tagged-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -591542513, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:183:13
 
     function maybeReportClass(
       node: TSESTree.ClassDeclaration | TSESTree.ClassExpression,
-    ): void {
-      if (!classHasManualTagField(node)) return;
-      const className = node.id?.name ?? "(anonymous class)";
-      if (!looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
-      report(node, className);
-    }
+    ): void {}
 
     return {
killedBy: manual-tagged-error invalid class RunError extends Error { readonly _tag = "RunError" as const; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:184:11
     function maybeReportClass(
       node: TSESTree.ClassDeclaration | TSESTree.ClassExpression,
     ): void {
-      if (!classHasManualTagField(node)) return;
+      if (classHasManualTagField(node)) return;
       const className = node.id?.name ?? "(anonymous class)";
       if (!looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
killedBy: manual-tagged-error valid class RunError extends Data.TaggedError("RunError")<{}> {}
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RunError — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:184:11
     function maybeReportClass(
       node: TSESTree.ClassDeclaration | TSESTree.ClassExpression,
     ): void {
-      if (!classHasManualTagField(node)) return;
+      if (false) return;
       const className = node.id?.name ?? "(anonymous class)";
       if (!looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
killedBy: manual-tagged-error valid class RunError extends Data.TaggedError("RunError")<{}> {}
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RunError — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:186:11
     ): void {
       if (!classHasManualTagField(node)) return;
       const className = node.id?.name ?? "(anonymous class)";
-      if (!looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
+      if (looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
       report(node, className);
     }
killedBy: manual-tagged-error valid class Outcome { readonly _tag = "SpawnFailed" as const; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface Outcome — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:186:41
     ): void {
       if (!classHasManualTagField(node)) return;
       const className = node.id?.name ?? "(anonymous class)";
-      if (!looksErrorLike(className) && !superClassLooksErrorLike(node)) return;
+      if (!looksErrorLike(className) && superClassLooksErrorLike(node)) return;
       report(node, className);
     }
killedBy: manual-tagged-error valid class Outcome { readonly _tag = "SpawnFailed" as const; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface Outcome — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'ClassDeclaration',
