[Killed] ObjectLiteral
src/rules/manual-tagged-error.ts:190:12
       report(node, className);
     }
 
-    return {
-      ClassDeclaration: maybeReportClass,
-      ClassExpression: maybeReportClass,
-      TSInterfaceDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
-        if (!node.body.body.some(typeElementIsTag)) return;
-        report(node, node.id.name);
-      },
-      TSTypeAliasDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
-        if (!typeContainsManualTag(node.typeAnnotation)) return;
-        report(node, node.id.name);
-      },
-      ObjectExpression(node) {
-        if (!objectHasManualTag(node)) return;
-        const tagName = getObjectTagName(node);
-        if (objectIsErrorPayload(node)) {
-          report(node, tagName ?? "tagged value");
-          return;
-        }
-        if (!looksErrorLike(tagName)) return;
-        if (!objectIsReturnedValue(node)) return;
-        report(node, tagName ?? "tagged value");
-      },
-    };
+    return {};
   },
 });
killedBy: manual-tagged-error valid // eslint-disable-next-line @rule-tester/manual-tagged-error -- suppression test
type RpcFailure = { readonly _tag: 'RpcFailure'; readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-tagged-error').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:193:36
     return {
       ClassDeclaration: maybeReportClass,
       ClassExpression: maybeReportClass,
-      TSInterfaceDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
-        if (!node.body.body.some(typeElementIsTag)) return;
-        report(node, node.id.name);
-      },
+      TSInterfaceDeclaration(node) {},
       TSTypeAliasDeclaration(node) {
         if (!looksErrorLike(node.id.name)) return;
killedBy: manual-tagged-error invalid interface RpcFailure { readonly _tag: 'RpcFailure'; readonly message: string; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:194:13
       ClassDeclaration: maybeReportClass,
       ClassExpression: maybeReportClass,
       TSInterfaceDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
+        if (false) return;
         if (!node.body.body.some(typeElementIsTag)) return;
         report(node, node.id.name);
killedBy: manual-tagged-error valid interface Player { readonly _tag: "Player"; readonly id: string; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface Player — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSInterfaceDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:194:13
       ClassDeclaration: maybeReportClass,
       ClassExpression: maybeReportClass,
       TSInterfaceDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
+        if (true) return;
         if (!node.body.body.some(typeElementIsTag)) return;
         report(node, node.id.name);
killedBy: manual-tagged-error invalid interface RpcFailure { readonly _tag: 'RpcFailure'; readonly message: string; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:195:13
       ClassExpression: maybeReportClass,
       TSInterfaceDeclaration(node) {
         if (!looksErrorLike(node.id.name)) return;
-        if (!node.body.body.some(typeElementIsTag)) return;
+        if (node.body.body.some(typeElementIsTag)) return;
         report(node, node.id.name);
       },
killedBy: manual-tagged-error valid interface RpcFailure { readonly message: string; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSInterfaceDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:195:13
       ClassExpression: maybeReportClass,
       TSInterfaceDeclaration(node) {
         if (!looksErrorLike(node.id.name)) return;
-        if (!node.body.body.some(typeElementIsTag)) return;
+        if (false) return;
         report(node, node.id.name);
       },
killedBy: manual-tagged-error valid interface RpcFailure { readonly message: string; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSInterfaceDeclaration',

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:198:36
         if (!node.body.body.some(typeElementIsTag)) return;
         report(node, node.id.name);
       },
-      TSTypeAliasDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
-        if (!typeContainsManualTag(node.typeAnnotation)) return;
-        report(node, node.id.name);
-      },
+      TSTypeAliasDeclaration(node) {},
       ObjectExpression(node) {
         if (!objectHasManualTag(node)) return;
killedBy: manual-tagged-error valid // eslint-disable-next-line @rule-tester/manual-tagged-error -- suppression test
type RpcFailure = { readonly _tag: 'RpcFailure'; readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-tagged-error').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:199:13
         report(node, node.id.name);
       },
       TSTypeAliasDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
+        if (looksErrorLike(node.id.name)) return;
         if (!typeContainsManualTag(node.typeAnnotation)) return;
         report(node, node.id.name);
killedBy: manual-tagged-error valid type TelemetryEvent = { readonly _tag: "RunStarted"; readonly id: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface TelemetryEvent — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:199:13
         report(node, node.id.name);
       },
       TSTypeAliasDeclaration(node) {
-        if (!looksErrorLike(node.id.name)) return;
+        if (false) return;
         if (!typeContainsManualTag(node.typeAnnotation)) return;
         report(node, node.id.name);
killedBy: manual-tagged-error valid type TelemetryEvent = { readonly _tag: "RunStarted"; readonly id: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface TelemetryEvent — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:200:13
       },
       TSTypeAliasDeclaration(node) {
         if (!looksErrorLike(node.id.name)) return;
-        if (!typeContainsManualTag(node.typeAnnotation)) return;
+        if (false) return;
         report(node, node.id.name);
       },
killedBy: manual-tagged-error valid type RpcFailure = { readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:200:13
       },
       TSTypeAliasDeclaration(node) {
         if (!looksErrorLike(node.id.name)) return;
-        if (!typeContainsManualTag(node.typeAnnotation)) return;
+        if (typeContainsManualTag(node.typeAnnotation)) return;
         report(node, node.id.name);
       },
killedBy: manual-tagged-error valid type RpcFailure = { readonly message: string };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface RpcFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:203:30
         if (!typeContainsManualTag(node.typeAnnotation)) return;
         report(node, node.id.name);
       },
-      ObjectExpression(node) {
-        if (!objectHasManualTag(node)) return;
-        const tagName = getObjectTagName(node);
-        if (objectIsErrorPayload(node)) {
-          report(node, tagName ?? "tagged value");
-          return;
-        }
-        if (!looksErrorLike(tagName)) return;
-        if (!objectIsReturnedValue(node)) return;
-        report(node, tagName ?? "tagged value");
-      },
+      ObjectExpression(node) {},
     };
   },
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:204:13
         report(node, node.id.name);
       },
       ObjectExpression(node) {
-        if (!objectHasManualTag(node)) return;
+        if (false) return;
         const tagName = getObjectTagName(node);
         if (objectIsErrorPayload(node)) {
killedBy: manual-tagged-error valid const err = new PlannedHarnessIngressError({ cause: ParseFailure({ path, message }) });
statusReason: Should have no errors but had 2: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface tagged value — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 44,
    nodeType: 'ObjectExpression',

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:204:13
         report(node, node.id.name);
       },
       ObjectExpression(node) {
-        if (!objectHasManualTag(node)) return;
+        if (objectHasManualTag(node)) return;
         const tagName = getObjectTagName(node);
         if (objectIsErrorPayload(node)) {
killedBy: manual-tagged-error valid const err = new PlannedHarnessIngressError({ cause: ParseFailure({ path, message }) });
statusReason: Should have no errors but had 2: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface tagged value — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 44,
    nodeType: 'ObjectExpression',

[Killed] BlockStatement
src/rules/manual-tagged-error.ts:206:41
       ObjectExpression(node) {
         if (!objectHasManualTag(node)) return;
         const tagName = getObjectTagName(node);
-        if (objectIsErrorPayload(node)) {
-          report(node, tagName ?? "tagged value");
-          return;
-        }
+        if (objectIsErrorPayload(node)) {}
         if (!looksErrorLike(tagName)) return;
         if (!objectIsReturnedValue(node)) return;
killedBy: manual-tagged-error invalid const parse = () => new PlannedHarnessIngressError({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:206:13
       ObjectExpression(node) {
         if (!objectHasManualTag(node)) return;
         const tagName = getObjectTagName(node);
-        if (objectIsErrorPayload(node)) {
+        if (false) {
           report(node, tagName ?? "tagged value");
           return;
killedBy: manual-tagged-error invalid const parse = () => new PlannedHarnessIngressError({ cause: { _tag: "ParseFailure", path, message } });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:210:13
           report(node, tagName ?? "tagged value");
           return;
         }
-        if (!looksErrorLike(tagName)) return;
+        if (true) return;
         if (!objectIsReturnedValue(node)) return;
         report(node, tagName ?? "tagged value");
killedBy: manual-tagged-error invalid function parse() { return { _tag: "ParseFailure", path, message }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:210:13
           report(node, tagName ?? "tagged value");
           return;
         }
-        if (!looksErrorLike(tagName)) return;
+        if (false) return;
         if (!objectIsReturnedValue(node)) return;
         report(node, tagName ?? "tagged value");
killedBy: manual-tagged-error valid const make = () => ({ _tag: "Player", id });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface Player — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 21,
    nodeType: 'ObjectExpression',

[Killed] ConditionalExpression
src/rules/manual-tagged-error.ts:211:13
           return;
         }
         if (!looksErrorLike(tagName)) return;
-        if (!objectIsReturnedValue(node)) return;
+        if (false) return;
         report(node, tagName ?? "tagged value");
       },
killedBy: manual-tagged-error valid function logFailure() { log({ _tag: "ParseFailure", path, message }); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface ParseFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 29,
    nodeType: 'ObjectExpression',

[Killed] BooleanLiteral
src/rules/manual-tagged-error.ts:211:13
           return;
         }
         if (!looksErrorLike(tagName)) return;
-        if (!objectIsReturnedValue(node)) return;
+        if (objectIsReturnedValue(node)) return;
         report(node, tagName ?? "tagged value");
       },
killedBy: manual-tagged-error valid function logFailure() { log({ _tag: "ParseFailure", path, message }); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-tagged-error',
    severity: 2,
    message: 'Manual tagged error surface ParseFailure — use Data.TaggedError(...) or a tagged constructor instead of hand-rolling `_tag`.',
    line: 1,
    column: 29,
    nodeType: 'ObjectExpression',
