[Killed] BooleanLiteral
src/rules/no-coverage-threshold-gate.ts:18:34
 function keyName(
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
 ): string | null {
-  return getStaticStringKey(key, false);
+  return getStaticStringKey(key, true);
 }
 
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] EqualityOperator
src/rules/no-coverage-threshold-gate.ts:23:23
 
 function parentCoverageKey(node: TSESTree.Property): boolean {
   const obj = getParent(node);
-  if (obj === null || obj.type !== "ObjectExpression") return false;
+  if (obj === null || obj.type === "ObjectExpression") return false;
   const prop = getParent(obj);
   if (prop === null || prop.type !== "Property" || prop.computed) return false;
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Survived] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:23:23
 
 function parentCoverageKey(node: TSESTree.Property): boolean {
   const obj = getParent(node);
-  if (obj === null || obj.type !== "ObjectExpression") return false;
+  if (obj === null || false) return false;
   const prop = getParent(obj);
   if (prop === null || prop.type !== "Property" || prop.computed) return false;

[NoCoverage] BooleanLiteral
src/rules/no-coverage-threshold-gate.ts:25:74
   const obj = getParent(node);
   if (obj === null || obj.type !== "ObjectExpression") return false;
   const prop = getParent(obj);
-  if (prop === null || prop.type !== "Property" || prop.computed) return false;
+  if (prop === null || prop.type !== "Property" || prop.computed) return true;
   return keyName(prop.key) === "coverage";
 }

[Killed] EqualityOperator
src/rules/no-coverage-threshold-gate.ts:26:10
   if (obj === null || obj.type !== "ObjectExpression") return false;
   const prop = getParent(obj);
   if (prop === null || prop.type !== "Property" || prop.computed) return false;
-  return keyName(prop.key) === "coverage";
+  return keyName(prop.key) !== "coverage";
 }
 
killedBy: no-coverage-threshold-gate valid export default { test: { metrics: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-coverage-threshold-gate',
    severity: 2,
    message: 'Coverage is a diagnostic, not a merge gate. Remove `thresholds` — threshold gates invite trivial tests that move the number without testing behavior. See docs/rules/no-coverage-threshold-gate.md.',
    line: 1,
    column: 37,
    nodeType: 'Property',

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:26:10
   if (obj === null || obj.type !== "ObjectExpression") return false;
   const prop = getParent(obj);
   if (prop === null || prop.type !== "Property" || prop.computed) return false;
-  return keyName(prop.key) === "coverage";
+  return false;
 }
 
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/rules/no-coverage-threshold-gate.ts:47:9
   },
   defaultOptions: [],
   create(context) {
-    if (!isConfigFile(context.filename)) return {};
+    if (isConfigFile(context.filename)) return {};
     return {
       Property(node) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-coverage-threshold-gate fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 520179173, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:47:9
   },
   defaultOptions: [],
   create(context) {
-    if (!isConfigFile(context.filename)) return {};
+    if (true) return {};
     return {
       Property(node) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-coverage-threshold-gate fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1173808190, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-coverage-threshold-gate.ts:49:22
   create(context) {
     if (!isConfigFile(context.filename)) return {};
     return {
-      Property(node) {
-        if (node.computed) return;
-        const name = getStaticStringKey(node.key, node.computed);
-        if (name === "coverageThreshold") {
-          context.report({ node, messageId: "coverageGate", data: { key: name } });
-          return;
-        }
-        if (name === "thresholds" || name === "threshold") {
-          if (parentCoverageKey(node)) {
-            context.report({ node, messageId: "coverageGate", data: { key: name } });
-          }
-        }
-      },
+      Property(node) {},
     };
   },
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:50:13
     if (!isConfigFile(context.filename)) return {};
     return {
       Property(node) {
-        if (node.computed) return;
+        if (true) return;
         const name = getStaticStringKey(node.key, node.computed);
         if (name === "coverageThreshold") {
killedBy: property: rule correctness Property 2: agent-code-guard/no-coverage-threshold-gate fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1553347391, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:50:13
     if (!isConfigFile(context.filename)) return {};
     return {
       Property(node) {
-        if (node.computed) return;
+        if (false) return;
         const name = getStaticStringKey(node.key, node.computed);
         if (name === "coverageThreshold") {
killedBy: no-coverage-threshold-gate valid export default { test: { coverage: { ['thresholds']: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-coverage-threshold-gate',
    severity: 2,
    message: 'Coverage is a diagnostic, not a merge gate. Remove `thresholds` — threshold gates invite trivial tests that move the number without testing behavior. See docs/rules/no-coverage-threshold-gate.md.',
    line: 1,
    column: 38,
    nodeType: 'Property',

[Killed] EqualityOperator
src/rules/no-coverage-threshold-gate.ts:52:13
       Property(node) {
         if (node.computed) return;
         const name = getStaticStringKey(node.key, node.computed);
-        if (name === "coverageThreshold") {
+        if (name !== "coverageThreshold") {
           context.report({ node, messageId: "coverageGate", data: { key: name } });
           return;
killedBy: no-coverage-threshold-gate valid export default { test: { coverage: { reporter: ['text'] } } };
statusReason: Should have no errors but had 3: [
  {
    ruleId: '@rule-tester/no-coverage-threshold-gate',
    severity: 2,
    message: 'Coverage is a diagnostic, not a merge gate. Remove `test` — threshold gates invite trivial tests that move the number without testing behavior. See docs/rules/no-coverage-threshold-gate.md.',
    line: 1,
    column: 18,
    nodeType: 'Property',

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:52:13
       Property(node) {
         if (node.computed) return;
         const name = getStaticStringKey(node.key, node.computed);
-        if (name === "coverageThreshold") {
+        if (false) {
           context.report({ node, messageId: "coverageGate", data: { key: name } });
           return;
killedBy: property: rule correctness Property 2: agent-code-guard/no-coverage-threshold-gate fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 586253170, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-coverage-threshold-gate.ts:56:38
           context.report({ node, messageId: "coverageGate", data: { key: name } });
           return;
         }
-        if (name === "thresholds" || name === "threshold") {
+        if (name === "thresholds" || name !== "threshold") {
           if (parentCoverageKey(node)) {
             context.report({ node, messageId: "coverageGate", data: { key: name } });
killedBy: no-coverage-threshold-gate valid export default { test: { coverage: { reporter: ['text'] } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-coverage-threshold-gate',
    severity: 2,
    message: 'Coverage is a diagnostic, not a merge gate. Remove `reporter` — threshold gates invite trivial tests that move the number without testing behavior. See docs/rules/no-coverage-threshold-gate.md.',
    line: 1,
    column: 38,
    nodeType: 'Property',

[Killed] BlockStatement
src/rules/no-coverage-threshold-gate.ts:56:60
           context.report({ node, messageId: "coverageGate", data: { key: name } });
           return;
         }
-        if (name === "thresholds" || name === "threshold") {
-          if (parentCoverageKey(node)) {
-            context.report({ node, messageId: "coverageGate", data: { key: name } });
-          }
-        }
+        if (name === "thresholds" || name === "threshold") {}
       },
     };
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-coverage-threshold-gate.ts:57:15
           return;
         }
         if (name === "thresholds" || name === "threshold") {
-          if (parentCoverageKey(node)) {
+          if (true) {
             context.report({ node, messageId: "coverageGate", data: { key: name } });
           }
killedBy: no-coverage-threshold-gate valid export default { test: { metrics: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-coverage-threshold-gate',
    severity: 2,
    message: 'Coverage is a diagnostic, not a merge gate. Remove `thresholds` — threshold gates invite trivial tests that move the number without testing behavior. See docs/rules/no-coverage-threshold-gate.md.',
    line: 1,
    column: 37,
    nodeType: 'Property',

[Killed] BlockStatement
src/rules/no-coverage-threshold-gate.ts:57:40
           return;
         }
         if (name === "thresholds" || name === "threshold") {
-          if (parentCoverageKey(node)) {
-            context.report({ node, messageId: "coverageGate", data: { key: name } });
-          }
+          if (parentCoverageKey(node)) {}
         }
       },
killedBy: no-coverage-threshold-gate valid // eslint-disable-next-line @rule-tester/no-coverage-threshold-gate -- suppression test
export default { test: { coverage: { thresholds: { lines: 80 } } } };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-coverage-threshold-gate').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,
