[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:59:9
   },
   defaultOptions: [{ allowShorterThan: 4 }],
   create(context, [options]) {
-    if (!isTestFile(context.filename)) return {};
+    if (true) return {};
 
     const minLen = options.allowShorterThan ?? 4;
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 726301901, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-hardcoded-assertion-literals.ts:59:9
   },
   defaultOptions: [{ allowShorterThan: 4 }],
   create(context, [options]) {
-    if (!isTestFile(context.filename)) return {};
+    if (isTestFile(context.filename)) return {};
 
     const minLen = options.allowShorterThan ?? 4;
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -848623234, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:65:25
 
     function flaggedRepr(arg: TSESTree.Node): string | null {
       const str = getStringLiteralValue(arg);
-      if (str !== null) {
-        return str.length >= minLen ? JSON.stringify(str) : null;
-      }
+      if (str !== null) {}
       const num = getNumericLiteralValue(arg);
       if (num !== null) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -300253706, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:66:16
     function flaggedRepr(arg: TSESTree.Node): string | null {
       const str = getStringLiteralValue(arg);
       if (str !== null) {
-        return str.length >= minLen ? JSON.stringify(str) : null;
+        return true ? JSON.stringify(str) : null;
       }
       const num = getNumericLiteralValue(arg);
killedBy: no-hardcoded-assertion-literals valid expect(x).toBe('ok');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "ok" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 16,
    nodeType: 'Literal',

[Killed] EqualityOperator
src/rules/no-hardcoded-assertion-literals.ts:66:16
     function flaggedRepr(arg: TSESTree.Node): string | null {
       const str = getStringLiteralValue(arg);
       if (str !== null) {
-        return str.length >= minLen ? JSON.stringify(str) : null;
+        return str.length < minLen ? JSON.stringify(str) : null;
       }
       const num = getNumericLiteralValue(arg);
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 367846507, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:69:25
         return str.length >= minLen ? JSON.stringify(str) : null;
       }
       const num = getNumericLiteralValue(arg);
-      if (num !== null) {
-        return BOUNDARY_NUMBERS.has(num) ? null : String(num);
-      }
+      if (num !== null) {}
       return null;
     }
killedBy: no-hardcoded-assertion-literals invalid expect(count).toBe(42);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:75:49
       return null;
     }
 
-    function checkArg(arg: TSESTree.Node): void {
-      const repr = flaggedRepr(arg);
-      if (repr !== null) {
-        context.report({ node: arg, messageId: "hardcodedLiteral", data: { literal: repr } });
-      }
-    }
+    function checkArg(arg: TSESTree.Node): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 167430518, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-hardcoded-assertion-literals.ts:77:11
 
     function checkArg(arg: TSESTree.Node): void {
       const repr = flaggedRepr(arg);
-      if (repr !== null) {
+      if (repr === null) {
         context.report({ node: arg, messageId: "hardcodedLiteral", data: { literal: repr } });
       }
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1301755316, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:77:11
 
     function checkArg(arg: TSESTree.Node): void {
       const repr = flaggedRepr(arg);
-      if (repr !== null) {
+      if (false) {
         context.report({ node: arg, messageId: "hardcodedLiteral", data: { literal: repr } });
       }
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe('processed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:86:11
       CallExpression(node) {
         const callee = node.callee;
         const propertyName =
-          callee.type === AST_NODE_TYPES.MemberExpression
+          false
             ? getStaticMemberPropertyName(callee)
             : null;
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1593059577, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-hardcoded-assertion-literals.ts:86:11
       CallExpression(node) {
         const callee = node.callee;
         const propertyName =
-          callee.type === AST_NODE_TYPES.MemberExpression
+          callee.type !== AST_NODE_TYPES.MemberExpression
             ? getStaticMemberPropertyName(callee)
             : null;
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe('processed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/no-hardcoded-assertion-literals.ts:91:11
             : null;
 
         if (
-          callee.type === AST_NODE_TYPES.MemberExpression &&
+          callee.type !== AST_NODE_TYPES.MemberExpression &&
           propertyName !== null &&
           FIRST_ARG_MATCHERS.has(propertyName)
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe('processed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:91:11
             : null;
 
         if (
-          callee.type === AST_NODE_TYPES.MemberExpression &&
-          propertyName !== null &&
-          FIRST_ARG_MATCHERS.has(propertyName)
+          false
         ) {
           const arg = node.arguments[0];
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe('processed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:94:11
           callee.type === AST_NODE_TYPES.MemberExpression &&
           propertyName !== null &&
           FIRST_ARG_MATCHERS.has(propertyName)
-        ) {
-          const arg = node.arguments[0];
-          if (arg) checkArg(arg);
-          return;
-        }
+        ) {}
 
         if (
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1642973320, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:96:15
           FIRST_ARG_MATCHERS.has(propertyName)
         ) {
           const arg = node.arguments[0];
-          if (arg) checkArg(arg);
+          if (false) checkArg(arg);
           return;
         }
killedBy: property: rule correctness Property 2: agent-code-guard/no-hardcoded-assertion-literals fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 334951276, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:96:15
           FIRST_ARG_MATCHERS.has(propertyName)
         ) {
           const arg = node.arguments[0];
-          if (arg) checkArg(arg);
+          if (true) checkArg(arg);
           return;
         }
killedBy: no-hardcoded-assertion-literals valid expect(result).toBe();
statusReason: Cannot read properties of undefined (reading 'type')
Occurred while linting /repo/src/auth.test.ts:1
Rule: "@rule-tester/no-hardcoded-assertion-literals"

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:101:11
         }
 
         if (
-          callee.type === AST_NODE_TYPES.MemberExpression &&
-          callee.object.type === AST_NODE_TYPES.Identifier &&
-          callee.object.name === "assert" &&
-          propertyName !== null &&
-          ASSERT_MEMBER_MATCHERS.has(propertyName)
+          false
         ) {
           const arg = node.arguments[1];
killedBy: no-hardcoded-assertion-literals invalid assert.equal(result, 'success');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:101:11
         }
 
         if (
-          callee.type === AST_NODE_TYPES.MemberExpression &&
-          callee.object.type === AST_NODE_TYPES.Identifier &&
-          callee.object.name === "assert" &&
+          true &&
           propertyName !== null &&
           ASSERT_MEMBER_MATCHERS.has(propertyName)
killedBy: no-hardcoded-assertion-literals valid helper.equal(result, 'processed');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "processed" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 22,
    nodeType: 'Literal',

[Killed] EqualityOperator
src/rules/no-hardcoded-assertion-literals.ts:103:11
         if (
           callee.type === AST_NODE_TYPES.MemberExpression &&
           callee.object.type === AST_NODE_TYPES.Identifier &&
-          callee.object.name === "assert" &&
+          callee.object.name !== "assert" &&
           propertyName !== null &&
           ASSERT_MEMBER_MATCHERS.has(propertyName)
killedBy: property: rule correctness Property 5: no-hardcoded-assertion-literals fires on hardcoded literals across supported assertion APIs
statusReason: Property failed after 1 tests
{ seed: -590585185, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","equal","\"aaaa\""]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:103:11
         if (
           callee.type === AST_NODE_TYPES.MemberExpression &&
           callee.object.type === AST_NODE_TYPES.Identifier &&
-          callee.object.name === "assert" &&
+          true &&
           propertyName !== null &&
           ASSERT_MEMBER_MATCHERS.has(propertyName)
killedBy: no-hardcoded-assertion-literals valid helper.equal(result, 'processed');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "processed" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 22,
    nodeType: 'Literal',

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:106:11
           callee.object.name === "assert" &&
           propertyName !== null &&
           ASSERT_MEMBER_MATCHERS.has(propertyName)
-        ) {
-          const arg = node.arguments[1];
-          if (arg) checkArg(arg);
-          return;
-        }
+        ) {}
 
         if (
killedBy: property: rule correctness Property 5: no-hardcoded-assertion-literals fires on hardcoded literals across supported assertion APIs
statusReason: Property failed after 1 tests
{ seed: 801141933, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","equal","\"aaaa\""]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:108:15
           ASSERT_MEMBER_MATCHERS.has(propertyName)
         ) {
           const arg = node.arguments[1];
-          if (arg) checkArg(arg);
+          if (true) checkArg(arg);
           return;
         }
killedBy: no-hardcoded-assertion-literals valid assert.equal(result);
statusReason: Cannot read properties of undefined (reading 'type')
Occurred while linting /repo/src/auth.test.ts:1
Rule: "@rule-tester/no-hardcoded-assertion-literals"

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:108:15
           ASSERT_MEMBER_MATCHERS.has(propertyName)
         ) {
           const arg = node.arguments[1];
-          if (arg) checkArg(arg);
+          if (false) checkArg(arg);
           return;
         }
killedBy: property: rule correctness Property 5: no-hardcoded-assertion-literals fires on hardcoded literals across supported assertion APIs
statusReason: Property failed after 1 tests
{ seed: -288162296, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","equal","\"aaaa\""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:113:11
         }
 
         if (
-          callee.type === AST_NODE_TYPES.Identifier &&
-          TOP_LEVEL_ASSERT_FNS.has(callee.name)
+          false
         ) {
           const arg = node.arguments[1];
killedBy: no-hardcoded-assertion-literals invalid assertEquals(result, 'completed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-hardcoded-assertion-literals.ts:113:11
         }
 
         if (
-          callee.type === AST_NODE_TYPES.Identifier &&
-          TOP_LEVEL_ASSERT_FNS.has(callee.name)
+          true
         ) {
           const arg = node.arguments[1];
killedBy: no-hardcoded-assertion-literals valid helper.equal(result, 'processed');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "processed" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 22,
    nodeType: 'Literal',

[Killed] BlockStatement
src/rules/no-hardcoded-assertion-literals.ts:115:11
         if (
           callee.type === AST_NODE_TYPES.Identifier &&
           TOP_LEVEL_ASSERT_FNS.has(callee.name)
-        ) {
-          const arg = node.arguments[1];
-          if (arg) checkArg(arg);
-        }
+        ) {}
       },
     };
killedBy: no-hardcoded-assertion-literals invalid assertEquals(result, 'completed');
statusReason: Should have 1 error but had 0: []

0 !== 1
