[Killed] ConditionalExpression
src/rules/no-manual-enum-cast.ts:7:5
 
 function isStringLiteralType(node: TSESTree.TypeNode): boolean {
   return (
-    node.type === AST_NODE_TYPES.TSLiteralType &&
-    node.literal.type === AST_NODE_TYPES.Literal &&
-    typeof node.literal.value === "string"
+    false
   );
 }
killedBy: no-manual-enum-cast valid // eslint-disable-next-line @rule-tester/no-manual-enum-cast -- suppression test
const s = x as 'a' | 'b';
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-manual-enum-cast').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-manual-enum-cast.ts:7:5
 
 function isStringLiteralType(node: TSESTree.TypeNode): boolean {
   return (
-    node.type === AST_NODE_TYPES.TSLiteralType &&
-    node.literal.type === AST_NODE_TYPES.Literal &&
-    typeof node.literal.value === "string"
+    true
   );
 }
killedBy: no-manual-enum-cast valid const n = x as number | string;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-manual-enum-cast',
    severity: 2,
    message: 'Manual string-union cast — import the generated enum type instead',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] ConditionalExpression
src/rules/no-manual-enum-cast.ts:9:5
   return (
     node.type === AST_NODE_TYPES.TSLiteralType &&
     node.literal.type === AST_NODE_TYPES.Literal &&
-    typeof node.literal.value === "string"
+    true
   );
 }
killedBy: no-manual-enum-cast valid const s = x as 1 | 2;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-manual-enum-cast',
    severity: 2,
    message: 'Manual string-union cast — import the generated enum type instead',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] EqualityOperator
src/rules/no-manual-enum-cast.ts:9:5
   return (
     node.type === AST_NODE_TYPES.TSLiteralType &&
     node.literal.type === AST_NODE_TYPES.Literal &&
-    typeof node.literal.value === "string"
+    typeof node.literal.value !== "string"
   );
 }
killedBy: no-manual-enum-cast valid const s = x as 1 | 2;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-manual-enum-cast',
    severity: 2,
    message: 'Manual string-union cast — import the generated enum type instead',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] ObjectLiteral
src/rules/no-manual-enum-cast.ts:31:12
   },
   defaultOptions: [],
   create(context) {
-    return {
-      TSAsExpression(node) {
-        const target = node.typeAnnotation;
-        if (target.type !== AST_NODE_TYPES.TSUnionType) return;
-        if (!target.types.every(isStringLiteralType)) return;
-        context.report({ node, messageId: "manualEnumCast" });
-      },
-    };
+    return {};
   },
 });
killedBy: property: rule correctness Property 2: agent-code-guard/no-manual-enum-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -682894361, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-manual-enum-cast.ts:32:28
   defaultOptions: [],
   create(context) {
     return {
-      TSAsExpression(node) {
-        const target = node.typeAnnotation;
-        if (target.type !== AST_NODE_TYPES.TSUnionType) return;
-        if (!target.types.every(isStringLiteralType)) return;
-        context.report({ node, messageId: "manualEnumCast" });
-      },
+      TSAsExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/no-manual-enum-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1691228098, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-manual-enum-cast.ts:35:13
       TSAsExpression(node) {
         const target = node.typeAnnotation;
         if (target.type !== AST_NODE_TYPES.TSUnionType) return;
-        if (!target.types.every(isStringLiteralType)) return;
+        if (true) return;
         context.report({ node, messageId: "manualEnumCast" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/no-manual-enum-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -170810178, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-manual-enum-cast.ts:35:13
       TSAsExpression(node) {
         const target = node.typeAnnotation;
         if (target.type !== AST_NODE_TYPES.TSUnionType) return;
-        if (!target.types.every(isStringLiteralType)) return;
+        if (false) return;
         context.report({ node, messageId: "manualEnumCast" });
       },
killedBy: no-manual-enum-cast valid const n = x as number | string;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-manual-enum-cast',
    severity: 2,
    message: 'Manual string-union cast — import the generated enum type instead',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',
