[Killed] BlockStatement
src/rules/no-process-env-at-runtime.ts:45:5
     let scope = sourceCode.getScope(identifier) as ScopeLike | null;
     scope !== null;
     scope = scope.upper
-  ) {
-    const variable = scope.set.get(identifier.name);
-    if (variable) return variable;
-  }
+  ) {}
   return null;
 }
killedBy: property: rule correctness Property 6: no-process-env-at-runtime ignores shadowed process bindings
statusReason: Property failed after 1 tests
{ seed: -2057717400, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a","\"\""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:54:9
 
 function variableTargetsProcessModule(variable: VariableLike): boolean {
   return variable.defs.some((def) => {
-    if (def.type === "ImportBinding") {
+    if (false) {
       const source = getLiteralStringValue(def.parent?.source ?? null);
       return source === "node:process" || source === "process";
killedBy: no-process-env-at-runtime invalid import process from 'node:process';
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-process-env-at-runtime.ts:54:39
 
 function variableTargetsProcessModule(variable: VariableLike): boolean {
   return variable.defs.some((def) => {
-    if (def.type === "ImportBinding") {
-      const source = getLiteralStringValue(def.parent?.source ?? null);
-      return source === "node:process" || source === "process";
-    }
+    if (def.type === "ImportBinding") {}
 
     if (def.type !== "Variable") {
killedBy: no-process-env-at-runtime invalid import process from 'node:process';
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:56:14
   return variable.defs.some((def) => {
     if (def.type === "ImportBinding") {
       const source = getLiteralStringValue(def.parent?.source ?? null);
-      return source === "node:process" || source === "process";
+      return false;
     }
 
killedBy: no-process-env-at-runtime invalid import process from 'node:process';
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:56:14
   return variable.defs.some((def) => {
     if (def.type === "ImportBinding") {
       const source = getLiteralStringValue(def.parent?.source ?? null);
-      return source === "node:process" || source === "process";
+      return false || source === "process";
     }
 
killedBy: no-process-env-at-runtime invalid import process from 'node:process';
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:59:9
       return source === "node:process" || source === "process";
     }
 
-    if (def.type !== "Variable") {
+    if (def.type === "Variable") {
       return false;
     }
killedBy: no-process-env-at-runtime invalid const process = require('node:process');
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:59:9
       return source === "node:process" || source === "process";
     }
 
-    if (def.type !== "Variable") {
+    if (false) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/rules/no-process-env-at-runtime.ts:60:14
     }
 
     if (def.type !== "Variable") {
-      return false;
+      return true;
     }
 

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:67:7
     if (
       init?.type !== AST_NODE_TYPES.CallExpression ||
       init.callee.type !== AST_NODE_TYPES.Identifier ||
-      init.callee.name !== "require"
+      init.callee.name === "require"
     ) {
       return false;
killedBy: no-process-env-at-runtime invalid const process = require('node:process');
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Survived] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:67:7
     if (
       init?.type !== AST_NODE_TYPES.CallExpression ||
       init.callee.type !== AST_NODE_TYPES.Identifier ||
-      init.callee.name !== "require"
+      false
     ) {
       return false;

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:73:34
     }
 
     const firstArgument = init.arguments[0];
-    if (firstArgument == null || firstArgument.type === AST_NODE_TYPES.SpreadElement) {
+    if (firstArgument == null || firstArgument.type !== AST_NODE_TYPES.SpreadElement) {
       return false;
     }
killedBy: no-process-env-at-runtime invalid const process = require('node:process');
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:73:9
     }
 
     const firstArgument = init.arguments[0];
-    if (firstArgument == null || firstArgument.type === AST_NODE_TYPES.SpreadElement) {
+    if (true) {
       return false;
     }
killedBy: no-process-env-at-runtime invalid const process = require('node:process');
const port = process.env.PORT;
statusReason: Should have 1 error but had 0: []

0 !== 1

[NoCoverage] BooleanLiteral
src/rules/no-process-env-at-runtime.ts:74:14
 
     const firstArgument = init.arguments[0];
     if (firstArgument == null || firstArgument.type === AST_NODE_TYPES.SpreadElement) {
-      return false;
+      return true;
     }
     const source = getLiteralStringValue(firstArgument);

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:77:12
       return false;
     }
     const source = getLiteralStringValue(firstArgument);
-    return source === "node:process" || source === "process";
+    return true;
   });
 }
killedBy: no-process-env-at-runtime valid const process = require('./process-shim');
const port = process.env.PORT;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-process-env-at-runtime',
    severity: 2,
    message: 'Runtime `process.env` access — read config at the boundary with `Effect.Config` or inject a typed config object instead of touching `process.env` in application code.',
    line: 2,
    column: 14,
    nodeType: 'MemberExpression',

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:77:41
       return false;
     }
     const source = getLiteralStringValue(firstArgument);
-    return source === "node:process" || source === "process";
+    return source === "node:process" || source !== "process";
   });
 }
killedBy: no-process-env-at-runtime valid const process = require('./process-shim');
const port = process.env.PORT;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-process-env-at-runtime',
    severity: 2,
    message: 'Runtime `process.env` access — read config at the boundary with `Effect.Config` or inject a typed config object instead of touching `process.env` in application code.',
    line: 2,
    column: 14,
    nodeType: 'MemberExpression',

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:85:7
   sourceCode: ScopeLookup,
   identifier: TSESTree.Identifier,
 ): boolean {
-  if (identifier.name !== "process") return false;
+  if (identifier.name === "process") return false;
   const variable = resolveVariable(sourceCode, identifier);
   return (
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1326392319, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BooleanLiteral
src/rules/no-process-env-at-runtime.ts:85:45
   sourceCode: ScopeLookup,
   identifier: TSESTree.Identifier,
 ): boolean {
-  if (identifier.name !== "process") return false;
+  if (identifier.name !== "process") return true;
   const variable = resolveVariable(sourceCode, identifier);
   return (

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:88:5
   if (identifier.name !== "process") return false;
   const variable = resolveVariable(sourceCode, identifier);
   return (
-    variable === null ||
-    variable.defs.length === 0 ||
-    variableTargetsProcessModule(variable)
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -2112413244, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:88:5
   if (identifier.name !== "process") return false;
   const variable = resolveVariable(sourceCode, identifier);
   return (
-    variable === null ||
-    variable.defs.length === 0 ||
-    variableTargetsProcessModule(variable)
+    true
   );
 }
killedBy: property: rule correctness Property 6: no-process-env-at-runtime ignores shadowed process bindings
statusReason: Property failed after 1 tests
{ seed: 1667091045, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a","\"\""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:89:5
   const variable = resolveVariable(sourceCode, identifier);
   return (
     variable === null ||
-    variable.defs.length === 0 ||
+    variable.defs.length !== 0 ||
     variableTargetsProcessModule(variable)
   );
killedBy: property: rule correctness Property 6: no-process-env-at-runtime ignores shadowed process bindings
statusReason: Property failed after 1 tests
{ seed: 1736615706, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a","\"\""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:89:5
   const variable = resolveVariable(sourceCode, identifier);
   return (
     variable === null ||
-    variable.defs.length === 0 ||
+    false ||
     variableTargetsProcessModule(variable)
   );

[Killed] LogicalOperator
src/rules/no-process-env-at-runtime.ts:99:5
   node: TSESTree.MemberExpression,
 ): boolean {
   return (
-    node.object.type === AST_NODE_TYPES.Identifier &&
-    isProcessReference(sourceCode, node.object) &&
-    getStaticStringKey(node.property, node.computed) === "env"
+    node.object.type === AST_NODE_TYPES.Identifier && isProcessReference(sourceCode, node.object) || getStaticStringKey(node.property, node.computed) === "env"
   );
 }
killedBy: property: rule correctness Property 6: no-process-env-at-runtime ignores shadowed process bindings
statusReason: Property failed after 1 tests
{ seed: 1103371513, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a","\"\""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:99:5
   node: TSESTree.MemberExpression,
 ): boolean {
   return (
-    node.object.type === AST_NODE_TYPES.Identifier &&
-    isProcessReference(sourceCode, node.object) &&
-    getStaticStringKey(node.property, node.computed) === "env"
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 806732948, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-process-env-at-runtime.ts:101:5
   return (
     node.object.type === AST_NODE_TYPES.Identifier &&
     isProcessReference(sourceCode, node.object) &&
-    getStaticStringKey(node.property, node.computed) === "env"
+    getStaticStringKey(node.property, node.computed) !== "env"
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -140115921, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:101:5
   return (
     node.object.type === AST_NODE_TYPES.Identifier &&
     isProcessReference(sourceCode, node.object) &&
-    getStaticStringKey(node.property, node.computed) === "env"
+    true
   );
 }

[Killed] ObjectLiteral
src/rules/no-process-env-at-runtime.ts:125:12
   create(context) {
     const { sourceCode } = context;
 
-    return {
-      MemberExpression(node) {
-        if (!isProcessEnvAccess(sourceCode, node)) return;
-        context.report({ node, messageId: "noProcessEnvAtRuntime" });
-      },
-    };
+    return {};
   },
 });
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1028967384, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-process-env-at-runtime.ts:126:30
     const { sourceCode } = context;
 
     return {
-      MemberExpression(node) {
-        if (!isProcessEnvAccess(sourceCode, node)) return;
-        context.report({ node, messageId: "noProcessEnvAtRuntime" });
-      },
+      MemberExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -495183585, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-process-env-at-runtime.ts:127:13
 
     return {
       MemberExpression(node) {
-        if (!isProcessEnvAccess(sourceCode, node)) return;
+        if (true) return;
         context.report({ node, messageId: "noProcessEnvAtRuntime" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/no-process-env-at-runtime fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1727170800, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/no-process-env-at-runtime.ts:127:13
 
     return {
       MemberExpression(node) {
-        if (!isProcessEnvAccess(sourceCode, node)) return;
+        if (isProcessEnvAccess(sourceCode, node)) return;
         context.report({ node, messageId: "noProcessEnvAtRuntime" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1147512405, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
