[Killed] BlockStatement
src/rules/no-raw-sql.ts:7:77
 import { getFirst } from "../utils/ast-refinement.js";
 
 function firstArgLooksLikeSql(arg: TSESTree.CallExpressionArgument): boolean {
-  if (arg.type === AST_NODE_TYPES.Literal && typeof arg.value === "string") {
-    return /\b(SELECT|INSERT|UPDATE|DELETE|CREATE|ALTER|DROP|WITH)\b/i.test(
-      arg.value,
-    );
-  }
+  if (arg.type === AST_NODE_TYPES.Literal && typeof arg.value === "string") {}
   if (arg.type === AST_NODE_TYPES.TemplateLiteral) {
     const head = getFirst(arg.quasis);
killedBy: property: rule correctness Property 2: agent-code-guard/no-raw-sql fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -2121831810, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-raw-sql.ts:12:52
       arg.value,
     );
   }
-  if (arg.type === AST_NODE_TYPES.TemplateLiteral) {
-    const head = getFirst(arg.quasis);
-    if (head === null) return false;
-    return /\b(SELECT|INSERT|UPDATE|DELETE|CREATE|ALTER|DROP|WITH)\b/i.test(
-      head.value.raw,
-    );
-  }
+  if (arg.type === AST_NODE_TYPES.TemplateLiteral) {}
   if (
     arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
killedBy: no-raw-sql invalid const rows = await client.query(`UPDATE users SET name = ${name}`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[NoCoverage] BooleanLiteral
src/rules/no-raw-sql.ts:14:31
   }
   if (arg.type === AST_NODE_TYPES.TemplateLiteral) {
     const head = getFirst(arg.quasis);
-    if (head === null) return false;
+    if (head === null) return true;
     return /\b(SELECT|INSERT|UPDATE|DELETE|CREATE|ALTER|DROP|WITH)\b/i.test(
       head.value.raw,

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:20:5
     );
   }
   if (
-    arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
-    arg.tag.type === AST_NODE_TYPES.Identifier &&
-    (arg.tag.name === "sql" || arg.tag.name === "SQL")
+    false
   ) {
     return true;
killedBy: no-raw-sql invalid db.query(sql`SELECT * FROM users`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:20:5
     );
   }
   if (
-    arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
-    arg.tag.type === AST_NODE_TYPES.Identifier &&
-    (arg.tag.name === "sql" || arg.tag.name === "SQL")
+    true
   ) {
     return true;
killedBy: no-raw-sql valid db.query(myTag`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:22:6
   if (
     arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
     arg.tag.type === AST_NODE_TYPES.Identifier &&
-    (arg.tag.name === "sql" || arg.tag.name === "SQL")
+    (true)
   ) {
     return true;
killedBy: no-raw-sql valid db.query(myTag`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:22:32
   if (
     arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
     arg.tag.type === AST_NODE_TYPES.Identifier &&
-    (arg.tag.name === "sql" || arg.tag.name === "SQL")
+    (arg.tag.name === "sql" || false)
   ) {
     return true;
killedBy: no-raw-sql invalid db.query(SQL`INSERT INTO logs VALUES ($1)`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-raw-sql.ts:23:5
     arg.type === AST_NODE_TYPES.TaggedTemplateExpression &&
     arg.tag.type === AST_NODE_TYPES.Identifier &&
     (arg.tag.name === "sql" || arg.tag.name === "SQL")
-  ) {
-    return true;
-  }
+  ) {}
   return false;
 }
killedBy: no-raw-sql invalid db.query(sql`SELECT * FROM users`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-raw-sql.ts:48:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        const callee = node.callee;
-        if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
-        const prop = callee.property;
-        if (
-          prop.type !== AST_NODE_TYPES.Identifier ||
-          prop.name !== "query" ||
-          callee.computed
-        ) {
-          return;
-        }
-        const first = node.arguments[0];
-        if (!first) return;
-        if (!firstArgLooksLikeSql(first)) return;
-        context.report({ node, messageId: "rawSql" });
-      },
+      CallExpression(node) {},
     };
   },
killedBy: no-raw-sql valid // eslint-disable-next-line @rule-tester/no-raw-sql -- suppression test
db.query('SELECT * FROM users');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-sql').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:53:11
         if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
         const prop = callee.property;
         if (
-          prop.type !== AST_NODE_TYPES.Identifier ||
-          prop.name !== "query" ||
-          callee.computed
+          false
         ) {
           return;
killedBy: no-raw-sql valid db.exec(`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:53:11
         if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
         const prop = callee.property;
         if (
-          prop.type !== AST_NODE_TYPES.Identifier ||
-          prop.name !== "query" ||
+          false ||
           callee.computed
         ) {
killedBy: no-raw-sql valid db.exec(`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:54:11
         const prop = callee.property;
         if (
           prop.type !== AST_NODE_TYPES.Identifier ||
-          prop.name !== "query" ||
+          false ||
           callee.computed
         ) {
killedBy: no-raw-sql valid db.exec(`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] EqualityOperator
src/rules/no-raw-sql.ts:54:11
         const prop = callee.property;
         if (
           prop.type !== AST_NODE_TYPES.Identifier ||
-          prop.name !== "query" ||
+          prop.name === "query" ||
           callee.computed
         ) {
killedBy: no-raw-sql valid // eslint-disable-next-line @rule-tester/no-raw-sql -- suppression test
db.query('SELECT * FROM users');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-sql').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/no-raw-sql.ts:56:11
           prop.type !== AST_NODE_TYPES.Identifier ||
           prop.name !== "query" ||
           callee.computed
-        ) {
-          return;
-        }
+        ) {}
         const first = node.arguments[0];
         if (!first) return;
killedBy: no-raw-sql valid db.exec(`SELECT * FROM users`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:60:13
           return;
         }
         const first = node.arguments[0];
-        if (!first) return;
+        if (true) return;
         if (!firstArgLooksLikeSql(first)) return;
         context.report({ node, messageId: "rawSql" });
killedBy: no-raw-sql valid // eslint-disable-next-line @rule-tester/no-raw-sql -- suppression test
db.query('SELECT * FROM users');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-sql').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/rules/no-raw-sql.ts:60:13
           return;
         }
         const first = node.arguments[0];
-        if (!first) return;
+        if (first) return;
         if (!firstArgLooksLikeSql(first)) return;
         context.report({ node, messageId: "rawSql" });
killedBy: no-raw-sql valid // eslint-disable-next-line @rule-tester/no-raw-sql -- suppression test
db.query('SELECT * FROM users');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-sql').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:61:13
         }
         const first = node.arguments[0];
         if (!first) return;
-        if (!firstArgLooksLikeSql(first)) return;
+        if (false) return;
         context.report({ node, messageId: "rawSql" });
       },
killedBy: no-raw-sql valid router.query('id');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-sql',
    severity: 2,
    message: 'Raw SQL in .query() — use a query builder (e.g. Kysely) with typed results',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-raw-sql.ts:61:13
         }
         const first = node.arguments[0];
         if (!first) return;
-        if (!firstArgLooksLikeSql(first)) return;
+        if (true) return;
         context.report({ node, messageId: "rawSql" });
       },
killedBy: no-raw-sql valid // eslint-disable-next-line @rule-tester/no-raw-sql -- suppression test
db.query('SELECT * FROM users');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-sql').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,
