[Killed] ConditionalExpression
src/rules/no-raw-throw-new-error.ts:27:9
   },
   defaultOptions: [],
   create(context) {
-    if (isTestFile(context.filename)) return {};
+    if (true) return {};
     return {
       ThrowStatement(node) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-raw-throw-new-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1988791026, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-raw-throw-new-error.ts:27:9
   },
   defaultOptions: [],
   create(context) {
-    if (isTestFile(context.filename)) return {};
+    if (false) return {};
     return {
       ThrowStatement(node) {
killedBy: no-raw-throw-new-error valid throw new Error('fixture setup failed');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new Error` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 1,
    nodeType: 'ThrowStatement',

[Killed] BlockStatement
src/rules/no-raw-throw-new-error.ts:29:28
   create(context) {
     if (isTestFile(context.filename)) return {};
     return {
-      ThrowStatement(node) {
-        const arg = node.argument;
-        if (arg.type !== AST_NODE_TYPES.NewExpression) return;
-        if (arg.callee.type !== AST_NODE_TYPES.Identifier) return;
-        const ctor = arg.callee.name;
-        if (!ERROR_CTORS.has(ctor)) return;
-        const fnName = getEnclosingFunctionName(node);
-        if (fnName && fnName.startsWith("absurd")) return;
-        context.report({
-          node,
-          messageId: "rawThrow",
-          data: { ctor },
-        });
-      },
+      ThrowStatement(node) {},
     };
   },
killedBy: no-raw-throw-new-error valid // eslint-disable-next-line @rule-tester/no-raw-throw-new-error -- suppression test
throw new Error('boom');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-raw-throw-new-error').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-raw-throw-new-error.ts:34:13
         if (arg.type !== AST_NODE_TYPES.NewExpression) return;
         if (arg.callee.type !== AST_NODE_TYPES.Identifier) return;
         const ctor = arg.callee.name;
-        if (!ERROR_CTORS.has(ctor)) return;
+        if (false) return;
         const fnName = getEnclosingFunctionName(node);
         if (fnName && fnName.startsWith("absurd")) return;
killedBy: no-raw-throw-new-error valid throw new TokenExpired({ at: now });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new TokenExpired` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 1,
    nodeType: 'ThrowStatement',

[Killed] BooleanLiteral
src/rules/no-raw-throw-new-error.ts:34:13
         if (arg.type !== AST_NODE_TYPES.NewExpression) return;
         if (arg.callee.type !== AST_NODE_TYPES.Identifier) return;
         const ctor = arg.callee.name;
-        if (!ERROR_CTORS.has(ctor)) return;
+        if (ERROR_CTORS.has(ctor)) return;
         const fnName = getEnclosingFunctionName(node);
         if (fnName && fnName.startsWith("absurd")) return;
killedBy: no-raw-throw-new-error valid throw new TokenExpired({ at: now });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new TokenExpired` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 1,
    nodeType: 'ThrowStatement',

[Killed] ConditionalExpression
src/rules/no-raw-throw-new-error.ts:36:13
         const ctor = arg.callee.name;
         if (!ERROR_CTORS.has(ctor)) return;
         const fnName = getEnclosingFunctionName(node);
-        if (fnName && fnName.startsWith("absurd")) return;
+        if (true) return;
         context.report({
           node,
killedBy: property: rule correctness Property 2: agent-code-guard/no-raw-throw-new-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1701225536, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-raw-throw-new-error.ts:36:13
         const ctor = arg.callee.name;
         if (!ERROR_CTORS.has(ctor)) return;
         const fnName = getEnclosingFunctionName(node);
-        if (fnName && fnName.startsWith("absurd")) return;
+        if (false) return;
         context.report({
           node,
killedBy: no-raw-throw-new-error valid function absurd(x: never): never { throw new Error(`unreachable: ${x}`); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new Error` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 36,
    nodeType: 'ThrowStatement',
