[Killed] EqualityOperator
src/rules/no-test-skip-only.ts:23:7
 function extractModifier(node: TSESTree.Node): Modifier | null {
   if (node.type !== AST_NODE_TYPES.MemberExpression) return null;
   const prop = getStaticMemberPropertyName(node);
-  if (prop === null) return null;
+  if (prop !== null) return null;
   if (prop === "skip") {
     if (
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Survived] ConditionalExpression
src/rules/no-test-skip-only.ts:23:7
 function extractModifier(node: TSESTree.Node): Modifier | null {
   if (node.type !== AST_NODE_TYPES.MemberExpression) return null;
   const prop = getStaticMemberPropertyName(node);
-  if (prop === null) return null;
+  if (false) return null;
   if (prop === "skip") {
     if (

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:24:24
   if (node.type !== AST_NODE_TYPES.MemberExpression) return null;
   const prop = getStaticMemberPropertyName(node);
   if (prop === null) return null;
-  if (prop === "skip") {
-    if (
-      node.object.type === AST_NODE_TYPES.Identifier &&
-      TEST_FNS.has(node.object.name)
-    ) {
-      return "skip";
-    }
-    return null;
-  }
+  if (prop === "skip") {}
   if (prop === "only") {
     if (
killedBy: property: rule correctness Property 2: agent-code-guard/no-test-skip-only fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1175468859, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-test-skip-only.ts:24:7
   if (node.type !== AST_NODE_TYPES.MemberExpression) return null;
   const prop = getStaticMemberPropertyName(node);
   if (prop === null) return null;
-  if (prop === "skip") {
+  if (prop !== "skip") {
     if (
       node.object.type === AST_NODE_TYPES.Identifier &&
killedBy: property: rule correctness Property 2: agent-code-guard/no-test-skip-only fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1773648312, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:26:7
   if (prop === null) return null;
   if (prop === "skip") {
     if (
-      node.object.type === AST_NODE_TYPES.Identifier &&
-      TEST_FNS.has(node.object.name)
+      true
     ) {
       return "skip";
killedBy: no-test-skip-only valid suite.skip('wip', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.skip` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'MemberExpression',

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:26:7
   if (prop === null) return null;
   if (prop === "skip") {
     if (
-      node.object.type === AST_NODE_TYPES.Identifier &&
-      TEST_FNS.has(node.object.name)
+      false
     ) {
       return "skip";
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:28:7
     if (
       node.object.type === AST_NODE_TYPES.Identifier &&
       TEST_FNS.has(node.object.name)
-    ) {
-      return "skip";
-    }
+    ) {}
     return null;
   }
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:33:24
     }
     return null;
   }
-  if (prop === "only") {
-    if (
-      node.object.type === AST_NODE_TYPES.Identifier &&
-      TEST_FNS.has(node.object.name)
-    ) {
-      return "only";
-    }
-    return null;
-  }
+  if (prop === "only") {}
   // `it.skip.each([...])` / `describe.only.each([...])` — descend through `.each`
   if (prop === "each") {
killedBy: no-test-skip-only invalid it.only('focus', () => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/no-test-skip-only.ts:33:7
     }
     return null;
   }
-  if (prop === "only") {
+  if (prop !== "only") {
     if (
       node.object.type === AST_NODE_TYPES.Identifier &&
killedBy: no-test-skip-only valid it.each([1, 2])('ok %s', (n) => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.only` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'MemberExpression',

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:37:7
     if (
       node.object.type === AST_NODE_TYPES.Identifier &&
       TEST_FNS.has(node.object.name)
-    ) {
-      return "only";
-    }
+    ) {}
     return null;
   }
killedBy: no-test-skip-only invalid it.only('focus', () => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:43:24
     return null;
   }
   // `it.skip.each([...])` / `describe.only.each([...])` — descend through `.each`
-  if (prop === "each") {
-    return extractModifier(node.object);
-  }
+  if (prop === "each") {}
   return null;
 }
killedBy: no-test-skip-only invalid it.skip.each([1, 2])('wip %s', (n) => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/no-test-skip-only.ts:43:7
     return null;
   }
   // `it.skip.each([...])` / `describe.only.each([...])` — descend through `.each`
-  if (prop === "each") {
+  if (prop !== "each") {
     return extractModifier(node.object);
   }
killedBy: no-test-skip-only invalid it.skip.each([1, 2])('wip %s', (n) => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:79:9
   },
   defaultOptions: [{}],
   create(context, [options]) {
-    if (!isTestFile(context.filename)) return {};
+    if (false) return {};
     const allowed = new Set<Modifier>(options.allow ?? []);
 
killedBy: no-test-skip-only valid it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.skip` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'MemberExpression',

[Killed] LogicalOperator
src/rules/no-test-skip-only.ts:80:39
   defaultOptions: [{}],
   create(context, [options]) {
     if (!isTestFile(context.filename)) return {};
-    const allowed = new Set<Modifier>(options.allow ?? []);
+    const allowed = new Set<Modifier>(options.allow && []);
 
     function report(node: TSESTree.Node, mod: Modifier) {
killedBy: no-test-skip-only valid test.skip('wip', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.skip` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'MemberExpression',

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:82:57
     if (!isTestFile(context.filename)) return {};
     const allowed = new Set<Modifier>(options.allow ?? []);
 
-    function report(node: TSESTree.Node, mod: Modifier) {
-      if (allowed.has(mod)) return;
-      context.report({ node, messageId: "skipOrOnly", data: { modifier: mod } });
-    }
+    function report(node: TSESTree.Node, mod: Modifier) {}
 
     return {
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:83:11
     const allowed = new Set<Modifier>(options.allow ?? []);
 
     function report(node: TSESTree.Node, mod: Modifier) {
-      if (allowed.has(mod)) return;
+      if (false) return;
       context.report({ node, messageId: "skipOrOnly", data: { modifier: mod } });
     }
killedBy: no-test-skip-only valid test.skip('wip', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.skip` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'MemberExpression',

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:83:11
     const allowed = new Set<Modifier>(options.allow ?? []);
 
     function report(node: TSESTree.Node, mod: Modifier) {
-      if (allowed.has(mod)) return;
+      if (true) return;
       context.report({ node, messageId: "skipOrOnly", data: { modifier: mod } });
     }
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ObjectLiteral
src/rules/no-test-skip-only.ts:87:12
       context.report({ node, messageId: "skipOrOnly", data: { modifier: mod } });
     }
 
-    return {
-      CallExpression(node) {
-        const callee = node.callee;
-        if (callee.type === AST_NODE_TYPES.Identifier) {
-          const mod = ALIASES[callee.name];
-          if (mod) report(callee, mod);
-          return;
-        }
-        const mod = extractModifier(callee);
-        if (mod) report(callee, mod);
-      },
-      // `` it.skip.each`a|b\n1|2`('...', fn) `` — Vitest's tagged-template table form.
-      // The outer call's callee is a TaggedTemplateExpression; the MemberExpression
-      // visit in `CallExpression` would miss it, so hook the tagged template directly.
-      TaggedTemplateExpression(node) {
-        const mod = extractModifier(node.tag);
-        if (mod) report(node.tag, mod);
-      },
-    };
+    return {};
   },
 });
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:88:28
     }
 
     return {
-      CallExpression(node) {
-        const callee = node.callee;
-        if (callee.type === AST_NODE_TYPES.Identifier) {
-          const mod = ALIASES[callee.name];
-          if (mod) report(callee, mod);
-          return;
-        }
-        const mod = extractModifier(callee);
-        if (mod) report(callee, mod);
-      },
+      CallExpression(node) {},
       // `` it.skip.each`a|b\n1|2`('...', fn) `` — Vitest's tagged-template table form.
       // The outer call's callee is a TaggedTemplateExpression; the MemberExpression
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:90:56
     return {
       CallExpression(node) {
         const callee = node.callee;
-        if (callee.type === AST_NODE_TYPES.Identifier) {
-          const mod = ALIASES[callee.name];
-          if (mod) report(callee, mod);
-          return;
-        }
+        if (callee.type === AST_NODE_TYPES.Identifier) {}
         const mod = extractModifier(callee);
         if (mod) report(callee, mod);
killedBy: no-test-skip-only invalid xit('disabled', () => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:92:15
         const callee = node.callee;
         if (callee.type === AST_NODE_TYPES.Identifier) {
           const mod = ALIASES[callee.name];
-          if (mod) report(callee, mod);
+          if (false) report(callee, mod);
           return;
         }
killedBy: no-test-skip-only invalid xit('disabled', () => {});
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/no-test-skip-only.ts:92:15
         const callee = node.callee;
         if (callee.type === AST_NODE_TYPES.Identifier) {
           const mod = ALIASES[callee.name];
-          if (mod) report(callee, mod);
+          if (true) report(callee, mod);
           return;
         }
killedBy: no-test-skip-only valid it('passes', () => { expect(1).toBe(1); });
statusReason: Should have no errors but had 2: [
  {
    ruleId: '@rule-tester/no-test-skip-only',
    severity: 2,
    message: 'no `.undefined` in committed tests; commit a passing test or delete it.',
    line: 1,
    column: 1,
    nodeType: 'Identifier',

[Killed] BlockStatement
src/rules/no-test-skip-only.ts:101:38
       // `` it.skip.each`a|b\n1|2`('...', fn) `` — Vitest's tagged-template table form.
       // The outer call's callee is a TaggedTemplateExpression; the MemberExpression
       // visit in `CallExpression` would miss it, so hook the tagged template directly.
-      TaggedTemplateExpression(node) {
-        const mod = extractModifier(node.tag);
-        if (mod) report(node.tag, mod);
-      },
+      TaggedTemplateExpression(node) {},
     };
   },
killedBy: no-test-skip-only invalid it.skip.each`
  a | b
  1 | 2
`('wip $a', ({ a, b }) => {});
statusReason: Should have 1 error but had 0: []

0 !== 1
