[Killed] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:16:5
   node: TSESTree.CallExpression["arguments"][number],
 ): boolean {
   return (
-    node.type === AST_NODE_TYPES.ObjectExpression &&
-    node.properties.some((property) => {
-      if (
-        property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
-        property.method
-      ) {
-        return false;
-      }
-      const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
-    })
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1956836215, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:16:5
   node: TSESTree.CallExpression["arguments"][number],
 ): boolean {
   return (
-    node.type === AST_NODE_TYPES.ObjectExpression &&
-    node.properties.some((property) => {
-      if (
-        property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
-        property.method
-      ) {
-        return false;
-      }
-      const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
-    })
+    true
   );
 }
killedBy: property: rule correctness Property 7: no-unbounded-concurrency ignores bounded Effect fan-out
statusReason: Property failed after 1 tests
{ seed: -1527574401, path: "0:0:0", endOnFailure: true }
Counterexample: ["all",1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-unbounded-concurrency.ts:17:40
 ): boolean {
   return (
     node.type === AST_NODE_TYPES.ObjectExpression &&
-    node.properties.some((property) => {
-      if (
-        property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
-        property.method
-      ) {
-        return false;
-      }
-      const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
-    })
+    node.properties.some((property) => {})
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1812113413, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/rules/no-unbounded-concurrency.ts:17:5
 ): boolean {
   return (
     node.type === AST_NODE_TYPES.ObjectExpression &&
-    node.properties.some((property) => {
-      if (
-        property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
-        property.method
-      ) {
-        return false;
-      }
-      const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
-    })
+    node.properties.every(property => {
+  if (property.type !== AST_NODE_TYPES.Property || property.kind !== "init" || property.method) {
+    return false;
+  }
+  const key = getStaticStringKey(property.key, property.computed);
+  if (key !== "concurrency") return false;
+  return getStringLiteralValue(property.value) === "unbounded";
+})
   );
 }
killedBy: no-unbounded-concurrency invalid yield* Effect.all(tasks, { mode: 'either', concurrency: 'unbounded' });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/no-unbounded-concurrency.ts:20:9
     node.properties.some((property) => {
       if (
         property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
+        property.kind === "init" ||
         property.method
       ) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1783267223, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:20:9
     node.properties.some((property) => {
       if (
         property.type !== AST_NODE_TYPES.Property ||
-        property.kind !== "init" ||
+        false ||
         property.method
       ) {

[Killed] EqualityOperator
src/rules/no-unbounded-concurrency.ts:26:11
         return false;
       }
       const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
+      if (key === "concurrency") return false;
       return getStringLiteralValue(property.value) === "unbounded";
     })
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1760551235, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] BooleanLiteral
src/rules/no-unbounded-concurrency.ts:26:41
         return false;
       }
       const key = getStaticStringKey(property.key, property.computed);
-      if (key !== "concurrency") return false;
+      if (key !== "concurrency") return true;
       return getStringLiteralValue(property.value) === "unbounded";
     })

[Killed] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:27:14
       }
       const key = getStaticStringKey(property.key, property.computed);
       if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
+      return true;
     })
   );
killedBy: property: rule correctness Property 7: no-unbounded-concurrency ignores bounded Effect fan-out
statusReason: Property failed after 1 tests
{ seed: 630748246, path: "0:0:0", endOnFailure: true }
Counterexample: ["all",1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:27:14
       }
       const key = getStaticStringKey(property.key, property.computed);
       if (key !== "concurrency") return false;
-      return getStringLiteralValue(property.value) === "unbounded";
+      return false;
     })
   );
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -2081198747, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/rules/no-unbounded-concurrency.ts:50:12
   },
   defaultOptions: [],
   create(context) {
-    return {
-      CallExpression(node) {
-        const callee = getStaticMemberExpression(node.callee);
-        if (
-          callee === null ||
-          callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Effect" ||
-          !CONCURRENCY_METHODS.has(callee.property.name)
-        ) {
-          return;
-        }
-
-        if (!node.arguments.some(hasUnboundedConcurrencyOption)) {
-          return;
-        }
-
-        context.report({
-          node,
-          messageId: "noUnboundedConcurrency",
-          data: { method: callee.property.name },
-        });
-      },
-    };
+    return {};
   },
 });
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1063550624, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-unbounded-concurrency.ts:51:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        const callee = getStaticMemberExpression(node.callee);
-        if (
-          callee === null ||
-          callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Effect" ||
-          !CONCURRENCY_METHODS.has(callee.property.name)
-        ) {
-          return;
-        }
-
-        if (!node.arguments.some(hasUnboundedConcurrencyOption)) {
-          return;
-        }
-
-        context.report({
-          node,
-          messageId: "noUnboundedConcurrency",
-          data: { method: callee.property.name },
-        });
-      },
+      CallExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1498745457, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/no-unbounded-concurrency.ts:56:11
         if (
           callee === null ||
           callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Effect" ||
+          callee.object.name === "Effect" ||
           !CONCURRENCY_METHODS.has(callee.property.name)
         ) {
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -152595209, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/no-unbounded-concurrency.ts:56:11
         if (
           callee === null ||
           callee.object.type !== AST_NODE_TYPES.Identifier ||
-          callee.object.name !== "Effect" ||
+          false ||
           !CONCURRENCY_METHODS.has(callee.property.name)
         ) {
killedBy: no-unbounded-concurrency valid yield* Task.all(tasks, { concurrency: 'unbounded' });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-unbounded-concurrency',
    severity: 2,
    message: 'Unbounded concurrency on `Effect.all(...)` — use a concrete concurrency bound unless the fan-out is explicitly proven safe.',
    line: 1,
    column: 8,
    nodeType: 'CallExpression',

[Killed] BooleanLiteral
src/rules/no-unbounded-concurrency.ts:57:11
           callee === null ||
           callee.object.type !== AST_NODE_TYPES.Identifier ||
           callee.object.name !== "Effect" ||
-          !CONCURRENCY_METHODS.has(callee.property.name)
+          CONCURRENCY_METHODS.has(callee.property.name)
         ) {
           return;
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -151899979, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/no-unbounded-concurrency.ts:62:66
           return;
         }
 
-        if (!node.arguments.some(hasUnboundedConcurrencyOption)) {
-          return;
-        }
+        if (!node.arguments.some(hasUnboundedConcurrencyOption)) {}
 
         context.report({
killedBy: property: rule correctness Property 7: no-unbounded-concurrency ignores bounded Effect fan-out
statusReason: Property failed after 1 tests
{ seed: 1319989791, path: "0:0:0", endOnFailure: true }
Counterexample: ["all",1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/rules/no-unbounded-concurrency.ts:62:14
           return;
         }
 
-        if (!node.arguments.some(hasUnboundedConcurrencyOption)) {
+        if (!node.arguments.every(hasUnboundedConcurrencyOption)) {
           return;
         }
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -601773091, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/rules/no-unbounded-concurrency.ts:69:17
         context.report({
           node,
           messageId: "noUnboundedConcurrency",
-          data: { method: callee.property.name },
+          data: {},
         });
       },
killedBy: no-unbounded-concurrency invalid yield* Effect.all(tasks, { concurrency: 'unbounded' });
statusReason: Hydrated message "Unbounded concurrency on `Effect.all(...)` — use a concrete concurrency bound unless the fan-out is explicitly proven safe." does not match "Unbounded concurrency on `Effect.{{method}}(...)` — use a concrete concurrency bound unless the fan-out is explicitly proven safe."
+ actual - expected

+ 'Unbounded concurrency on `Effect.{{method}}(...)` — use a concrete concurrency bound
