[Killed] BlockStatement
src/rules/no-vitest-mocks.ts:25:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        const callee = getStaticMemberExpression(node.callee);
-        if (callee === null) return;
-        if (
-          callee.object.type !== "Identifier" ||
-          callee.object.name !== "vi"
-        ) {
-          return;
-        }
-        const method = callee.property.name;
-        if (!MOCK_METHODS.has(method)) return;
-        context.report({
-          node,
-          messageId: "vitestMock",
-          data: { method },
-        });
-      },
+      CallExpression(node) {},
     };
   },
killedBy: no-vitest-mocks valid // eslint-disable-next-line @rule-tester/no-vitest-mocks -- suppression test
vi.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-vitest-mocks').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-vitest-mocks.ts:29:11
         const callee = getStaticMemberExpression(node.callee);
         if (callee === null) return;
         if (
-          callee.object.type !== "Identifier" ||
-          callee.object.name !== "vi"
+          false
         ) {
           return;
killedBy: no-vitest-mocks valid helpers.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-vitest-mocks',
    severity: 2,
    message: 'vi.mock() disallowed here — test against real dependencies in this scope',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] EqualityOperator
src/rules/no-vitest-mocks.ts:30:11
         if (callee === null) return;
         if (
           callee.object.type !== "Identifier" ||
-          callee.object.name !== "vi"
+          callee.object.name === "vi"
         ) {
           return;
killedBy: no-vitest-mocks valid helpers.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-vitest-mocks',
    severity: 2,
    message: 'vi.mock() disallowed here — test against real dependencies in this scope',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-vitest-mocks.ts:30:11
         if (callee === null) return;
         if (
           callee.object.type !== "Identifier" ||
-          callee.object.name !== "vi"
+          false
         ) {
           return;
killedBy: no-vitest-mocks valid helpers.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-vitest-mocks',
    severity: 2,
    message: 'vi.mock() disallowed here — test against real dependencies in this scope',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] BlockStatement
src/rules/no-vitest-mocks.ts:31:11
         if (
           callee.object.type !== "Identifier" ||
           callee.object.name !== "vi"
-        ) {
-          return;
-        }
+        ) {}
         const method = callee.property.name;
         if (!MOCK_METHODS.has(method)) return;
killedBy: no-vitest-mocks valid helpers.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-vitest-mocks',
    severity: 2,
    message: 'vi.mock() disallowed here — test against real dependencies in this scope',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/rules/no-vitest-mocks.ts:35:13
           return;
         }
         const method = callee.property.name;
-        if (!MOCK_METHODS.has(method)) return;
+        if (true) return;
         context.report({
           node,
killedBy: no-vitest-mocks valid // eslint-disable-next-line @rule-tester/no-vitest-mocks -- suppression test
vi.mock('./x');
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-vitest-mocks').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/no-vitest-mocks.ts:35:13
           return;
         }
         const method = callee.property.name;
-        if (!MOCK_METHODS.has(method)) return;
+        if (false) return;
         context.report({
           node,
killedBy: no-vitest-mocks valid vi.fn();
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-vitest-mocks',
    severity: 2,
    message: 'vi.fn() disallowed here — test against real dependencies in this scope',
    line: 1,
    column: 1,
    nodeType: 'CallExpression',
