[Killed] ConditionalExpression
src/rules/promise-type.ts:8:5
 
 function isPromiseTypeReference(node: TSESTree.Node): boolean {
   return (
-    node.type === AST_NODE_TYPES.TSTypeReference &&
-    node.typeName.type === AST_NODE_TYPES.Identifier &&
-    node.typeName.name === "Promise"
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2025191241, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/promise-type.ts:8:5
 
 function isPromiseTypeReference(node: TSESTree.Node): boolean {
   return (
-    node.type === AST_NODE_TYPES.TSTypeReference &&
-    node.typeName.type === AST_NODE_TYPES.Identifier &&
-    node.typeName.name === "Promise"
+    true
   );
 }
killedBy: promise-type valid function f(): Map<string, number> { return new Map(); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/promise-type',
    severity: 2,
    message: 'Promise<> return type — prefer Effect',
    line: 1,
    column: 15,
    nodeType: 'TSTypeReference',

[Killed] EqualityOperator
src/rules/promise-type.ts:10:5
   return (
     node.type === AST_NODE_TYPES.TSTypeReference &&
     node.typeName.type === AST_NODE_TYPES.Identifier &&
-    node.typeName.name === "Promise"
+    node.typeName.name !== "Promise"
   );
 }
killedBy: promise-type valid function f(): Map<string, number> { return new Map(); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/promise-type',
    severity: 2,
    message: 'Promise<> return type — prefer Effect',
    line: 1,
    column: 15,
    nodeType: 'TSTypeReference',

[Killed] ConditionalExpression
src/rules/promise-type.ts:10:5
   return (
     node.type === AST_NODE_TYPES.TSTypeReference &&
     node.typeName.type === AST_NODE_TYPES.Identifier &&
-    node.typeName.name === "Promise"
+    true
   );
 }
killedBy: promise-type valid function f(): Map<string, number> { return new Map(); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/promise-type',
    severity: 2,
    message: 'Promise<> return type — prefer Effect',
    line: 1,
    column: 15,
    nodeType: 'TSTypeReference',

[Killed] BlockStatement
src/rules/promise-type.ts:32:29
   defaultOptions: [],
   create(context) {
     return {
-      TSTypeReference(node) {
-        if (!isPromiseTypeReference(node)) return;
-        if (!isFunctionReturnTypeReference(node)) return;
-        context.report({ node, messageId: "promiseReturn" });
-      },
+      TSTypeReference(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -80467780, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/promise-type.ts:33:13
   create(context) {
     return {
       TSTypeReference(node) {
-        if (!isPromiseTypeReference(node)) return;
+        if (false) return;
         if (!isFunctionReturnTypeReference(node)) return;
         context.report({ node, messageId: "promiseReturn" });
killedBy: promise-type valid function f(): Map<string, number> { return new Map(); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/promise-type',
    severity: 2,
    message: 'Promise<> return type — prefer Effect',
    line: 1,
    column: 15,
    nodeType: 'TSTypeReference',

[Killed] ConditionalExpression
src/rules/promise-type.ts:33:13
   create(context) {
     return {
       TSTypeReference(node) {
-        if (!isPromiseTypeReference(node)) return;
+        if (true) return;
         if (!isFunctionReturnTypeReference(node)) return;
         context.report({ node, messageId: "promiseReturn" });
killedBy: promise-type valid // eslint-disable-next-line @rule-tester/promise-type -- suppression test (real prefix in production is `agent-code-guard/promise-type`)
function suppressed(): Promise<number> { ret
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/promise-type').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/promise-type.ts:34:13
     return {
       TSTypeReference(node) {
         if (!isPromiseTypeReference(node)) return;
-        if (!isFunctionReturnTypeReference(node)) return;
+        if (true) return;
         context.report({ node, messageId: "promiseReturn" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1536742245, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/promise-type.ts:34:13
     return {
       TSTypeReference(node) {
         if (!isPromiseTypeReference(node)) return;
-        if (!isFunctionReturnTypeReference(node)) return;
+        if (false) return;
         context.report({ node, messageId: "promiseReturn" });
       },
killedBy: promise-type valid const m: Map<string, Promise<number>> = new Map();
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/promise-type',
    severity: 2,
    message: 'Promise<> return type — prefer Effect',
    line: 1,
    column: 22,
    nodeType: 'TSTypeReference',
