[Killed] ConditionalExpression
src/rules/record-cast.ts:6:10
 import { createRule } from "../utils/create-rule.js";
 
 function isStringKeyword(node: TSESTree.TypeNode): boolean {
-  return node.type === AST_NODE_TYPES.TSStringKeyword;
+  return true;
 }
 
killedBy: record-cast valid const r = {} as Record<number, unknown>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] EqualityOperator
src/rules/record-cast.ts:6:10
 import { createRule } from "../utils/create-rule.js";
 
 function isStringKeyword(node: TSESTree.TypeNode): boolean {
-  return node.type === AST_NODE_TYPES.TSStringKeyword;
+  return node.type !== AST_NODE_TYPES.TSStringKeyword;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1596458214, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/record-cast.ts:10:10
 }
 
 function isUnknownKeyword(node: TSESTree.TypeNode): boolean {
-  return node.type === AST_NODE_TYPES.TSUnknownKeyword;
+  return node.type !== AST_NODE_TYPES.TSUnknownKeyword;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2024489875, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/record-cast.ts:10:10
 }
 
 function isUnknownKeyword(node: TSESTree.TypeNode): boolean {
-  return node.type === AST_NODE_TYPES.TSUnknownKeyword;
+  return true;
 }
 
killedBy: record-cast valid const r = {} as Record<string, number>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] BlockStatement
src/rules/record-cast.ts:32:28
   defaultOptions: [],
   create(context) {
     return {
-      TSAsExpression(node) {
-        const target = node.typeAnnotation;
-        if (target.type !== AST_NODE_TYPES.TSTypeReference) return;
-        if (
-          target.typeName.type !== AST_NODE_TYPES.Identifier ||
-          target.typeName.name !== "Record"
-        ) {
-          return;
-        }
-        const params = target.typeArguments?.params;
-        if (!params || params.length !== 2) return;
-        if (!isStringKeyword(params[0]!)) return;
-        if (!isUnknownKeyword(params[1]!)) return;
-        context.report({ node, messageId: "recordCast" });
-      },
+      TSAsExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2127402954, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/record-cast.ts:36:11
         const target = node.typeAnnotation;
         if (target.type !== AST_NODE_TYPES.TSTypeReference) return;
         if (
-          target.typeName.type !== AST_NODE_TYPES.Identifier ||
-          target.typeName.name !== "Record"
+          false
         ) {
           return;
killedBy: record-cast valid const r = {} as Dictionary<string, unknown>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] ConditionalExpression
src/rules/record-cast.ts:37:11
         if (target.type !== AST_NODE_TYPES.TSTypeReference) return;
         if (
           target.typeName.type !== AST_NODE_TYPES.Identifier ||
-          target.typeName.name !== "Record"
+          false
         ) {
           return;
killedBy: record-cast valid const r = {} as Dictionary<string, unknown>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] EqualityOperator
src/rules/record-cast.ts:37:11
         if (target.type !== AST_NODE_TYPES.TSTypeReference) return;
         if (
           target.typeName.type !== AST_NODE_TYPES.Identifier ||
-          target.typeName.name !== "Record"
+          target.typeName.name === "Record"
         ) {
           return;
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1335379012, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/record-cast.ts:38:11
         if (
           target.typeName.type !== AST_NODE_TYPES.Identifier ||
           target.typeName.name !== "Record"
-        ) {
-          return;
-        }
+        ) {}
         const params = target.typeArguments?.params;
         if (!params || params.length !== 2) return;
killedBy: record-cast valid const r = {} as Dictionary<string, unknown>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] EqualityOperator
src/rules/record-cast.ts:42:24
           return;
         }
         const params = target.typeArguments?.params;
-        if (!params || params.length !== 2) return;
+        if (!params || params.length === 2) return;
         if (!isStringKeyword(params[0]!)) return;
         if (!isUnknownKeyword(params[1]!)) return;
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 947242209, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/record-cast.ts:42:24
           return;
         }
         const params = target.typeArguments?.params;
-        if (!params || params.length !== 2) return;
+        if (!params || false) return;
         if (!isStringKeyword(params[0]!)) return;
         if (!isUnknownKeyword(params[1]!)) return;
killedBy: record-cast valid const r = {} as Record<string>;
statusReason: Cannot read properties of undefined (reading 'type')
Occurred while linting file.ts:1
Rule: "@rule-tester/record-cast"

[Killed] BooleanLiteral
src/rules/record-cast.ts:43:13
         }
         const params = target.typeArguments?.params;
         if (!params || params.length !== 2) return;
-        if (!isStringKeyword(params[0]!)) return;
+        if (isStringKeyword(params[0]!)) return;
         if (!isUnknownKeyword(params[1]!)) return;
         context.report({ node, messageId: "recordCast" });
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 195539133, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/record-cast.ts:43:13
         }
         const params = target.typeArguments?.params;
         if (!params || params.length !== 2) return;
-        if (!isStringKeyword(params[0]!)) return;
+        if (false) return;
         if (!isUnknownKeyword(params[1]!)) return;
         context.report({ node, messageId: "recordCast" });
killedBy: record-cast valid const r = {} as Record<number, unknown>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',

[Killed] BooleanLiteral
src/rules/record-cast.ts:44:13
         const params = target.typeArguments?.params;
         if (!params || params.length !== 2) return;
         if (!isStringKeyword(params[0]!)) return;
-        if (!isUnknownKeyword(params[1]!)) return;
+        if (isUnknownKeyword(params[1]!)) return;
         context.report({ node, messageId: "recordCast" });
       },
killedBy: property: rule correctness Property 2: agent-code-guard/record-cast fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1764464130, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/record-cast.ts:44:13
         const params = target.typeArguments?.params;
         if (!params || params.length !== 2) return;
         if (!isStringKeyword(params[0]!)) return;
-        if (!isUnknownKeyword(params[1]!)) return;
+        if (false) return;
         context.report({ node, messageId: "recordCast" });
       },
killedBy: record-cast valid const r = {} as Record<string, number>;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/record-cast',
    severity: 2,
    message: 'Unsafe Record<string, unknown> cast — use typed results',
    line: 1,
    column: 11,
    nodeType: 'TSAsExpression',
