[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:14:10
 const EQUALITY_OPERATORS = new Set(["==", "===", "!=", "!=="]);
 
 function looksErrorLike(name: string | null): boolean {
-  return typeof name === "string" && ERROR_NAME_RE.test(name);
+  return false;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -483560904, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:14:10
 const EQUALITY_OPERATORS = new Set(["==", "===", "!=", "!=="]);
 
 function looksErrorLike(name: string | null): boolean {
-  return typeof name === "string" && ERROR_NAME_RE.test(name);
+  return true;
 }
 
killedBy: tag-discriminant valid if (opt._tag === "None") return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:19:5
 
 function getExpressionName(node: TSESTree.Expression): string | null {
   switch (node.type) {
-    case AST_NODE_TYPES.Identifier:
-      return node.name;
+    case AST_NODE_TYPES.Identifier:
     case AST_NODE_TYPES.MemberExpression:
       return getStaticMemberPropertyName(node);
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1735330475, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[NoCoverage] ConditionalExpression
src/rules/tag-discriminant.ts:23:5
       return node.name;
     case AST_NODE_TYPES.MemberExpression:
       return getStaticMemberPropertyName(node);
-    case AST_NODE_TYPES.ChainExpression:
-      return node.expression.type === AST_NODE_TYPES.MemberExpression
-        ? getExpressionName(node.expression)
-        : null;
+    case AST_NODE_TYPES.ChainExpression:
     default:
       return null;

[NoCoverage] EqualityOperator
src/rules/tag-discriminant.ts:24:14
     case AST_NODE_TYPES.MemberExpression:
       return getStaticMemberPropertyName(node);
     case AST_NODE_TYPES.ChainExpression:
-      return node.expression.type === AST_NODE_TYPES.MemberExpression
+      return node.expression.type !== AST_NODE_TYPES.MemberExpression
         ? getExpressionName(node.expression)
         : null;

[NoCoverage] ConditionalExpression
src/rules/tag-discriminant.ts:24:14
     case AST_NODE_TYPES.MemberExpression:
       return getStaticMemberPropertyName(node);
     case AST_NODE_TYPES.ChainExpression:
-      return node.expression.type === AST_NODE_TYPES.MemberExpression
+      return true
         ? getExpressionName(node.expression)
         : null;

[NoCoverage] BooleanLiteral
src/rules/tag-discriminant.ts:34:23
 
 function tagAccessLooksErrorLike(node: TSESTree.Node): boolean {
   const member = getTagAccess(node);
-  if (!member) return false;
+  if (!member) return true;
   return looksErrorLike(getExpressionName(member.object));
 }

[Killed] BlockStatement
src/rules/tag-discriminant.ts:60:48
   },
   defaultOptions: [],
   create(context) {
-    function report(node: TSESTree.Node): void {
-      context.report({ node, messageId: "tagDiscriminant" });
-    }
+    function report(node: TSESTree.Node): void {}
 
     return {
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -385861681, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/tag-discriminant.ts:65:30
     }
 
     return {
-      BinaryExpression(node) {
-        if (!EQUALITY_OPERATORS.has(node.operator)) return;
-        const leftTag = getTagAccess(node.left);
-        const rightTag = getTagAccess(node.right);
-        if (leftTag !== null && rightTag !== null) return;
-        const tagAccess = leftTag ?? rightTag;
-        if (tagAccess === null) return;
-        const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
-        if (literal === null) return;
-        if (!tagAccessLooksErrorLike(tagAccess)) return;
-        report(node);
-      },
+      BinaryExpression(node) {},
       SwitchStatement(node) {
         const discriminant = getTagAccess(node.discriminant);
killedBy: tag-discriminant valid // eslint-disable-next-line @rule-tester/tag-discriminant -- suppression test
if (err._tag === 'WebhookTimeoutError') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/tag-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:66:13
 
     return {
       BinaryExpression(node) {
-        if (!EQUALITY_OPERATORS.has(node.operator)) return;
+        if (false) return;
         const leftTag = getTagAccess(node.left);
         const rightTag = getTagAccess(node.right);
killedBy: tag-discriminant valid const decorated = err._tag + "WebhookTimeoutError";
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 19,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:69:13
         if (!EQUALITY_OPERATORS.has(node.operator)) return;
         const leftTag = getTagAccess(node.left);
         const rightTag = getTagAccess(node.right);
-        if (leftTag !== null && rightTag !== null) return;
+        if (true && rightTag !== null) return;
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
killedBy: tag-discriminant invalid if ("WebhookTimeoutError" === err._tag) return;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:69:33
         if (!EQUALITY_OPERATORS.has(node.operator)) return;
         const leftTag = getTagAccess(node.left);
         const rightTag = getTagAccess(node.right);
-        if (leftTag !== null && rightTag !== null) return;
+        if (leftTag !== null && true) return;
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
killedBy: tag-discriminant valid // eslint-disable-next-line @rule-tester/tag-discriminant -- suppression test
if (err._tag === 'WebhookTimeoutError') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/tag-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] LogicalOperator
src/rules/tag-discriminant.ts:70:27
         const leftTag = getTagAccess(node.left);
         const rightTag = getTagAccess(node.right);
         if (leftTag !== null && rightTag !== null) return;
-        const tagAccess = leftTag ?? rightTag;
+        const tagAccess = leftTag && rightTag;
         if (tagAccess === null) return;
         const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -17317341, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:72:42
         if (leftTag !== null && rightTag !== null) return;
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
-        const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
+        const literal = getStringLiteral(false ? node.right : node.left);
         if (literal === null) return;
         if (!tagAccessLooksErrorLike(tagAccess)) return;
killedBy: tag-discriminant valid // eslint-disable-next-line @rule-tester/tag-discriminant -- suppression test
if (err._tag === 'WebhookTimeoutError') return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/tag-discriminant').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:72:42
         if (leftTag !== null && rightTag !== null) return;
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
-        const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
+        const literal = getStringLiteral(true ? node.right : node.left);
         if (literal === null) return;
         if (!tagAccessLooksErrorLike(tagAccess)) return;
killedBy: tag-discriminant invalid if ("WebhookTimeoutError" === err._tag) return;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:73:13
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
         const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
-        if (literal === null) return;
+        if (false) return;
         if (!tagAccessLooksErrorLike(tagAccess)) return;
         report(node);
killedBy: tag-discriminant valid if (err._tag === expectedTag) return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] EqualityOperator
src/rules/tag-discriminant.ts:73:13
         const tagAccess = leftTag ?? rightTag;
         if (tagAccess === null) return;
         const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
-        if (literal === null) return;
+        if (literal !== null) return;
         if (!tagAccessLooksErrorLike(tagAccess)) return;
         report(node);
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 874401862, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/tag-discriminant.ts:74:13
         if (tagAccess === null) return;
         const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
         if (literal === null) return;
-        if (!tagAccessLooksErrorLike(tagAccess)) return;
+        if (tagAccessLooksErrorLike(tagAccess)) return;
         report(node);
       },
killedBy: tag-discriminant valid if (opt._tag === "None") return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:74:13
         if (tagAccess === null) return;
         const literal = getStringLiteral(leftTag !== null ? node.right : node.left);
         if (literal === null) return;
-        if (!tagAccessLooksErrorLike(tagAccess)) return;
+        if (false) return;
         report(node);
       },
killedBy: tag-discriminant valid if (opt._tag === "None") return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] BlockStatement
src/rules/tag-discriminant.ts:77:29
         if (!tagAccessLooksErrorLike(tagAccess)) return;
         report(node);
       },
-      SwitchStatement(node) {
-        const discriminant = getTagAccess(node.discriminant);
-        if (discriminant === null) return;
-        if (!tagAccessLooksErrorLike(discriminant)) return;
-        const hasStringCase = node.cases.some(
-          (caseNode) => getStringLiteral(caseNode.test) !== null,
-        );
-        if (!hasStringCase) return;
-        report(node);
-      },
+      SwitchStatement(node) {},
     };
   },
killedBy: tag-discriminant invalid switch (err._tag) { case "SkillAttestation": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/rules/tag-discriminant.ts:80:13
       SwitchStatement(node) {
         const discriminant = getTagAccess(node.discriminant);
         if (discriminant === null) return;
-        if (!tagAccessLooksErrorLike(discriminant)) return;
+        if (tagAccessLooksErrorLike(discriminant)) return;
         const hasStringCase = node.cases.some(
           (caseNode) => getStringLiteral(caseNode.test) !== null,
killedBy: tag-discriminant valid switch (result._tag) { case "Ready": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:80:13
       SwitchStatement(node) {
         const discriminant = getTagAccess(node.discriminant);
         if (discriminant === null) return;
-        if (!tagAccessLooksErrorLike(discriminant)) return;
+        if (false) return;
         const hasStringCase = node.cases.some(
           (caseNode) => getStringLiteral(caseNode.test) !== null,
killedBy: tag-discriminant valid switch (result._tag) { case "Ready": return; default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] MethodExpression
src/rules/tag-discriminant.ts:81:31
         const discriminant = getTagAccess(node.discriminant);
         if (discriminant === null) return;
         if (!tagAccessLooksErrorLike(discriminant)) return;
-        const hasStringCase = node.cases.some(
-          (caseNode) => getStringLiteral(caseNode.test) !== null,
-        );
+        const hasStringCase = node.cases.every(caseNode => getStringLiteral(caseNode.test) !== null);
         if (!hasStringCase) return;
         report(node);
killedBy: tag-discriminant invalid switch (err._tag) { case "SkillAttestation": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/rules/tag-discriminant.ts:82:25
         if (discriminant === null) return;
         if (!tagAccessLooksErrorLike(discriminant)) return;
         const hasStringCase = node.cases.some(
-          (caseNode) => getStringLiteral(caseNode.test) !== null,
+          (caseNode) => getStringLiteral(caseNode.test) === null,
         );
         if (!hasStringCase) return;
killedBy: tag-discriminant valid switch (err._tag) { default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:82:25
         if (discriminant === null) return;
         if (!tagAccessLooksErrorLike(discriminant)) return;
         const hasStringCase = node.cases.some(
-          (caseNode) => getStringLiteral(caseNode.test) !== null,
+          (caseNode) => false,
         );
         if (!hasStringCase) return;
killedBy: tag-discriminant invalid switch (err._tag) { case "SkillAttestation": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:84:13
         const hasStringCase = node.cases.some(
           (caseNode) => getStringLiteral(caseNode.test) !== null,
         );
-        if (!hasStringCase) return;
+        if (true) return;
         report(node);
       },
killedBy: tag-discriminant invalid switch (err._tag) { case "SkillAttestation": return; default: return; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/rules/tag-discriminant.ts:84:13
         const hasStringCase = node.cases.some(
           (caseNode) => getStringLiteral(caseNode.test) !== null,
         );
-        if (!hasStringCase) return;
+        if (false) return;
         report(node);
       },
killedBy: tag-discriminant valid switch (err._tag) { default: return; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 1,
    nodeType: 'SwitchStatement',
