[Killed] BlockStatement
src/rules/then-chain.ts:23:28
   defaultOptions: [],
   create(context) {
     return {
-      CallExpression(node) {
-        const callee = node.callee;
-        if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
-        const prop = callee.property;
-        if (
-          prop.type === AST_NODE_TYPES.Identifier &&
-          prop.name === "then" &&
-          !callee.computed
-        ) {
-          context.report({ node, messageId: "thenChain" });
-        }
-      },
+      CallExpression(node) {},
     };
   },
killedBy: property: rule correctness Property 2: agent-code-guard/then-chain fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1804147070, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/then-chain.ts:28:11
         if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
         const prop = callee.property;
         if (
-          prop.type === AST_NODE_TYPES.Identifier &&
-          prop.name === "then" &&
-          !callee.computed
+          true
         ) {
           context.report({ node, messageId: "thenChain" });
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1824109592, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/then-chain.ts:28:11
         if (callee.type !== AST_NODE_TYPES.MemberExpression) return;
         const prop = callee.property;
         if (
-          prop.type === AST_NODE_TYPES.Identifier &&
-          prop.name === "then" &&
+          true &&
           !callee.computed
         ) {
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -943100526, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rules/then-chain.ts:29:11
         const prop = callee.property;
         if (
           prop.type === AST_NODE_TYPES.Identifier &&
-          prop.name === "then" &&
+          true &&
           !callee.computed
         ) {
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -313356744, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/rules/then-chain.ts:29:11
         const prop = callee.property;
         if (
           prop.type === AST_NODE_TYPES.Identifier &&
-          prop.name === "then" &&
+          prop.name !== "then" &&
           !callee.computed
         ) {
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2020374649, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/rules/then-chain.ts:30:11
         if (
           prop.type === AST_NODE_TYPES.Identifier &&
           prop.name === "then" &&
-          !callee.computed
+          callee.computed
         ) {
           context.report({ node, messageId: "thenChain" });
killedBy: property: rule correctness Property 2: agent-code-guard/then-chain fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1269728639, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/rules/then-chain.ts:31:11
           prop.type === AST_NODE_TYPES.Identifier &&
           prop.name === "then" &&
           !callee.computed
-        ) {
-          context.report({ node, messageId: "thenChain" });
-        }
+        ) {}
       },
     };
killedBy: property: rule correctness Property 2: agent-code-guard/then-chain fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -99361688, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
