[Killed] LogicalOperator
src/utils/ast-refinement.ts:25:10
 
 export function getFirst<T>(values: readonly T[]): T | null {
   const [first] = values;
-  return first ?? null;
+  return first && null;
 }
 
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe(`processed`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/utils/ast-refinement.ts:36:7
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
   computed: boolean,
 ): StaticString | null {
-  if (!computed && key.type === AST_NODE_TYPES.Identifier) {
+  if (computed && key.type === AST_NODE_TYPES.Identifier) {
     return StaticString(key.name);
   }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-tagged-error fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1553202520, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/ast-refinement.ts:36:60
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
   computed: boolean,
 ): StaticString | null {
-  if (!computed && key.type === AST_NODE_TYPES.Identifier) {
-    return StaticString(key.name);
-  }
+  if (!computed && key.type === AST_NODE_TYPES.Identifier) {}
   if (key.type === AST_NODE_TYPES.Literal && typeof key.value === "string") {
     return StaticString(key.value);
killedBy: no-raw-throw-new-error valid class Exhaustive { absurd(x: never): never { throw new Error(String(x)); } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new Error` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 46,
    nodeType: 'ThrowStatement',

[Killed] BlockStatement
src/utils/ast-refinement.ts:39:77
   if (!computed && key.type === AST_NODE_TYPES.Identifier) {
     return StaticString(key.name);
   }
-  if (key.type === AST_NODE_TYPES.Literal && typeof key.value === "string") {
-    return StaticString(key.value);
-  }
+  if (key.type === AST_NODE_TYPES.Literal && typeof key.value === "string") {}
   if (
     computed &&
killedBy: no-coverage-threshold-gate invalid export default { test: { coverage: { 'thresholds': { lines: 80 } } } };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:45:5
   if (
     computed &&
     key.type === AST_NODE_TYPES.TemplateLiteral &&
-    key.expressions.length === 0
+    true
   ) {
     const head = getFirst(key.quasis);
killedBy: property: ast refinement Property 2: getStaticStringKey accepts static object keys and rejects dynamic ones
statusReason: Property failed after 1 tests
{ seed: 780561683, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a",""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/ast-refinement.ts:45:5
   if (
     computed &&
     key.type === AST_NODE_TYPES.TemplateLiteral &&
-    key.expressions.length === 0
+    key.expressions.length !== 0
   ) {
     const head = getFirst(key.quasis);
killedBy: property: ast refinement Property 2: getStaticStringKey accepts static object keys and rejects dynamic ones
statusReason: Property failed after 1 tests
{ seed: -1191380023, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a",""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/ast-refinement.ts:46:5
     computed &&
     key.type === AST_NODE_TYPES.TemplateLiteral &&
     key.expressions.length === 0
-  ) {
-    const head = getFirst(key.quasis);
-    if (head === null) return null;
-    return StaticString(head.value.cooked ?? head.value.raw);
-  }
+  ) {}
   return null;
 }
killedBy: manual-tagged-error invalid class RunError extends Error { readonly [`_tag`] = "RunError" as const; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/ast-refinement.ts:57:80
 export function getStringLiteralValue(
   node: TSESTree.Node | null,
 ): StaticString | null {
-  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "string") {
-    return StaticString(node.value);
-  }
+  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "string") {}
   if (
     node?.type === AST_NODE_TYPES.TemplateLiteral &&
killedBy: property: rule correctness Property 2: agent-code-guard/no-unbounded-concurrency fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -282610145, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/ast-refinement.ts:62:5
   }
   if (
     node?.type === AST_NODE_TYPES.TemplateLiteral &&
-    node.expressions.length === 0
+    node.expressions.length !== 0
   ) {
     const head = getFirst(node.quasis);
killedBy: no-hardcoded-assertion-literals valid expect(x).toBe(`prefix-${id}`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "prefix-" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 16,
    nodeType: 'TemplateLiteral',

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:62:5
   }
   if (
     node?.type === AST_NODE_TYPES.TemplateLiteral &&
-    node.expressions.length === 0
+    true
   ) {
     const head = getFirst(node.quasis);
killedBy: no-hardcoded-assertion-literals valid expect(x).toBe(`prefix-${id}`);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "prefix-" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 16,
    nodeType: 'TemplateLiteral',

[Killed] BlockStatement
src/utils/ast-refinement.ts:63:5
   if (
     node?.type === AST_NODE_TYPES.TemplateLiteral &&
     node.expressions.length === 0
-  ) {
-    const head = getFirst(node.quasis);
-    if (head === null) return null;
-    return StaticString(head.value.cooked ?? head.value.raw);
-  }
+  ) {}
   return null;
 }
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe(`processed`);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/ast-refinement.ts:72:79
 }
 
 export function getNumericLiteralValue(node: TSESTree.Node): number | null {
-  if (node.type === AST_NODE_TYPES.Literal && typeof node.value === "number") {
-    return node.value;
-  }
+  if (node.type === AST_NODE_TYPES.Literal && typeof node.value === "number") {}
   if (
     node.type === AST_NODE_TYPES.UnaryExpression &&
killedBy: no-hardcoded-assertion-literals invalid expect(count).toBe(42);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:77:5
   }
   if (
     node.type === AST_NODE_TYPES.UnaryExpression &&
-    node.operator === "-" &&
+    true &&
     node.argument.type === AST_NODE_TYPES.Literal &&
     typeof node.argument.value === "number"
killedBy: no-hardcoded-assertion-literals valid expect(result).toBe(+42);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If -42 is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 21,
    nodeType: 'UnaryExpression',

[Killed] EqualityOperator
src/utils/ast-refinement.ts:77:5
   }
   if (
     node.type === AST_NODE_TYPES.UnaryExpression &&
-    node.operator === "-" &&
+    node.operator !== "-" &&
     node.argument.type === AST_NODE_TYPES.Literal &&
     typeof node.argument.value === "number"
killedBy: no-hardcoded-assertion-literals valid expect(result).toBe(+42);
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If -42 is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 21,
    nodeType: 'UnaryExpression',

[Killed] BlockStatement
src/utils/ast-refinement.ts:80:5
     node.operator === "-" &&
     node.argument.type === AST_NODE_TYPES.Literal &&
     typeof node.argument.value === "number"
-  ) {
-    return -node.argument.value;
-  }
+  ) {}
   return null;
 }
killedBy: no-hardcoded-assertion-literals invalid expect(count).toBe(-42);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] UnaryOperator
src/utils/ast-refinement.ts:81:12
     node.argument.type === AST_NODE_TYPES.Literal &&
     typeof node.argument.value === "number"
   ) {
-    return -node.argument.value;
+    return +node.argument.value;
   }
   return null;
killedBy: no-hardcoded-assertion-literals invalid expect(count).toBe(-2);
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:94:7
   if (unwrapped.type !== AST_NODE_TYPES.MemberExpression || unwrapped.computed) {
     return null;
   }
-  if (unwrapped.property.type !== AST_NODE_TYPES.Identifier) return null;
+  if (true) return null;
   return unwrapped as StaticMemberExpression;
 }
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:94:7
   if (unwrapped.type !== AST_NODE_TYPES.MemberExpression || unwrapped.computed) {
     return null;
   }
-  if (unwrapped.property.type !== AST_NODE_TYPES.Identifier) return null;
+  if (false) return null;
   return unwrapped as StaticMemberExpression;
 }
killedBy: no-hardcoded-assertion-literals valid class T { #toBe(value: string) {} run(result: string) { this.#toBe('processed'); } }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-hardcoded-assertion-literals',
    severity: 2,
    message: 'Test asserts a hardcoded value. If "processed" is contractual, export it as a named constant or enum member and import. If not, assert a structural property instead.',
    line: 1,
    column: 68,
    nodeType: 'Literal',

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:107:26
 
 export function getTagAccess(node: TSESTree.Node): TagAccess | null {
   const member = getStaticMemberExpression(node);
-  if (member === null || member.property.name !== "_tag") return null;
+  if (member === null || false) return null;
   return member as TagAccess;
 }
killedBy: tag-discriminant valid if (err.name === "TimeoutError") return;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/tag-discriminant',
    severity: 2,
    message: 'Manual `_tag` discriminant on a tagged error — use Effect.catchTag(...) / catchTags(...).',
    line: 1,
    column: 5,
    nodeType: 'BinaryExpression',

[Killed] EqualityOperator
src/utils/ast-refinement.ts:107:26
 
 export function getTagAccess(node: TSESTree.Node): TagAccess | null {
   const member = getStaticMemberExpression(node);
-  if (member === null || member.property.name !== "_tag") return null;
+  if (member === null || member.property.name === "_tag") return null;
   return member as TagAccess;
 }
killedBy: property: rule correctness Property 2: agent-code-guard/tag-discriminant fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1928852788, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:118:5
 ): boolean {
   const callee = getStaticMemberExpression(node.callee);
   return (
-    callee !== null &&
-    callee.object.type === AST_NODE_TYPES.Identifier &&
-    callee.object.name === objectName &&
-    callee.property.name === propertyName
+    false
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1118859059, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:118:5
 ): boolean {
   const callee = getStaticMemberExpression(node.callee);
   return (
-    callee !== null &&
-    callee.object.type === AST_NODE_TYPES.Identifier &&
-    callee.object.name === objectName &&
-    callee.property.name === propertyName
+    true
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/promise-type fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1522266572, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/ast-refinement.ts:120:5
   return (
     callee !== null &&
     callee.object.type === AST_NODE_TYPES.Identifier &&
-    callee.object.name === objectName &&
+    callee.object.name !== objectName &&
     callee.property.name === propertyName
   );
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1999525368, path: "0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:120:5
   return (
     callee !== null &&
     callee.object.type === AST_NODE_TYPES.Identifier &&
-    callee.object.name === objectName &&
+    true &&
     callee.property.name === propertyName
   );
killedBy: effect-error-erasure valid const fail = () => OtherEffect.fail(new Error('boom'));
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/effect-error-erasure',
    severity: 2,
    message: 'Generic Error in the Effect error channel — use a tagged domain error instead of Error/TypeError/RangeError.',
    line: 1,
    column: 20,
    nodeType: 'CallExpression',

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:121:5
     callee !== null &&
     callee.object.type === AST_NODE_TYPES.Identifier &&
     callee.object.name === objectName &&
-    callee.property.name === propertyName
+    true
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/effect-error-erasure fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1687339715, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/ast-refinement.ts:121:5
     callee !== null &&
     callee.object.type === AST_NODE_TYPES.Identifier &&
     callee.object.name === objectName &&
-    callee.property.name === propertyName
+    callee.property.name !== propertyName
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/effect-promise fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 649409964, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Timeout] BlockStatement
src/utils/ast-refinement.ts:129:19
   node: TSESTree.Node,
 ): StaticString | null {
   let current = getParent(node);
-  while (current) {
-    switch (current.type) {
-      case AST_NODE_TYPES.FunctionDeclaration:
-        return current.id ? StaticString(current.id.name) : null;
-      case AST_NODE_TYPES.FunctionExpression:
-      case AST_NODE_TYPES.ArrowFunctionExpression: {
-        const parent = getParent(current);
-        if (parent === null) return null;
-        switch (parent.type) {
-          case AST_NODE_TYPES.VariableDeclarator:
-            return parent.id.type === AST_NODE_TYPES.Identifier
-              ? StaticString(parent.id.name)
-              : null;
-          case AST_NODE_TYPES.Property:
-          case AST_NODE_TYPES.MethodDefinition:
-            if (parent.computed) return null;
-            return getStaticStringKey(parent.key, parent.computed);
-          default:
-            return null;
-        }
-      }
-      default:
-        current = getParent(current);
-    }
-  }
+  while (current) {}
   return null;
 }

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:131:7
   let current = getParent(node);
   while (current) {
     switch (current.type) {
-      case AST_NODE_TYPES.FunctionDeclaration:
-        return current.id ? StaticString(current.id.name) : null;
+      case AST_NODE_TYPES.FunctionDeclaration:
       case AST_NODE_TYPES.FunctionExpression:
       case AST_NODE_TYPES.ArrowFunctionExpression: {
killedBy: no-raw-throw-new-error valid function absurd(x: never): never { throw new Error(`unreachable: ${x}`); }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new Error` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 36,
    nodeType: 'ThrowStatement',

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:134:7
       case AST_NODE_TYPES.FunctionDeclaration:
         return current.id ? StaticString(current.id.name) : null;
       case AST_NODE_TYPES.FunctionExpression:
-      case AST_NODE_TYPES.ArrowFunctionExpression: {
-        const parent = getParent(current);
-        if (parent === null) return null;
-        switch (parent.type) {
-          case AST_NODE_TYPES.VariableDeclarator:
-            return parent.id.type === AST_NODE_TYPES.Identifier
-              ? StaticString(parent.id.name)
-              : null;
-          case AST_NODE_TYPES.Property:
-          case AST_NODE_TYPES.MethodDefinition:
-            if (parent.computed) return null;
-            return getStaticStringKey(parent.key, parent.computed);
-          default:
-            return null;
-        }
-      }
+      case AST_NODE_TYPES.ArrowFunctionExpression:
       default:
         current = getParent(current);
killedBy: property: ast refinement Property 5: getEnclosingFunctionName recovers names from supported function containers
statusReason: Property failed after 1 tests
{ seed: 1792305783, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","a","a","a"]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/ast-refinement.ts:134:52
       case AST_NODE_TYPES.FunctionDeclaration:
         return current.id ? StaticString(current.id.name) : null;
       case AST_NODE_TYPES.FunctionExpression:
-      case AST_NODE_TYPES.ArrowFunctionExpression: {
-        const parent = getParent(current);
-        if (parent === null) return null;
-        switch (parent.type) {
-          case AST_NODE_TYPES.VariableDeclarator:
-            return parent.id.type === AST_NODE_TYPES.Identifier
-              ? StaticString(parent.id.name)
-              : null;
-          case AST_NODE_TYPES.Property:
-          case AST_NODE_TYPES.MethodDefinition:
-            if (parent.computed) return null;
-            return getStaticStringKey(parent.key, parent.computed);
-          default:
-            return null;
-        }
-      }
+      case AST_NODE_TYPES.ArrowFunctionExpression: {}
       default:
         current = getParent(current);
killedBy: no-raw-throw-new-error valid const absurdGuard = (x: never): never => { throw new Error(String(x)); };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/no-raw-throw-new-error',
    severity: 2,
    message: 'Return a tagged error or Effect.fail; raw `throw new Error` erases the error channel and forces callers to catch-all. See docs/rules/no-raw-throw-new-error.md.',
    line: 1,
    column: 44,
    nodeType: 'ThrowStatement',

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:143:11
               ? StaticString(parent.id.name)
               : null;
           case AST_NODE_TYPES.Property:
-          case AST_NODE_TYPES.MethodDefinition:
-            if (parent.computed) return null;
-            return getStaticStringKey(parent.key, parent.computed);
+          case AST_NODE_TYPES.MethodDefinition:
           default:
             return null;
killedBy: property: ast refinement Property 5: getEnclosingFunctionName recovers names from supported function containers
statusReason: Property failed after 1 tests
{ seed: -1267989236, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","a","a","a"]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:144:17
               : null;
           case AST_NODE_TYPES.Property:
           case AST_NODE_TYPES.MethodDefinition:
-            if (parent.computed) return null;
+            if (false) return null;
             return getStaticStringKey(parent.key, parent.computed);
           default:
killedBy: no-raw-throw-new-error invalid const helpers = { ['absurd']: (x: never): never => { throw new Error(String(x)); } };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:146:11
           case AST_NODE_TYPES.MethodDefinition:
             if (parent.computed) return null;
             return getStaticStringKey(parent.key, parent.computed);
-          default:
-            return null;
+          default:
         }
       }
killedBy: property: ast refinement getEnclosingFunctionName returns null for unsupported function containers
statusReason: expected [ null, null, 'outer' ] to deeply equal [ null, null, null ]

[Timeout] ConditionalExpression
src/utils/ast-refinement.ts:150:7
             return null;
         }
       }
-      default:
-        current = getParent(current);
+      default:
     }
   }

[Survived] ConditionalExpression
src/utils/ast-refinement.ts:161:30
   node: TSESTree.TSTypeReference,
 ): boolean {
   const annotation = getParent(node);
-  if (annotation === null || annotation.type !== AST_NODE_TYPES.TSTypeAnnotation) {
+  if (annotation === null || false) {
     return false;
   }

[Killed] BooleanLiteral
src/utils/ast-refinement.ts:162:12
 ): boolean {
   const annotation = getParent(node);
   if (annotation === null || annotation.type !== AST_NODE_TYPES.TSTypeAnnotation) {
-    return false;
+    return true;
   }
   const owner = getParent(annotation);
killedBy: property: ast refinement Property 6: Promise return-type detection only fires for function return positions
statusReason: Property failed after 1 tests
{ seed: 2125380007, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["a","a","a"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[NoCoverage] BooleanLiteral
src/utils/ast-refinement.ts:165:30
     return false;
   }
   const owner = getParent(annotation);
-  if (owner === null) return false;
+  if (owner === null) return true;
 
   switch (owner.type) {

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:174:5
     case AST_NODE_TYPES.TSFunctionType:
     case AST_NODE_TYPES.TSMethodSignature:
     case AST_NODE_TYPES.TSDeclareFunction:
-    case AST_NODE_TYPES.TSEmptyBodyFunctionExpression:
-      return owner.returnType === annotation;
+    case AST_NODE_TYPES.TSEmptyBodyFunctionExpression:
     default:
       return false;
killedBy: promise-type valid // eslint-disable-next-line @rule-tester/promise-type -- suppression test (real prefix in production is `agent-code-guard/promise-type`)
function suppressed(): Promise<number> { ret
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/promise-type').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] EqualityOperator
src/utils/ast-refinement.ts:175:14
     case AST_NODE_TYPES.TSMethodSignature:
     case AST_NODE_TYPES.TSDeclareFunction:
     case AST_NODE_TYPES.TSEmptyBodyFunctionExpression:
-      return owner.returnType === annotation;
+      return owner.returnType !== annotation;
     default:
       return false;
killedBy: promise-type valid // eslint-disable-next-line @rule-tester/promise-type -- suppression test (real prefix in production is `agent-code-guard/promise-type`)
function suppressed(): Promise<number> { ret
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/promise-type').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/utils/ast-refinement.ts:175:14
     case AST_NODE_TYPES.TSMethodSignature:
     case AST_NODE_TYPES.TSDeclareFunction:
     case AST_NODE_TYPES.TSEmptyBodyFunctionExpression:
-      return owner.returnType === annotation;
+      return false;
     default:
       return false;
killedBy: promise-type valid // eslint-disable-next-line @rule-tester/promise-type -- suppression test (real prefix in production is `agent-code-guard/promise-type`)
function suppressed(): Promise<number> { ret
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/promise-type').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,
