[Killed] MethodExpression
src/utils/is-test-file.ts:10:10
 ];
 
 export function isTestFile(filename: string): boolean {
-  return TEST_FILE_PATTERNS.some((p) => p.test(filename));
+  return TEST_FILE_PATTERNS.every(p => p.test(filename));
 }
 
killedBy: no-hardcoded-assertion-literals invalid expect(result).toBe('processed');
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrowFunction
src/utils/is-test-file.ts:10:34
 ];
 
 export function isTestFile(filename: string): boolean {
-  return TEST_FILE_PATTERNS.some((p) => p.test(filename));
+  return TEST_FILE_PATTERNS.some(() => undefined);
 }
 
killedBy: no-test-skip-only valid // eslint-disable-next-line @rule-tester/no-test-skip-only -- suppression test
it.skip('nope', () => {});
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/no-test-skip-only').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,
