[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:116:16
     keys: new Set<string>(),
     stringLiterals: new Set<string>(),
     booleanLiterals: new Set<"true" | "false">(),
-    hasTagKey: false,
+    hasTagKey: true,
   };
 }
killedBy: manual algebra detection requires a real tag key before treating a surface as a tagged-error collision
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:135:10
 }
 
 function normalize(value: string): string {
-  return value.trim().toLowerCase();
+  return value.trim().toUpperCase();
 }
 
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1021936097, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:135:10
 }
 
 function normalize(value: string): string {
-  return value.trim().toLowerCase();
+  return value.toLowerCase();
 }
 
killedBy: manual algebra detection normalizes padded string keys when detecting transport/data discriminants
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:143:39
   candidates: Iterable<string>,
 ): boolean {
   const normalized = new Set([...values].map(normalize));
-  for (const candidate of candidates) {
-    if (normalized.has(normalize(candidate))) return true;
-  }
+  for (const candidate of candidates) {}
   return false;
 }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 564836146, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:144:9
 ): boolean {
   const normalized = new Set([...values].map(normalize));
   for (const candidate of candidates) {
-    if (normalized.has(normalize(candidate))) return true;
+    if (true) return true;
   }
   return false;
killedBy: property: rule correctness Property 1: no recommended rule fires on safe TS sources
statusReason: Property failed after 2 tests
{ seed: -1897590472, path: "1:1:0:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: ["function a(a: number): number { return a + 0; }\nconst a: number = 0;"]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:144:54
 ): boolean {
   const normalized = new Set([...values].map(normalize));
   for (const candidate of candidates) {
-    if (normalized.has(normalize(candidate))) return true;
+    if (normalized.has(normalize(candidate))) return false;
   }
   return false;
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 346512938, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:154:10
   left: string,
   right: string,
 ): boolean {
-  return hasNormalized(surface.stringLiterals, [left]) &&
-    hasNormalized(surface.stringLiterals, [right]);
+  return hasNormalized(surface.stringLiterals, [left]) || hasNormalized(surface.stringLiterals, [right]);
 }
 
killedBy: manual algebra detection keeps reusable option helpers clean when only `None` evidence is present
statusReason: expected { kind: 'option', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:154:10
   left: string,
   right: string,
 ): boolean {
-  return hasNormalized(surface.stringLiterals, [left]) &&
-    hasNormalized(surface.stringLiterals, [right]);
+  return false;
 }
 
killedBy: manual-option valid // eslint-disable-next-line @rule-tester/manual-option -- suppression test
type Option<T> = { readonly _tag: 'Some'; readonly value: T } | { readonly _tag: 'None' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-option').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:163:10
   left: string,
   right: string,
 ): boolean {
-  return hasNormalized(surface.keys, [left]) &&
-    hasNormalized(surface.keys, [right]);
+  return hasNormalized(surface.keys, [left]) || hasNormalized(surface.keys, [right]);
 }
 
killedBy: manual algebra detection requires complete ok-based evidence on result-like surfaces
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:163:10
   left: string,
   right: string,
 ): boolean {
-  return hasNormalized(surface.keys, [left]) &&
-    hasNormalized(surface.keys, [right]);
+  return true;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 2041715540, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:171:9
   surface: ReturnType<typeof createSurface>,
   key: TSESTree.Expression | TSESTree.PrivateIdentifier,
   computed: boolean,
-): void {
-  const name = getStaticStringKey(key, computed);
-  if (name === null) return;
-  surface.keys.add(name);
-  if (name === "_tag") surface.hasTagKey = true;
-}
+): void {}
 
 function addLiteral(
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -799371109, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:175:7
   const name = getStaticStringKey(key, computed);
   if (name === null) return;
   surface.keys.add(name);
-  if (name === "_tag") surface.hasTagKey = true;
+  if (name !== "_tag") surface.hasTagKey = true;
 }
 
killedBy: manual-brand valid // eslint-disable-next-line @rule-tester/manual-brand -- suppression test
type UserId = string & { readonly __brand: 'UserId' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-brand').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:175:7
   const name = getStaticStringKey(key, computed);
   if (name === null) return;
   surface.keys.add(name);
-  if (name === "_tag") surface.hasTagKey = true;
+  if (true) surface.hasTagKey = true;
 }
 
killedBy: manual-brand valid // eslint-disable-next-line @rule-tester/manual-brand -- suppression test
type UserId = string & { readonly __brand: 'UserId' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-brand').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:181:9
 function addLiteral(
   surface: ReturnType<typeof createSurface>,
   node: TSESTree.Node | null,
-): void {
-  const literal = getStringLiteralValue(node);
-  if (literal !== null) {
-    surface.stringLiterals.add(literal);
-    return;
-  }
-  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "boolean") {
-    surface.booleanLiterals.add(node.value ? "true" : "false");
-  }
-}
+): void {}
 
 function addTypeLiterals(
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1844263523, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:183:25
   node: TSESTree.Node | null,
 ): void {
   const literal = getStringLiteralValue(node);
-  if (literal !== null) {
-    surface.stringLiterals.add(literal);
-    return;
-  }
+  if (literal !== null) {}
   if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "boolean") {
     surface.booleanLiterals.add(node.value ? "true" : "false");
killedBy: property: manual algebra family Property 8: manual-option still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1048002058, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:187:48
     surface.stringLiterals.add(literal);
     return;
   }
-  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "boolean") {
+  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value !== "boolean") {
     surface.booleanLiterals.add(node.value ? "true" : "false");
   }
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1963773700, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:187:81
     surface.stringLiterals.add(literal);
     return;
   }
-  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "boolean") {
-    surface.booleanLiterals.add(node.value ? "true" : "false");
-  }
+  if (node?.type === AST_NODE_TYPES.Literal && typeof node.value === "boolean") {}
 }
 
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1641725637, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:195:9
 function addTypeLiterals(
   surface: ReturnType<typeof createSurface>,
   node: TSESTree.TypeNode,
-): void {
-  if (node.type === AST_NODE_TYPES.TSLiteralType) {
-    addLiteral(surface, node.literal);
-    return;
-  }
-  if (node.type === AST_NODE_TYPES.TSUnionType) {
-    for (const type of node.types) addTypeLiterals(surface, type);
-  }
-}
+): void {}
 
 function addTypeElement(
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:196:51
   surface: ReturnType<typeof createSurface>,
   node: TSESTree.TypeNode,
 ): void {
-  if (node.type === AST_NODE_TYPES.TSLiteralType) {
-    addLiteral(surface, node.literal);
-    return;
-  }
+  if (node.type === AST_NODE_TYPES.TSLiteralType) {}
   if (node.type === AST_NODE_TYPES.TSUnionType) {
     for (const type of node.types) addTypeLiterals(surface, type);
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/utils/manual-algebra-detection.ts:200:49
     addLiteral(surface, node.literal);
     return;
   }
-  if (node.type === AST_NODE_TYPES.TSUnionType) {
-    for (const type of node.types) addTypeLiterals(surface, type);
-  }
+  if (node.type === AST_NODE_TYPES.TSUnionType) {}
 }
 

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:208:9
 function addTypeElement(
   surface: ReturnType<typeof createSurface>,
   member: TSESTree.TypeElement,
-): void {
-  if (member.type === AST_NODE_TYPES.TSPropertySignature) {
-    addKey(surface, member.key, member.computed);
-    if (member.typeAnnotation) {
-      addTypeLiterals(surface, member.typeAnnotation.typeAnnotation);
-    }
-    return;
-  }
-  if (member.type === AST_NODE_TYPES.TSMethodSignature) {
-    addKey(surface, member.key, member.computed);
-  }
-}
+): void {}
 
 function addTypeNode(
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:209:59
   surface: ReturnType<typeof createSurface>,
   member: TSESTree.TypeElement,
 ): void {
-  if (member.type === AST_NODE_TYPES.TSPropertySignature) {
-    addKey(surface, member.key, member.computed);
-    if (member.typeAnnotation) {
-      addTypeLiterals(surface, member.typeAnnotation.typeAnnotation);
-    }
-    return;
-  }
+  if (member.type === AST_NODE_TYPES.TSPropertySignature) {}
   if (member.type === AST_NODE_TYPES.TSMethodSignature) {
     addKey(surface, member.key, member.computed);
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:211:32
 ): void {
   if (member.type === AST_NODE_TYPES.TSPropertySignature) {
     addKey(surface, member.key, member.computed);
-    if (member.typeAnnotation) {
-      addTypeLiterals(surface, member.typeAnnotation.typeAnnotation);
-    }
+    if (member.typeAnnotation) {}
     return;
   }
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:216:57
     }
     return;
   }
-  if (member.type === AST_NODE_TYPES.TSMethodSignature) {
-    addKey(surface, member.key, member.computed);
-  }
+  if (member.type === AST_NODE_TYPES.TSMethodSignature) {}
 }
 
killedBy: manual algebra detection uses method signatures as reusable signals when properties are absent
statusReason: expected undefined to be 'helpers' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:224:9
 function addTypeNode(
   surface: ReturnType<typeof createSurface>,
   node: TSESTree.TypeNode,
-): void {
-  if (node.type === AST_NODE_TYPES.TSTypeLiteral) {
-    for (const member of node.members) addTypeElement(surface, member);
-    return;
-  }
-  if (
-    node.type === AST_NODE_TYPES.TSUnionType ||
-    node.type === AST_NODE_TYPES.TSIntersectionType
-  ) {
-    for (const type of node.types) addTypeNode(surface, type);
-  }
-}
+): void {}
 
 function addClassMember(
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:225:51
   surface: ReturnType<typeof createSurface>,
   node: TSESTree.TypeNode,
 ): void {
-  if (node.type === AST_NODE_TYPES.TSTypeLiteral) {
-    for (const member of node.members) addTypeElement(surface, member);
-    return;
-  }
+  if (node.type === AST_NODE_TYPES.TSTypeLiteral) {}
   if (
     node.type === AST_NODE_TYPES.TSUnionType ||
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:230:5
     return;
   }
   if (
-    node.type === AST_NODE_TYPES.TSUnionType ||
+    false ||
     node.type === AST_NODE_TYPES.TSIntersectionType
   ) {
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:231:5
   }
   if (
     node.type === AST_NODE_TYPES.TSUnionType ||
-    node.type === AST_NODE_TYPES.TSIntersectionType
+    false
   ) {
     for (const type of node.types) addTypeNode(surface, type);
killedBy: manual algebra detection covers type, interface, and class surfaces directly
statusReason: expected undefined to be 'UserId' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:232:5
   if (
     node.type === AST_NODE_TYPES.TSUnionType ||
     node.type === AST_NODE_TYPES.TSIntersectionType
-  ) {
-    for (const type of node.types) addTypeNode(surface, type);
-  }
+  ) {}
 }
 
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:240:9
 function addClassMember(
   surface: ReturnType<typeof createSurface>,
   member: TSESTree.ClassElement,
-): void {
-  if (member.type === AST_NODE_TYPES.PropertyDefinition) {
-    addKey(surface, member.key, member.computed);
-    addLiteral(surface, member.value);
-    return;
-  }
-  if (member.type === AST_NODE_TYPES.MethodDefinition) {
-    addKey(surface, member.key, member.computed);
-  }
-}
+): void {}
 
 function addObjectMember(
killedBy: manual algebra detection covers type, interface, and class surfaces directly
statusReason: expected undefined to be 'Option' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:241:58
   surface: ReturnType<typeof createSurface>,
   member: TSESTree.ClassElement,
 ): void {
-  if (member.type === AST_NODE_TYPES.PropertyDefinition) {
-    addKey(surface, member.key, member.computed);
-    addLiteral(surface, member.value);
-    return;
-  }
+  if (member.type === AST_NODE_TYPES.PropertyDefinition) {}
   if (member.type === AST_NODE_TYPES.MethodDefinition) {
     addKey(surface, member.key, member.computed);
killedBy: manual-result invalid class Result { readonly ok = true as const; readonly value = 1; match() { return this.value; } }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:246:56
     addLiteral(surface, member.value);
     return;
   }
-  if (member.type === AST_NODE_TYPES.MethodDefinition) {
-    addKey(surface, member.key, member.computed);
-  }
+  if (member.type === AST_NODE_TYPES.MethodDefinition) {}
 }
 
killedBy: manual algebra detection covers type, interface, and class surfaces directly
statusReason: expected undefined to be 'Option' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:254:9
 function addObjectMember(
   surface: ReturnType<typeof createSurface>,
   member: TSESTree.ObjectLiteralElement,
-): void {
-  if (member.type !== AST_NODE_TYPES.Property) return;
-  addKey(surface, member.key, member.computed);
-  addLiteral(surface, member.value);
-}
+): void {}
 
 function isNode(value: unknown): value is TSESTree.Node {
killedBy: manual-result invalid 
        const Result = {
          ok: <T>(value: T) => ({ ok: true as const, value }),
          err: <E>(error: E) => ({ ok: false as const, error }),
          match: <T, E, 
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:261:10
 }
 
 function isNode(value: unknown): value is TSESTree.Node {
-  return typeof value === "object" && value !== null && "type" in value;
+  return false;
 }
 
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1344018576, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:261:10
 }
 
 function isNode(value: unknown): value is TSESTree.Node {
-  return typeof value === "object" && value !== null && "type" in value;
+  return true;
 }
 
killedBy: property: rule correctness Property 1: no recommended rule fires on safe TS sources
statusReason: Property failed after 2 tests
{ seed: -2127707608, path: "1:0:0:0:0", endOnFailure: true }
Counterexample: ["function a(a: number): number { return a + 0; }"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:267:9
 function walkNode(
   node: TSESTree.Node | null,
   visit: (node: TSESTree.Node) => void,
-): void {
-  if (node === null) return;
-  visit(node);
-  for (const [key, value] of Object.entries(node)) {
-    if (key === "parent") continue;
-    if (Array.isArray(value)) {
-      for (const child of value) {
-        walkNode(isNode(child) ? child : null, visit);
-      }
-      continue;
-    }
-    walkNode(isNode(value) ? value : null, visit);
-  }
-}
+): void {}
 
 function addFunctionBody(
killedBy: manual algebra detection requires reusable result helper names before flagging a function helper
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:270:52
 ): void {
   if (node === null) return;
   visit(node);
-  for (const [key, value] of Object.entries(node)) {
-    if (key === "parent") continue;
-    if (Array.isArray(value)) {
-      for (const child of value) {
-        walkNode(isNode(child) ? child : null, visit);
-      }
-      continue;
-    }
-    walkNode(isNode(value) ? value : null, visit);
-  }
+  for (const [key, value] of Object.entries(node)) {}
 }
 
killedBy: manual-result invalid function ok<T>(value: T) { return { ok: true as const, value }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:271:9
   if (node === null) return;
   visit(node);
   for (const [key, value] of Object.entries(node)) {
-    if (key === "parent") continue;
+    if (key !== "parent") continue;
     if (Array.isArray(value)) {
       for (const child of value) {
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1487523596, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:271:9
   if (node === null) return;
   visit(node);
   for (const [key, value] of Object.entries(node)) {
-    if (key === "parent") continue;
+    if (false) continue;
     if (Array.isArray(value)) {
       for (const child of value) {
killedBy: property: manual algebra family Property 6: manual-brand still fires under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 954179717, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:272:31
   visit(node);
   for (const [key, value] of Object.entries(node)) {
     if (key === "parent") continue;
-    if (Array.isArray(value)) {
-      for (const child of value) {
-        walkNode(isNode(child) ? child : null, visit);
-      }
-      continue;
-    }
+    if (Array.isArray(value)) {}
     walkNode(isNode(value) ? value : null, visit);
   }
killedBy: manual algebra detection requires reusable result helper names before flagging a function helper
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:272:9
   visit(node);
   for (const [key, value] of Object.entries(node)) {
     if (key === "parent") continue;
-    if (Array.isArray(value)) {
+    if (true) {
       for (const child of value) {
         walkNode(isNode(child) ? child : null, visit);
killedBy: property: manual algebra family Property 6: manual-brand still fires under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1914223543, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:273:34
   for (const [key, value] of Object.entries(node)) {
     if (key === "parent") continue;
     if (Array.isArray(value)) {
-      for (const child of value) {
-        walkNode(isNode(child) ? child : null, visit);
-      }
+      for (const child of value) {}
       continue;
     }
killedBy: manual-result invalid function ok<T>(value: T) { return { ok: true as const, value }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:288:9
     | TSESTree.FunctionDeclaration
     | TSESTree.FunctionExpression
     | TSESTree.ArrowFunctionExpression,
-): void {
-  const body = node.body;
-  walkNode(body, (child) => {
-    if (child.type === AST_NODE_TYPES.Property) {
-      addKey(surface, child.key, child.computed);
-      addLiteral(surface, child.value);
-      return;
-    }
-    if (child.type === AST_NODE_TYPES.MemberExpression) {
-      addKey(surface, child.property, child.computed);
-      return;
-    }
-    if (child.type === AST_NODE_TYPES.Literal) {
-      addLiteral(surface, child);
-    }
-  });
-}
+): void {}
 
 function getPatternName(pattern: TSESTree.VariableDeclarator["id"]): string | null {
killedBy: manual algebra detection requires reusable result helper names before flagging a function helper
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:290:29
     | TSESTree.ArrowFunctionExpression,
 ): void {
   const body = node.body;
-  walkNode(body, (child) => {
-    if (child.type === AST_NODE_TYPES.Property) {
-      addKey(surface, child.key, child.computed);
-      addLiteral(surface, child.value);
-      return;
-    }
-    if (child.type === AST_NODE_TYPES.MemberExpression) {
-      addKey(surface, child.property, child.computed);
-      return;
-    }
-    if (child.type === AST_NODE_TYPES.Literal) {
-      addLiteral(surface, child);
-    }
-  });
+  walkNode(body, (child) => {});
 }
 
killedBy: manual-result invalid function ok<T>(value: T) { return { ok: true as const, value }; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:291:49
 ): void {
   const body = node.body;
   walkNode(body, (child) => {
-    if (child.type === AST_NODE_TYPES.Property) {
-      addKey(surface, child.key, child.computed);
-      addLiteral(surface, child.value);
-      return;
-    }
+    if (child.type === AST_NODE_TYPES.Property) {}
     if (child.type === AST_NODE_TYPES.MemberExpression) {
       addKey(surface, child.property, child.computed);
killedBy: manual algebra detection requires reusable result helper names before flagging a function helper
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:296:57
       addLiteral(surface, child.value);
       return;
     }
-    if (child.type === AST_NODE_TYPES.MemberExpression) {
-      addKey(surface, child.property, child.computed);
-      return;
-    }
+    if (child.type === AST_NODE_TYPES.MemberExpression) {}
     if (child.type === AST_NODE_TYPES.Literal) {
       addLiteral(surface, child);
killedBy: manual-option invalid const hasValue = (option: { value?: number }) => option.value;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:300:9
       addKey(surface, child.property, child.computed);
       return;
     }
-    if (child.type === AST_NODE_TYPES.Literal) {
+    if (child.type !== AST_NODE_TYPES.Literal) {
       addLiteral(surface, child);
     }
killedBy: manual-option invalid const absent = () => ({ _tag: "Absent" as const });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:300:48
       addKey(surface, child.property, child.computed);
       return;
     }
-    if (child.type === AST_NODE_TYPES.Literal) {
-      addLiteral(surface, child);
-    }
+    if (child.type === AST_NODE_TYPES.Literal) {}
   });
 }
killedBy: manual-option invalid const absent = () => ({ _tag: "Absent" as const });
statusReason: Should have 1 error but had 0: []

0 !== 1
