[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:337:5
       addFunctionBody(surface, node);
       return finalizeSurface(surface);
     }
-    case AST_NODE_TYPES.VariableDeclarator: {
-      const displayName = getPatternName(node.id);
-      if (displayName === null) return null;
-      const init = node.init;
-      if (init === null) return null;
-      if (init.type === AST_NODE_TYPES.ObjectExpression) {
-        const surface = createSurface("object", node, displayName);
-        for (const member of init.properties) addObjectMember(surface, member);
-        return finalizeSurface(surface);
-      }
-      if (init.type === AST_NODE_TYPES.ClassExpression) {
-        const surface = createSurface("class", node, displayName);
-        for (const member of init.body.body) addClassMember(surface, member);
-        return finalizeSurface(surface);
-      }
-      if (
-        init.type === AST_NODE_TYPES.FunctionExpression ||
-        init.type === AST_NODE_TYPES.ArrowFunctionExpression
-      ) {
-        const surface = createSurface("function", node, displayName);
-        addFunctionBody(surface, init);
-        return finalizeSurface(surface);
-      }
-      return null;
-    }
+    case AST_NODE_TYPES.VariableDeclarator:
     default:
       return null;
killedBy: manual-option invalid 
        const Option = {
          some: <T>(value: T) => ({ _tag: "Some" as const, value }),
          none: { _tag: "None" as const },
          match: (input: unknown) => inp
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:337:45
       addFunctionBody(surface, node);
       return finalizeSurface(surface);
     }
-    case AST_NODE_TYPES.VariableDeclarator: {
-      const displayName = getPatternName(node.id);
-      if (displayName === null) return null;
-      const init = node.init;
-      if (init === null) return null;
-      if (init.type === AST_NODE_TYPES.ObjectExpression) {
-        const surface = createSurface("object", node, displayName);
-        for (const member of init.properties) addObjectMember(surface, member);
-        return finalizeSurface(surface);
-      }
-      if (init.type === AST_NODE_TYPES.ClassExpression) {
-        const surface = createSurface("class", node, displayName);
-        for (const member of init.body.body) addClassMember(surface, member);
-        return finalizeSurface(surface);
-      }
-      if (
-        init.type === AST_NODE_TYPES.FunctionExpression ||
-        init.type === AST_NODE_TYPES.ArrowFunctionExpression
-      ) {
-        const surface = createSurface("function", node, displayName);
-        addFunctionBody(surface, init);
-        return finalizeSurface(surface);
-      }
-      return null;
-    }
+    case AST_NODE_TYPES.VariableDeclarator: {}
     default:
       return null;
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 681127388, path: "0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:339:11
     }
     case AST_NODE_TYPES.VariableDeclarator: {
       const displayName = getPatternName(node.id);
-      if (displayName === null) return null;
+      if (displayName !== null) return null;
       const init = node.init;
       if (init === null) return null;
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -138150541, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/utils/manual-algebra-detection.ts:339:11
     }
     case AST_NODE_TYPES.VariableDeclarator: {
       const displayName = getPatternName(node.id);
-      if (displayName === null) return null;
+      if (false) return null;
       const init = node.init;
       if (init === null) return null;

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:342:58
       if (displayName === null) return null;
       const init = node.init;
       if (init === null) return null;
-      if (init.type === AST_NODE_TYPES.ObjectExpression) {
-        const surface = createSurface("object", node, displayName);
-        for (const member of init.properties) addObjectMember(surface, member);
-        return finalizeSurface(surface);
-      }
+      if (init.type === AST_NODE_TYPES.ObjectExpression) {}
       if (init.type === AST_NODE_TYPES.ClassExpression) {
         const surface = createSurface("class", node, displayName);
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -345373671, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:347:57
         for (const member of init.properties) addObjectMember(surface, member);
         return finalizeSurface(surface);
       }
-      if (init.type === AST_NODE_TYPES.ClassExpression) {
-        const surface = createSurface("class", node, displayName);
-        for (const member of init.body.body) addClassMember(surface, member);
-        return finalizeSurface(surface);
-      }
+      if (init.type === AST_NODE_TYPES.ClassExpression) {}
       if (
         init.type === AST_NODE_TYPES.FunctionExpression ||
killedBy: manual-brand invalid const UserId = class { readonly __brand = "UserId" as const; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:353:9
         return finalizeSurface(surface);
       }
       if (
-        init.type === AST_NODE_TYPES.FunctionExpression ||
+        false ||
         init.type === AST_NODE_TYPES.ArrowFunctionExpression
       ) {
killedBy: manual algebra detection accepts all supported brand helper prefixes
statusReason: expected undefined to be 'asUserId' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:354:9
       }
       if (
         init.type === AST_NODE_TYPES.FunctionExpression ||
-        init.type === AST_NODE_TYPES.ArrowFunctionExpression
+        false
       ) {
         const surface = createSurface("function", node, displayName);
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 900012069, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:355:9
       if (
         init.type === AST_NODE_TYPES.FunctionExpression ||
         init.type === AST_NODE_TYPES.ArrowFunctionExpression
-      ) {
-        const surface = createSurface("function", node, displayName);
-        addFunctionBody(surface, init);
-        return finalizeSurface(surface);
-      }
+      ) {}
       return null;
     }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1327256617, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:368:10
 }
 
 function looksResultLikeName(name: string | null): boolean {
-  return typeof name === "string" && RESULT_NAME_RE.test(name);
+  return false;
 }
 
killedBy: manual-result valid // eslint-disable-next-line @rule-tester/manual-result -- suppression test
type Result<T, E> = { readonly ok: true; readonly value: T } | { readonly ok: false; readonly error: E };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-result').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:368:10
 }
 
 function looksResultLikeName(name: string | null): boolean {
-  return typeof name === "string" && RESULT_NAME_RE.test(name);
+  return true;
 }
 
killedBy: manual-result valid const outcome = { ok: true as const, value };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-result',
    severity: 2,
    message: 'Manual result-like algebra outcome — prefer Effect.Either/Effect or an endorsed helper instead of hand-rolling reusable success/failure wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:372:10
 }
 
 function looksOptionLikeName(name: string | null): boolean {
-  return typeof name === "string" && OPTION_NAME_RE.test(name);
+  return false;
 }
 
killedBy: manual-option valid // eslint-disable-next-line @rule-tester/manual-option -- suppression test
type Option<T> = { readonly _tag: 'Some'; readonly value: T } | { readonly _tag: 'None' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-option').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:372:10
 }
 
 function looksOptionLikeName(name: string | null): boolean {
-  return typeof name === "string" && OPTION_NAME_RE.test(name);
+  return true;
 }
 
killedBy: manual-option valid const cache = { some: 1, none: null };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-option',
    severity: 2,
    message: 'Manual option-like algebra cache — prefer Effect.Option or an endorsed helper instead of hand-rolling reusable Some/None wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:376:10
 }
 
 function isTransportLikeName(name: string | null): boolean {
-  return typeof name === "string" && TRANSPORT_NAME_RE.test(name);
+  return true;
 }
 
killedBy: property: manual algebra family Property 4: manual-result still fires under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1386405337, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:376:10
 }
 
 function isTransportLikeName(name: string | null): boolean {
-  return typeof name === "string" && TRANSPORT_NAME_RE.test(name);
+  return false;
 }
 
killedBy: manual algebra detection exempts transport-shaped result aliases that would otherwise look manual
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:380:10
 }
 
 function looksErrorLike(value: string | null): boolean {
-  return typeof value === "string" && ERROR_NAME_RE.test(value);
+  return false;
 }
 
killedBy: manual algebra detection exempts tagged error names from option detection
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:380:10
 }
 
 function looksErrorLike(value: string | null): boolean {
-  return typeof value === "string" && ERROR_NAME_RE.test(value);
+  return true;
 }
 
killedBy: property: manual algebra family Property 8: manual-option still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -178779775, path: "0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:384:10
 }
 
 function hasDiscriminantStyle(surface: Surface): boolean {
-  return surface.hasTagKey || hasNormalized(surface.keys, ["type", "kind", "status"]);
+  return surface.hasTagKey && hasNormalized(surface.keys, ["type", "kind", "status"]);
 }
 
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:384:10
 }
 
 function hasDiscriminantStyle(surface: Surface): boolean {
-  return surface.hasTagKey || hasNormalized(surface.keys, ["type", "kind", "status"]);
+  return true;
 }
 
killedBy: manual algebra detection still flags non-function result surfaces that rely on branch pairs
statusReason: expected undefined to be 'Ok' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:389:5
 
 function hasResultBranchPair(surface: Surface): boolean {
   if (
-    hasNormalized(surface.keys, ["ok"]) &&
-    (hasNormalized(surface.keys, ["error", "err"]) ||
-      hasNormalized(surface.keys, ["value"]))
+    hasNormalized(surface.keys, ["ok"]) || hasNormalized(surface.keys, ["error", "err"]) || hasNormalized(surface.keys, ["value"])
   ) {
     return true;
killedBy: manual algebra detection requires complete ok-based evidence on result-like surfaces
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:389:5
 
 function hasResultBranchPair(surface: Surface): boolean {
   if (
-    hasNormalized(surface.keys, ["ok"]) &&
-    (hasNormalized(surface.keys, ["error", "err"]) ||
-      hasNormalized(surface.keys, ["value"]))
+    false
   ) {
     return true;
killedBy: manual-result invalid interface Result<T, E> { readonly ok: true; readonly value: T; match(input: T, error: E): unknown; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:390:6
 function hasResultBranchPair(surface: Surface): boolean {
   if (
     hasNormalized(surface.keys, ["ok"]) &&
-    (hasNormalized(surface.keys, ["error", "err"]) ||
-      hasNormalized(surface.keys, ["value"]))
+    (true)
   ) {
     return true;
killedBy: manual algebra detection requires complete ok-based evidence on result-like surfaces
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:390:6
 function hasResultBranchPair(surface: Surface): boolean {
   if (
     hasNormalized(surface.keys, ["ok"]) &&
-    (hasNormalized(surface.keys, ["error", "err"]) ||
-      hasNormalized(surface.keys, ["value"]))
+    (hasNormalized(surface.keys, ["error", "err"]) && hasNormalized(surface.keys, ["value"]))
   ) {
     return true;
killedBy: manual-result invalid interface Result<T, E> { readonly ok: true; readonly value: T; match(input: T, error: E): unknown; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:392:5
     hasNormalized(surface.keys, ["ok"]) &&
     (hasNormalized(surface.keys, ["error", "err"]) ||
       hasNormalized(surface.keys, ["value"]))
-  ) {
-    return true;
-  }
+  ) {}
   return RESULT_LITERAL_PAIRS.some(([left, right]) =>
     hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right)
killedBy: manual-result invalid interface Result<T, E> { readonly ok: true; readonly value: T; match(input: T, error: E): unknown; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:395:10
   ) {
     return true;
   }
-  return RESULT_LITERAL_PAIRS.some(([left, right]) =>
-    hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right)
-  );
+  return RESULT_LITERAL_PAIRS.every(([left, right]) => hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right));
 }
 
killedBy: manual-result invalid type Either<L, R> = { readonly _tag: "Left"; readonly left: L } | { readonly _tag: "Right"; readonly right: R };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrowFunction
src/utils/manual-algebra-detection.ts:395:36
   ) {
     return true;
   }
-  return RESULT_LITERAL_PAIRS.some(([left, right]) =>
-    hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right)
+  return RESULT_LITERAL_PAIRS.some(() => undefined
   );
 }
killedBy: manual-result invalid type Either<L, R> = { readonly _tag: "Left"; readonly left: L } | { readonly _tag: "Right"; readonly right: R };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:396:5
     return true;
   }
   return RESULT_LITERAL_PAIRS.some(([left, right]) =>
-    hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right)
+    true
   );
 }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 925313023, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:396:5
     return true;
   }
   return RESULT_LITERAL_PAIRS.some(([left, right]) =>
-    hasKeyPair(surface, left, right) || hasLiteralPair(surface, left, right)
+    false
   );
 }
killedBy: manual-result invalid type Either<L, R> = { readonly _tag: "Left"; readonly left: L } | { readonly _tag: "Right"; readonly right: R };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:401:28
 }
 
 function hasOptionBranchPair(surface: Surface): boolean {
-  if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(([left, right]) => hasLiteralPair(surface, left, right))) {
+  if (surface.hasTagKey && OPTION_LITERAL_PAIRS.every(([left, right]) => hasLiteralPair(surface, left, right))) {
     return true;
   }
killedBy: manual-option valid // eslint-disable-next-line @rule-tester/manual-option -- suppression test
type Option<T> = { readonly _tag: 'Some'; readonly value: T } | { readonly _tag: 'None' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-option').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] ArrowFunction
src/utils/manual-algebra-detection.ts:401:54
 }
 
 function hasOptionBranchPair(surface: Surface): boolean {
-  if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(([left, right]) => hasLiteralPair(surface, left, right))) {
+  if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(() => undefined)) {
     return true;
   }
killedBy: manual-option valid // eslint-disable-next-line @rule-tester/manual-option -- suppression test
type Option<T> = { readonly _tag: 'Some'; readonly value: T } | { readonly _tag: 'None' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-option').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:402:12
 
 function hasOptionBranchPair(surface: Surface): boolean {
   if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(([left, right]) => hasLiteralPair(surface, left, right))) {
-    return true;
+    return false;
   }
   return OPTION_LITERAL_PAIRS.some(([left, right]) => hasKeyPair(surface, left, right));
killedBy: manual-option valid // eslint-disable-next-line @rule-tester/manual-option -- suppression test
type Option<T> = { readonly _tag: 'Some'; readonly value: T } | { readonly _tag: 'None' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-option').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:404:10
   if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(([left, right]) => hasLiteralPair(surface, left, right))) {
     return true;
   }
-  return OPTION_LITERAL_PAIRS.some(([left, right]) => hasKeyPair(surface, left, right));
+  return OPTION_LITERAL_PAIRS.every(([left, right]) => hasKeyPair(surface, left, right));
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1261392194, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/utils/manual-algebra-detection.ts:404:36
   if (surface.hasTagKey && OPTION_LITERAL_PAIRS.some(([left, right]) => hasLiteralPair(surface, left, right))) {
     return true;
   }
-  return OPTION_LITERAL_PAIRS.some(([left, right]) => hasKeyPair(surface, left, right));
+  return OPTION_LITERAL_PAIRS.some(() => undefined);
 }
 
killedBy: manual-option invalid 
        const Option = {
          some: <T>(value: T) => ({ _tag: "Some" as const, value }),
          none: { _tag: "None" as const },
          match: (input: unknown) => inp
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:416:10
   candidates: ReadonlySet<string>,
 ): boolean {
   const name = getNormalizedDisplayName(surface);
-  return name !== null && candidates.has(name);
+  return true;
 }
 
killedBy: manual-result valid const outcome = { ok: true as const, value };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-result',
    severity: 2,
    message: 'Manual result-like algebra outcome — prefer Effect.Either/Effect or an endorsed helper instead of hand-rolling reusable success/failure wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:416:10
   candidates: ReadonlySet<string>,
 ): boolean {
   const name = getNormalizedDisplayName(surface);
-  return name !== null && candidates.has(name);
+  return false;
 }
 
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1343647828, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:427:10
 }
 
 function hasTaggedLiterals(surface: Surface, candidates: Iterable<string>): boolean {
-  return surface.hasTagKey && hasNormalized(surface.stringLiterals, candidates);
+  return true;
 }
 
killedBy: manual-option valid const present = () => ({ _tag: "Missing" as const });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-option',
    severity: 2,
    message: 'Manual option-like algebra present — prefer Effect.Option or an endorsed helper instead of hand-rolling reusable Some/None wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:427:10
 }
 
 function hasTaggedLiterals(surface: Surface, candidates: Iterable<string>): boolean {
-  return surface.hasTagKey && hasNormalized(surface.stringLiterals, candidates);
+  return surface.hasTagKey || hasNormalized(surface.stringLiterals, candidates);
 }
 
killedBy: manual-option valid const present = () => ({ _tag: "Missing" as const });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-option',
    severity: 2,
    message: 'Manual option-like algebra present — prefer Effect.Option or an endorsed helper instead of hand-rolling reusable Some/None wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:435:7
 }
 
 function hasResultFunctionEvidence(surface: Surface): boolean {
-  if (surface.kind !== "function") return hasResultBranchPair(surface);
+  if (false) return hasResultBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
killedBy: manual algebra detection still flags non-function result surfaces that rely on branch pairs
statusReason: expected undefined to be 'Ok' // Object.is equality

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:435:7
 }
 
 function hasResultFunctionEvidence(surface: Surface): boolean {
-  if (surface.kind !== "function") return hasResultBranchPair(surface);
+  if (surface.kind === "function") return hasResultBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1545096484, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[NoCoverage] BooleanLiteral
src/utils/manual-algebra-detection.ts:437:29
 function hasResultFunctionEvidence(surface: Surface): boolean {
   if (surface.kind !== "function") return hasResultBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
-  if (name === null) return false;
+  if (name === null) return true;
   if (name === "ok") {
     return hasKeys(surface, ["ok"]) &&

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:438:22
   if (surface.kind !== "function") return hasResultBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
-  if (name === "ok") {
-    return hasKeys(surface, ["ok"]) &&
-      (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
-  }
+  if (name === "ok") {}
   if (name === "err" || name === "error") {
     return hasKeys(surface, ["error", "err"]) ||
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1806719243, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a0"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:438:7
   if (surface.kind !== "function") return hasResultBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
-  if (name === "ok") {
+  if (false) {
     return hasKeys(surface, ["ok"]) &&
       (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1045196555, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:439:12
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
   if (name === "ok") {
-    return hasKeys(surface, ["ok"]) &&
-      (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
+    return hasKeys(surface, ["ok"]) || hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true");
   }
   if (name === "err" || name === "error") {
killedBy: manual algebra detection keeps `ok` and `err` helper names clean when the branch evidence is incomplete
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:439:12
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
   if (name === "ok") {
-    return hasKeys(surface, ["ok"]) &&
-      (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
+    return true;
   }
   if (name === "err" || name === "error") {
killedBy: manual algebra detection keeps `ok` and `err` helper names clean when the branch evidence is incomplete
statusReason: expected { kind: 'result', …(3) } to be null
