[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:440:8
   if (name === null) return false;
   if (name === "ok") {
     return hasKeys(surface, ["ok"]) &&
-      (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
+      (hasKeys(surface, ["value"]) && hasBooleanLiteral(surface, "true"));
   }
   if (name === "err" || name === "error") {
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -364238725, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:440:8
   if (name === null) return false;
   if (name === "ok") {
     return hasKeys(surface, ["ok"]) &&
-      (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
+      (true);
   }
   if (name === "err" || name === "error") {
killedBy: manual algebra detection keeps `ok` and `err` helper names clean when the branch evidence is incomplete
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:442:25
     return hasKeys(surface, ["ok"]) &&
       (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
   }
-  if (name === "err" || name === "error") {
+  if (name === "err" || false) {
     return hasKeys(surface, ["error", "err"]) ||
       (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
killedBy: manual algebra detection recognizes `err` and `error` helpers through their dedicated evidence paths
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:442:43
     return hasKeys(surface, ["ok"]) &&
       (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
   }
-  if (name === "err" || name === "error") {
-    return hasKeys(surface, ["error", "err"]) ||
-      (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
-  }
+  if (name === "err" || name === "error") {}
   if (SOME_RESULT_NAMES.has(name)) {
     return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
killedBy: manual algebra detection recognizes `err` and `error` helpers through their dedicated evidence paths
statusReason: expected undefined to be 'err' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:443:12
       (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
   }
   if (name === "err" || name === "error") {
-    return hasKeys(surface, ["error", "err"]) ||
-      (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
+    return hasKeys(surface, ["error", "err"]) && hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false");
   }
   if (SOME_RESULT_NAMES.has(name)) {
killedBy: manual algebra detection recognizes `err` and `error` helpers through their dedicated evidence paths
statusReason: expected undefined to be 'err' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:443:12
       (hasKeys(surface, ["value"]) || hasBooleanLiteral(surface, "true"));
   }
   if (name === "err" || name === "error") {
-    return hasKeys(surface, ["error", "err"]) ||
-      (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
+    return false;
   }
   if (SOME_RESULT_NAMES.has(name)) {
killedBy: manual algebra detection recognizes `err` and `error` helpers through their dedicated evidence paths
statusReason: expected undefined to be 'err' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:444:8
   }
   if (name === "err" || name === "error") {
     return hasKeys(surface, ["error", "err"]) ||
-      (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
+      (false);
   }
   if (SOME_RESULT_NAMES.has(name)) {
killedBy: manual algebra detection recognizes `err` and `error` helpers through their dedicated evidence paths
statusReason: expected undefined to be 'err' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:444:8
   }
   if (name === "err" || name === "error") {
     return hasKeys(surface, ["error", "err"]) ||
-      (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
+      (hasKeys(surface, ["ok"]) || hasBooleanLiteral(surface, "false"));
   }
   if (SOME_RESULT_NAMES.has(name)) {
killedBy: manual algebra detection keeps `ok` and `err` helper names clean when the branch evidence is incomplete
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:446:36
     return hasKeys(surface, ["error", "err"]) ||
       (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
   }
-  if (SOME_RESULT_NAMES.has(name)) {
-    return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
-  }
+  if (SOME_RESULT_NAMES.has(name)) {}
   if (name === "isok") return hasKeys(surface, ["ok"]);
   if (name === "iserr") {
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:447:12
       (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
   }
   if (SOME_RESULT_NAMES.has(name)) {
-    return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
+    return false;
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:447:12
       (hasKeys(surface, ["ok"]) && hasBooleanLiteral(surface, "false"));
   }
   if (SOME_RESULT_NAMES.has(name)) {
-    return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
+    return true;
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
killedBy: manual algebra detection keeps result helper names clean when their evidence does not match
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:449:7
   if (SOME_RESULT_NAMES.has(name)) {
     return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
   }
-  if (name === "isok") return hasKeys(surface, ["ok"]);
+  if (false) return hasKeys(surface, ["ok"]);
   if (name === "iserr") {
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isOk' // Object.is equality

[Killed] StringLiteral
src/utils/manual-algebra-detection.ts:449:16
   if (SOME_RESULT_NAMES.has(name)) {
     return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
   }
-  if (name === "isok") return hasKeys(surface, ["ok"]);
+  if (name === "") return hasKeys(surface, ["ok"]);
   if (name === "iserr") {
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isOk' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:450:7
     return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
-  if (name === "iserr") {
+  if (false) {
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
   }
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isErr' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:450:25
     return hasKeys(surface, [name]) || hasNormalized(surface.stringLiterals, [name]);
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
-  if (name === "iserr") {
-    return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
-  }
+  if (name === "iserr") {}
   if (name === "isleft" || name === "isright") {
     const branchName = name.slice(2);
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isErr' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:451:12
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
   if (name === "iserr") {
-    return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
+    return hasKeys(surface, ["error", "err"]) && hasBooleanLiteral(surface, "false");
   }
   if (name === "isleft" || name === "isright") {
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isErr' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:451:12
   }
   if (name === "isok") return hasKeys(surface, ["ok"]);
   if (name === "iserr") {
-    return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
+    return true;
   }
   if (name === "isleft" || name === "isright") {
killedBy: manual algebra detection keeps result helper names clean when their evidence does not match
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:453:7
   if (name === "iserr") {
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
   }
-  if (name === "isleft" || name === "isright") {
+  if (false || name === "isright") {
     const branchName = name.slice(2);
     return hasKeys(surface, [branchName]) ||
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isLeft' // Object.is equality

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:453:48
   if (name === "iserr") {
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
   }
-  if (name === "isleft" || name === "isright") {
-    const branchName = name.slice(2);
-    return hasKeys(surface, [branchName]) ||
-      hasNormalized(surface.stringLiterals, [branchName]);
-  }
+  if (name === "isleft" || name === "isright") {}
   if (name === "issuccess" || name === "isfailure") {
     const branchName = name.slice(2);
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isLeft' // Object.is equality

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:454:24
     return hasKeys(surface, ["error", "err"]) || hasBooleanLiteral(surface, "false");
   }
   if (name === "isleft" || name === "isright") {
-    const branchName = name.slice(2);
+    const branchName = name;
     return hasKeys(surface, [branchName]) ||
       hasNormalized(surface.stringLiterals, [branchName]);
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isLeft' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:455:12
   }
   if (name === "isleft" || name === "isright") {
     const branchName = name.slice(2);
-    return hasKeys(surface, [branchName]) ||
-      hasNormalized(surface.stringLiterals, [branchName]);
+    return true;
   }
   if (name === "issuccess" || name === "isfailure") {
killedBy: manual algebra detection keeps result helper names clean when their evidence does not match
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:455:12
   }
   if (name === "isleft" || name === "isright") {
     const branchName = name.slice(2);
-    return hasKeys(surface, [branchName]) ||
-      hasNormalized(surface.stringLiterals, [branchName]);
+    return hasKeys(surface, [branchName]) && hasNormalized(surface.stringLiterals, [branchName]);
   }
   if (name === "issuccess" || name === "isfailure") {
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isLeft' // Object.is equality

[Killed] ArrayDeclaration
src/utils/manual-algebra-detection.ts:456:45
   if (name === "isleft" || name === "isright") {
     const branchName = name.slice(2);
     return hasKeys(surface, [branchName]) ||
-      hasNormalized(surface.stringLiterals, [branchName]);
+      hasNormalized(surface.stringLiterals, []);
   }
   if (name === "issuccess" || name === "isfailure") {
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isLeft' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:458:31
     return hasKeys(surface, [branchName]) ||
       hasNormalized(surface.stringLiterals, [branchName]);
   }
-  if (name === "issuccess" || name === "isfailure") {
+  if (name === "issuccess" || false) {
     const branchName = name.slice(2);
     return hasKeys(surface, [branchName]) ||
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isFailure' // Object.is equality

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:458:31
     return hasKeys(surface, [branchName]) ||
       hasNormalized(surface.stringLiterals, [branchName]);
   }
-  if (name === "issuccess" || name === "isfailure") {
+  if (name === "issuccess" || name !== "isfailure") {
     const branchName = name.slice(2);
     return hasKeys(surface, [branchName]) ||
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isFailure' // Object.is equality

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:459:24
       hasNormalized(surface.stringLiterals, [branchName]);
   }
   if (name === "issuccess" || name === "isfailure") {
-    const branchName = name.slice(2);
+    const branchName = name;
     return hasKeys(surface, [branchName]) ||
       hasNormalized(surface.stringLiterals, [branchName]);
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'isSuccess' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:467:7
 }
 
 function hasOptionFunctionEvidence(surface: Surface): boolean {
-  if (surface.kind !== "function") return hasOptionBranchPair(surface);
+  if (false) return hasOptionBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
killedBy: manual algebra detection still flags non-function option surfaces that rely on branch pairs
statusReason: expected undefined to be 'Some' // Object.is equality

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:467:7
 }
 
 function hasOptionFunctionEvidence(surface: Surface): boolean {
-  if (surface.kind !== "function") return hasOptionBranchPair(surface);
+  if (surface.kind === "function") return hasOptionBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
killedBy: manual-option invalid const some = <T>(value: T) => ({ _tag: "Some" as const, value });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:470:20
   if (surface.kind !== "function") return hasOptionBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
-  const someLike = hasTaggedLiterals(surface, SOME_OPTION_NAMES) || hasKeys(surface, ["value"]);
+  const someLike = false;
   const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
 
killedBy: manual-option invalid const some = <T>(value: T) => ({ _tag: "Some" as const, value });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:470:20
   if (surface.kind !== "function") return hasOptionBranchPair(surface);
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
-  const someLike = hasTaggedLiterals(surface, SOME_OPTION_NAMES) || hasKeys(surface, ["value"]);
+  const someLike = true;
   const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
 
killedBy: manual-option valid const present = () => ({ _tag: "Missing" as const });
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-option',
    severity: 2,
    message: 'Manual option-like algebra present — prefer Effect.Option or an endorsed helper instead of hand-rolling reusable Some/None wrappers.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:471:20
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
   const someLike = hasTaggedLiterals(surface, SOME_OPTION_NAMES) || hasKeys(surface, ["value"]);
-  const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
+  const noneLike = false;
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
killedBy: manual-option invalid const absent = () => ({ _tag: "Absent" as const });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:471:20
   const name = getNormalizedDisplayName(surface);
   if (name === null) return false;
   const someLike = hasTaggedLiterals(surface, SOME_OPTION_NAMES) || hasKeys(surface, ["value"]);
-  const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
+  const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) && hasKeys(surface, NONE_OPTION_NAMES);
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
killedBy: manual-option invalid const absent = () => ({ _tag: "Absent" as const });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:473:7
   const someLike = hasTaggedLiterals(surface, SOME_OPTION_NAMES) || hasKeys(surface, ["value"]);
   const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
 
-  if (SOME_OPTION_NAMES.has(name)) return someLike;
+  if (false) return someLike;
   if (NONE_OPTION_NAMES.has(name)) return noneLike;
   if (name === "issome" || name === "hasvalue") return someLike;
killedBy: manual-option invalid const some = <T>(value: T) => ({ _tag: "Some" as const, value });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:474:7
   const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
-  if (NONE_OPTION_NAMES.has(name)) return noneLike;
+  if (true) return noneLike;
   if (name === "issome" || name === "hasvalue") return someLike;
   if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
killedBy: manual-option invalid const hasValue = (option: { value?: number }) => option.value;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:474:7
   const noneLike = hasTaggedLiterals(surface, NONE_OPTION_NAMES) || hasKeys(surface, NONE_OPTION_NAMES);
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
-  if (NONE_OPTION_NAMES.has(name)) return noneLike;
+  if (false) return noneLike;
   if (name === "issome" || name === "hasvalue") return someLike;
   if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
killedBy: manual-option invalid const absent = () => ({ _tag: "Absent" as const });
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:475:7
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
   if (NONE_OPTION_NAMES.has(name)) return noneLike;
-  if (name === "issome" || name === "hasvalue") return someLike;
+  if (false) return someLike;
   if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
   return hasOptionBranchPair(surface);
killedBy: manual-option invalid const hasValue = (option: { value?: number }) => option.value;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:475:7
 
   if (SOME_OPTION_NAMES.has(name)) return someLike;
   if (NONE_OPTION_NAMES.has(name)) return noneLike;
-  if (name === "issome" || name === "hasvalue") return someLike;
+  if (false || name === "hasvalue") return someLike;
   if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
   return hasOptionBranchPair(surface);
killedBy: manual algebra detection recognizes the base option helper names
statusReason: expected undefined to be 'isSome' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:476:7
   if (SOME_OPTION_NAMES.has(name)) return someLike;
   if (NONE_OPTION_NAMES.has(name)) return noneLike;
   if (name === "issome" || name === "hasvalue") return someLike;
-  if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
+  if (false) return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
   return hasOptionBranchPair(surface);
 }
killedBy: manual algebra detection recognizes the extended option helper names
statusReason: expected undefined to be 'isNone' // Object.is equality

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:476:7
   if (SOME_OPTION_NAMES.has(name)) return someLike;
   if (NONE_OPTION_NAMES.has(name)) return noneLike;
   if (name === "issome" || name === "hasvalue") return someLike;
-  if (name === "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
+  if (name !== "isnone") return hasTaggedLiterals(surface, NONE_OPTION_NAMES);
   return hasOptionBranchPair(surface);
 }
killedBy: manual algebra detection recognizes the extended option helper names
statusReason: expected undefined to be 'isNone' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:481:10
 }
 
 function hasResultReusableSignal(surface: Surface): boolean {
-  return looksResultLikeName(surface.displayName) ||
-    hasNormalizedDisplayName(surface, RESULT_FUNCTION_NAMES) ||
-    hasNormalized(surface.keys, RESULT_HELPERS);
+  return (looksResultLikeName(surface.displayName) || hasNormalizedDisplayName(surface, RESULT_FUNCTION_NAMES)) && hasNormalized(surface.keys, RESULT_HELPERS);
 }
 
killedBy: manual algebra detection still flags result-like surfaces when error-like literals are not on `_tag`
statusReason: expected undefined to be 'Outcome' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:481:10
 }
 
 function hasResultReusableSignal(surface: Surface): boolean {
-  return looksResultLikeName(surface.displayName) ||
-    hasNormalizedDisplayName(surface, RESULT_FUNCTION_NAMES) ||
+  return false ||
     hasNormalized(surface.keys, RESULT_HELPERS);
 }
killedBy: property: manual algebra family Property 7: manual-result still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -742364683, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:487:10
 }
 
 function hasOptionReusableSignal(surface: Surface): boolean {
-  return looksOptionLikeName(surface.displayName) ||
-    hasNormalizedDisplayName(surface, OPTION_FUNCTION_NAMES) ||
-    hasNormalized(surface.keys, OPTION_HELPERS);
+  return false;
 }
 
killedBy: property: manual algebra family Property 5: manual-option still fires under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 283095125, path: "0:0:0", endOnFailure: true }
Counterexample: ["","aa"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:487:10
 }
 
 function hasOptionReusableSignal(surface: Surface): boolean {
-  return looksOptionLikeName(surface.displayName) ||
-    hasNormalizedDisplayName(surface, OPTION_FUNCTION_NAMES) ||
+  return false ||
     hasNormalized(surface.keys, OPTION_HELPERS);
 }
killedBy: property: manual algebra family Property 8: manual-option still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: 1027692315, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:493:10
 }
 
 function hasBrandMarker(surface: Surface): boolean {
-  return hasKeys(surface, BRAND_MARKERS) ||
-    (surface.displayName !== null &&
-      hasKeys(surface, ["brand"]) &&
-      hasNormalized(surface.stringLiterals, [surface.displayName]));
+  return false;
 }
 
killedBy: manual algebra detection covers type, interface, and class surfaces directly
statusReason: expected undefined to be 'UserId' // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:493:10
 }
 
 function hasBrandMarker(surface: Surface): boolean {
-  return hasKeys(surface, BRAND_MARKERS) ||
-    (surface.displayName !== null &&
-      hasKeys(surface, ["brand"]) &&
-      hasNormalized(surface.stringLiterals, [surface.displayName]));
+  return hasKeys(surface, BRAND_MARKERS) && surface.displayName !== null && hasKeys(surface, ["brand"]) && hasNormalized(surface.stringLiterals, [surface.displayName]);
 }
 
killedBy: manual algebra detection covers type, interface, and class surfaces directly
statusReason: expected undefined to be 'UserId' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:494:6
 
 function hasBrandMarker(surface: Surface): boolean {
   return hasKeys(surface, BRAND_MARKERS) ||
-    (surface.displayName !== null &&
-      hasKeys(surface, ["brand"]) &&
-      hasNormalized(surface.stringLiterals, [surface.displayName]));
+    (false);
 }
 
killedBy: manual-brand invalid type AgentName = string & { readonly brand: "AgentName" };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ArrayDeclaration
src/utils/manual-algebra-detection.ts:496:45
   return hasKeys(surface, BRAND_MARKERS) ||
     (surface.displayName !== null &&
       hasKeys(surface, ["brand"]) &&
-      hasNormalized(surface.stringLiterals, [surface.displayName]));
+      hasNormalized(surface.stringLiterals, []));
 }
 
killedBy: manual-brand invalid type AgentName = string & { readonly brand: "AgentName" };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:501:57
 
 function getBrandHelperCastName(node: TSESTree.Node): string | null {
   let expression: TSESTree.Expression | null = null;
-  if (node.type === AST_NODE_TYPES.FunctionDeclaration) {
-    if (!node.returnType || !node.body) return null;
-    expression = getSingleReturnedExpression(node.body.body);
-  }
+  if (node.type === AST_NODE_TYPES.FunctionDeclaration) {}
   if (
     node.type === AST_NODE_TYPES.VariableDeclarator &&
killedBy: manual-brand invalid function asUserId(value: string): UserId { return value as UserId; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:502:9
 function getBrandHelperCastName(node: TSESTree.Node): string | null {
   let expression: TSESTree.Expression | null = null;
   if (node.type === AST_NODE_TYPES.FunctionDeclaration) {
-    if (!node.returnType || !node.body) return null;
+    if (node.returnType || !node.body) return null;
     expression = getSingleReturnedExpression(node.body.body);
   }
killedBy: manual-brand valid function asUserId(value: string) { return value as UserId; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface asUserId — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 1,
    nodeType: 'FunctionDeclaration',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:502:9
 function getBrandHelperCastName(node: TSESTree.Node): string | null {
   let expression: TSESTree.Expression | null = null;
   if (node.type === AST_NODE_TYPES.FunctionDeclaration) {
-    if (!node.returnType || !node.body) return null;
+    if (false) return null;
     expression = getSingleReturnedExpression(node.body.body);
   }
killedBy: manual-brand valid function asUserId(value: string) { return value as UserId; }
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface asUserId — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 1,
    nodeType: 'FunctionDeclaration',
