[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:508:6
   if (
     node.type === AST_NODE_TYPES.VariableDeclarator &&
     node.init &&
-    (node.init.type === AST_NODE_TYPES.FunctionExpression ||
+    (false ||
       node.init.type === AST_NODE_TYPES.ArrowFunctionExpression)
   ) {
killedBy: manual-brand invalid const asUserId = function (value: string): UserId { return value as UserId; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:510:5
     node.init &&
     (node.init.type === AST_NODE_TYPES.FunctionExpression ||
       node.init.type === AST_NODE_TYPES.ArrowFunctionExpression)
-  ) {
-    const fn = node.init;
-    if (!fn.returnType) return null;
-    if (fn.body.type === AST_NODE_TYPES.BlockStatement) {
-      expression = getSingleReturnedExpression(fn.body.body);
-    } else {
-      expression = fn.body;
-    }
-  }
+  ) {}
 
   if (expression === null) return null;
killedBy: manual algebra detection requires brand helper names before flagging a cast helper
statusReason: expected undefined to be 'asUserId' // Object.is equality

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:512:9
       node.init.type === AST_NODE_TYPES.ArrowFunctionExpression)
   ) {
     const fn = node.init;
-    if (!fn.returnType) return null;
+    if (fn.returnType) return null;
     if (fn.body.type === AST_NODE_TYPES.BlockStatement) {
       expression = getSingleReturnedExpression(fn.body.body);
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -282281255, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:512:9
       node.init.type === AST_NODE_TYPES.ArrowFunctionExpression)
   ) {
     const fn = node.init;
-    if (!fn.returnType) return null;
+    if (false) return null;
     if (fn.body.type === AST_NODE_TYPES.BlockStatement) {
       expression = getSingleReturnedExpression(fn.body.body);
killedBy: manual algebra detection requires explicit return types on variable helper casts
statusReason: expected { kind: 'brand', …(3) } to be null

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:513:57
   ) {
     const fn = node.init;
     if (!fn.returnType) return null;
-    if (fn.body.type === AST_NODE_TYPES.BlockStatement) {
-      expression = getSingleReturnedExpression(fn.body.body);
-    } else {
+    if (fn.body.type === AST_NODE_TYPES.BlockStatement) {} else {
       expression = fn.body;
     }
killedBy: manual-brand invalid const asUserId = function (value: string): UserId { return value as UserId; };
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:515:12
     if (!fn.returnType) return null;
     if (fn.body.type === AST_NODE_TYPES.BlockStatement) {
       expression = getSingleReturnedExpression(fn.body.body);
-    } else {
-      expression = fn.body;
-    }
+    } else {}
   }
 
killedBy: manual-brand invalid const asUserId = (value: string): UserId => value as UserId;
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:537:7
 function getSingleReturnedExpression(
   statements: readonly TSESTree.Statement[],
 ): TSESTree.Expression | null {
-  if (statements.length !== 1) return null;
+  if (statements.length === 1) return null;
   const statement = statements[0]!;
   if (statement.type !== AST_NODE_TYPES.ReturnStatement) return null;
killedBy: manual-brand invalid function asUserId(value: string): UserId { return value as UserId; }
statusReason: Should have 1 error but had 0: []

0 !== 1

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:537:7
 function getSingleReturnedExpression(
   statements: readonly TSESTree.Statement[],
 ): TSESTree.Expression | null {
-  if (statements.length !== 1) return null;
+  if (false) return null;
   const statement = statements[0]!;
   if (statement.type !== AST_NODE_TYPES.ReturnStatement) return null;
killedBy: manual algebra detection keeps multi-statement and empty-return brand helpers clean
statusReason: expected { kind: 'brand', …(3) } to be null

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:540:10
   if (statements.length !== 1) return null;
   const statement = statements[0]!;
   if (statement.type !== AST_NODE_TYPES.ReturnStatement) return null;
-  return statement.argument ?? null;
+  return statement.argument && null;
 }
 
killedBy: manual algebra detection accepts all supported brand helper prefixes
statusReason: expected undefined to be 'asUserId' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:548:10
   targetType: string,
 ): boolean {
   const name = surface.displayName;
-  return name !== null &&
-    (name === targetType || BRAND_HELPER_RE.test(name));
+  return true;
 }
 
killedBy: manual-brand valid const project = (value: string): UserId => value as UserId;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface project — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:548:10
   targetType: string,
 ): boolean {
   const name = surface.displayName;
-  return name !== null &&
-    (name === targetType || BRAND_HELPER_RE.test(name));
+  return false;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -2141934364, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:549:6
 ): boolean {
   const name = surface.displayName;
   return name !== null &&
-    (name === targetType || BRAND_HELPER_RE.test(name));
+    (name === targetType && BRAND_HELPER_RE.test(name));
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-brand fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1061362444, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/manual-algebra-detection.ts:549:6
 ): boolean {
   const name = surface.displayName;
   return name !== null &&
-    (name === targetType || BRAND_HELPER_RE.test(name));
+    (name !== targetType || BRAND_HELPER_RE.test(name));
 }
 
killedBy: manual-brand valid const project = (value: string): UserId => value as UserId;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface project — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',

[NoCoverage] StringLiteral
src/utils/manual-algebra-detection.ts:561:41
     kind,
     messageId,
     node: surface.node,
-    displayName: surface.displayName ?? "(anonymous)",
+    displayName: surface.displayName ?? "",
   };
 }

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:567:41
 
 function isTransportDataSurface(surface: Surface): boolean {
   const name = surface.displayName;
-  if (isTransportLikeName(name)) return true;
+  if (isTransportLikeName(name)) return false;
   if (surface.kind === "function") return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
killedBy: manual-brand valid type UserIdPayload = string & { readonly __brand: "UserIdPayload" };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface UserIdPayload — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:567:7
 
 function isTransportDataSurface(surface: Surface): boolean {
   const name = surface.displayName;
-  if (isTransportLikeName(name)) return true;
+  if (false) return true;
   if (surface.kind === "function") return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
killedBy: manual-brand valid type UserIdPayload = string & { readonly __brand: "UserIdPayload" };
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface UserIdPayload — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 1,
    nodeType: 'TSTypeAliasDeclaration',

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:568:7
 function isTransportDataSurface(surface: Surface): boolean {
   const name = surface.displayName;
   if (isTransportLikeName(name)) return true;
-  if (surface.kind === "function") return false;
+  if (false) return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
   return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
killedBy: property: manual algebra family Property 8: manual-option still fires on helper functions under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1160963684, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","a0"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:568:7
 function isTransportDataSurface(surface: Surface): boolean {
   const name = surface.displayName;
   if (isTransportLikeName(name)) return true;
-  if (surface.kind === "function") return false;
+  if (true) return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
   return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:569:7
   const name = surface.displayName;
   if (isTransportLikeName(name)) return true;
   if (surface.kind === "function") return false;
-  if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
+  if (true) return false;
   return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
 }
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:569:7
   const name = surface.displayName;
   if (isTransportLikeName(name)) return true;
   if (surface.kind === "function") return false;
-  if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
+  if (false) return false;
   return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
 }
killedBy: manual algebra detection still flags result-like surfaces when error-like literals are not on `_tag`
statusReason: expected undefined to be 'Outcome' // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:570:10
   if (isTransportLikeName(name)) return true;
   if (surface.kind === "function") return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
-  return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
+  return true;
 }
 
killedBy: manual algebra detection does not treat discriminant unions with helper keys as transport/data shapes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:570:10
   if (isTransportLikeName(name)) return true;
   if (surface.kind === "function") return false;
   if (looksResultLikeName(name) || looksOptionLikeName(name)) return false;
-  return hasDiscriminantStyle(surface) && !hasKeys(surface, TRANSPORT_HELPERS);
+  return false;
 }
 
killedBy: manual algebra detection treats neutral discriminant unions as transport/data shapes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:574:10
 }
 
 function isTaggedErrorSurface(surface: Surface): boolean {
-  return surface.hasTagKey &&
-    (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+  return true;
 }
 
killedBy: manual algebra detection requires a real tag key before treating a surface as a tagged-error collision
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:574:10
 }
 
 function isTaggedErrorSurface(surface: Surface): boolean {
-  return surface.hasTagKey &&
-    (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+  return surface.hasTagKey || looksErrorLike(surface.displayName) || [...surface.stringLiterals].some(value => looksErrorLike(value));
 }
 
killedBy: manual algebra detection requires a real tag key before treating a surface as a tagged-error collision
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:575:6
 
 function isTaggedErrorSurface(surface: Surface): boolean {
   return surface.hasTagKey &&
-    (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+    (looksErrorLike(surface.displayName) && [...surface.stringLiterals].some(value => looksErrorLike(value)));
 }
 
killedBy: manual algebra detection exempts tagged error names from option detection
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:575:6
 
 function isTaggedErrorSurface(surface: Surface): boolean {
   return surface.hasTagKey &&
-    (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+    (true);
 }
 
killedBy: manual algebra detection recognizes the extended result helper names
statusReason: expected undefined to be 'left' // Object.is equality

[Killed] MethodExpression
src/utils/manual-algebra-detection.ts:576:7
 function isTaggedErrorSurface(surface: Surface): boolean {
   return surface.hasTagKey &&
     (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+      [...surface.stringLiterals].every(value => looksErrorLike(value)));
 }
 
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/utils/manual-algebra-detection.ts:576:40
 function isTaggedErrorSurface(surface: Surface): boolean {
   return surface.hasTagKey &&
     (looksErrorLike(surface.displayName) ||
-      [...surface.stringLiterals].some((value) => looksErrorLike(value)));
+      [...surface.stringLiterals].some(() => undefined));
 }
 
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/utils/manual-algebra-detection.ts:580:10
 }
 
 function isExcludedSurface(surface: Surface): boolean {
-  return isTransportDataSurface(surface) || isTaggedErrorSurface(surface);
+  return isTransportDataSurface(surface) && isTaggedErrorSurface(surface);
 }
 
killedBy: manual algebra detection exempts transport-shaped brand aliases that would otherwise look manual
statusReason: expected { kind: 'brand', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:580:10
 }
 
 function isExcludedSurface(surface: Surface): boolean {
-  return isTransportDataSurface(surface) || isTaggedErrorSurface(surface);
+  return true;
 }
 
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1968380516, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:585:29
 
 export function isTransportDataShape(node: TSESTree.Node): boolean {
   const surface = surfaceFromNode(node);
-  return surface === null ? false : isTransportDataSurface(surface);
+  return surface === null ? true : isTransportDataSurface(surface);
 }
 
killedBy: manual algebra detection returns false for nodes that do not form a supported surface
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:590:29
 
 export function isTaggedErrorCollision(node: TSESTree.Node): boolean {
   const surface = surfaceFromNode(node);
-  return surface === null ? false : isTaggedErrorSurface(surface);
+  return surface === null ? true : isTaggedErrorSurface(surface);
 }
 
killedBy: manual algebra detection returns false for nodes that do not form a supported surface
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:598:7
 ): ManualAlgebraMatch | null {
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
-  if (isExcludedSurface(surface)) return null;
+  if (false) return null;
   if (!hasResultFunctionEvidence(surface)) return null;
   if (!hasResultReusableSignal(surface)) return null;
killedBy: manual algebra detection treats mixed tagged error literals as tagged-error collisions
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:599:7
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
-  if (!hasResultFunctionEvidence(surface)) return null;
+  if (false) return null;
   if (!hasResultReusableSignal(surface)) return null;
   return match(surface, "result", "manualResult");
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1374800718, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:599:7
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
-  if (!hasResultFunctionEvidence(surface)) return null;
+  if (hasResultFunctionEvidence(surface)) return null;
   if (!hasResultReusableSignal(surface)) return null;
   return match(surface, "result", "manualResult");
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 1430510855, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:600:7
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
   if (!hasResultFunctionEvidence(surface)) return null;
-  if (!hasResultReusableSignal(surface)) return null;
+  if (false) return null;
   return match(surface, "result", "manualResult");
 }
killedBy: manual algebra detection requires reusable result helper names before flagging a function helper
statusReason: expected { kind: 'result', …(3) } to be null

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:600:7
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
   if (!hasResultFunctionEvidence(surface)) return null;
-  if (!hasResultReusableSignal(surface)) return null;
+  if (hasResultReusableSignal(surface)) return null;
   return match(surface, "result", "manualResult");
 }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1262965850, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:610:7
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
-  if (!hasOptionFunctionEvidence(surface)) return null;
+  if (false) return null;
   if (!hasOptionReusableSignal(surface)) return null;
   return match(surface, "option", "manualOption");
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: 982966440, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:610:7
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
-  if (!hasOptionFunctionEvidence(surface)) return null;
+  if (hasOptionFunctionEvidence(surface)) return null;
   if (!hasOptionReusableSignal(surface)) return null;
   return match(surface, "option", "manualOption");
killedBy: property: rule correctness Property 2: agent-code-guard/manual-result fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1585437373, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:611:7
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
   if (!hasOptionFunctionEvidence(surface)) return null;
-  if (!hasOptionReusableSignal(surface)) return null;
+  if (false) return null;
   return match(surface, "option", "manualOption");
 }
killedBy: manual algebra detection keeps neutral option branch-pair surfaces clean
statusReason: expected { kind: 'option', …(3) } to be null

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:611:7
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
   if (!hasOptionFunctionEvidence(surface)) return null;
-  if (!hasOptionReusableSignal(surface)) return null;
+  if (hasOptionReusableSignal(surface)) return null;
   return match(surface, "option", "manualOption");
 }
killedBy: property: rule correctness Property 2: agent-code-guard/manual-option fires on its anti-pattern across mutations
statusReason: Property failed after 1 tests
{ seed: -1696914093, path: "0:0:0", endOnFailure: true }
Counterexample: ["","a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/manual-algebra-detection.ts:621:32
   const surface = surfaceFromNode(node);
   if (surface === null) return null;
   if (isExcludedSurface(surface)) return null;
-  if (hasBrandMarker(surface)) {
-    return match(surface, "brand", "manualBrand");
-  }
+  if (hasBrandMarker(surface)) {}
 
   const targetType = getBrandHelperCastName(node);
killedBy: manual-brand valid // eslint-disable-next-line @rule-tester/manual-brand -- suppression test
type UserId = string & { readonly __brand: 'UserId' };
statusReason: Should have no errors but had 1: [
  {
    ruleId: null,
    message: "Unused eslint-disable directive (no problems were reported from '@rule-tester/manual-brand').",
    line: 1,
    column: 1,
    severity: 1,
    nodeType: null,

[Killed] BooleanLiteral
src/utils/manual-algebra-detection.ts:627:7
 
   const targetType = getBrandHelperCastName(node);
   if (targetType === null) return null;
-  if (!matchesBrandHelperName(surface, targetType)) return null;
+  if (matchesBrandHelperName(surface, targetType)) return null;
   return match(surface, "brand", "manualBrand");
 }
killedBy: property: manual algebra family Property 6: manual-brand still fires under rename and whitespace mutation
statusReason: Property failed after 1 tests
{ seed: -1765587393, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["","aA"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utils/manual-algebra-detection.ts:627:7
 
   const targetType = getBrandHelperCastName(node);
   if (targetType === null) return null;
-  if (!matchesBrandHelperName(surface, targetType)) return null;
+  if (false) return null;
   return match(surface, "brand", "manualBrand");
 }
killedBy: manual-brand valid const project = (value: string): UserId => value as UserId;
statusReason: Should have no errors but had 1: [
  {
    ruleId: '@rule-tester/manual-brand',
    severity: 2,
    message: 'Manual brand surface project — prefer Effect Brand.nominal or an endorsed helper instead of hand-rolling branded aliases.',
    line: 1,
    column: 7,
    nodeType: 'VariableDeclarator',
