[Killed] ArrayDeclaration
src/topology/check-public-type-leaks.ts:42:12
     const packageName = packageNameFromSpecifier(statement.moduleSpecifier.text);
     if (packageName === null || packageAllowedInPublicTypes(packageName, options)) return [];
 
-    return [
-      {
-        ruleId: "no-public-vendor-type-leak",
-        file: sourceFile.fileName,
-        severity: publicTypeLeakSeverity(packageName, null),
-        message:
-          `Public API re-exports "${packageName}" types from "${statement.moduleSpecifier.text}". ` +
-          "Wrap vendor types behind domain-owned public types, or list the package in " +
-          "publicTypePackages when it is intentionally part of the contract.",
-      },
-      ...infraTypeLeakDiagnostic(sourceFile.fileName, packageName, options),
-    ];
+    return [];
   });
 }
killedBy: topology helper units Property: external public re-export diagnostics follow ownership and allowlist policy
statusReason: Property failed after 1 tests
{ seed: 505305240, path: "0:0", endOnFailure: true }
Counterexample: ["a",false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:49:11
         severity: publicTypeLeakSeverity(packageName, null),
         message:
           `Public API re-exports "${packageName}" types from "${statement.moduleSpecifier.text}". ` +
-          "Wrap vendor types behind domain-owned public types, or list the package in " +
+          "" +
           "publicTypePackages when it is intentionally part of the contract.",
       },
killedBy: topology helper units Property: external public re-export diagnostics follow ownership and allowlist policy
statusReason: Property failed after 1 tests
{ seed: -423871224, path: "0:0:0", endOnFailure: true }
Counterexample: ["a",false]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:50:11
         message:
           `Public API re-exports "${packageName}" types from "${statement.moduleSpecifier.text}". ` +
           "Wrap vendor types behind domain-owned public types, or list the package in " +
-          "publicTypePackages when it is intentionally part of the contract.",
+          "",
       },
       ...infraTypeLeakDiagnostic(sourceFile.fileName, packageName, options),
killedBy: topology helper units Property: external public re-export diagnostics follow ownership and allowlist policy
statusReason: Property failed after 2 tests
{ seed: 509358695, path: "1:0:0", endOnFailure: true }
Counterexample: ["a",false]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:58:7
 }
 
 export function packageNameFromSpecifier(specifier: string): string | null {
-  if (specifier.startsWith(".")) return null;
+  if (specifier.endsWith(".")) return null;
   if (specifier.startsWith("node:")) return "node";
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '.' to be null

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:58:7
 }
 
 export function packageNameFromSpecifier(specifier: string): string | null {
-  if (specifier.startsWith(".")) return null;
+  if (false) return null;
   if (specifier.startsWith("node:")) return "node";
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '.' to be null

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:59:7
 
 export function packageNameFromSpecifier(specifier: string): string | null {
   if (specifier.startsWith(".")) return null;
-  if (specifier.startsWith("node:")) return "node";
+  if (true) return "node";
 
   const [firstSegment, secondSegment] = specifier.split("/");
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'node' to be '@scope/pkg' // Object.is equality

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:59:7
 
 export function packageNameFromSpecifier(specifier: string): string | null {
   if (specifier.startsWith(".")) return null;
-  if (specifier.startsWith("node:")) return "node";
+  if (specifier.endsWith("node:")) return "node";
 
   const [firstSegment, secondSegment] = specifier.split("/");
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'node:stream' to be 'node' // Object.is equality

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:61:57
   if (specifier.startsWith(".")) return null;
   if (specifier.startsWith("node:")) return "node";
 
-  const [firstSegment, secondSegment] = specifier.split("/");
+  const [firstSegment, secondSegment] = specifier.split("");
   if (!firstSegment) return null;
   if (firstSegment.startsWith("@")) {
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@/s' to be '@scope/pkg' // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:62:7
   if (specifier.startsWith("node:")) return "node";
 
   const [firstSegment, secondSegment] = specifier.split("/");
-  if (!firstSegment) return null;
+  if (true) return null;
   if (firstSegment.startsWith("@")) {
     return secondSegment ? `${firstSegment}/${secondSegment}` : firstSegment;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be '@scope/pkg' // Object.is equality

[Killed] BooleanLiteral
src/topology/check-public-type-leaks.ts:62:7
   if (specifier.startsWith("node:")) return "node";
 
   const [firstSegment, secondSegment] = specifier.split("/");
-  if (!firstSegment) return null;
+  if (firstSegment) return null;
   if (firstSegment.startsWith("@")) {
     return secondSegment ? `${firstSegment}/${secondSegment}` : firstSegment;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be '@scope/pkg' // Object.is equality

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:63:37
 
   const [firstSegment, secondSegment] = specifier.split("/");
   if (!firstSegment) return null;
-  if (firstSegment.startsWith("@")) {
-    return secondSegment ? `${firstSegment}/${secondSegment}` : firstSegment;
-  }
+  if (firstSegment.startsWith("@")) {}
 
   return firstSegment;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@scope' to be '@scope/pkg' // Object.is equality

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:63:7
 
   const [firstSegment, secondSegment] = specifier.split("/");
   if (!firstSegment) return null;
-  if (firstSegment.startsWith("@")) {
+  if (firstSegment.endsWith("@")) {
     return secondSegment ? `${firstSegment}/${secondSegment}` : firstSegment;
   }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@scope' to be '@scope/pkg' // Object.is equality

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:71:42
 }
 
 export function packageNameFromFileName(fileName: string): string | null {
-  const normalized = fileName.replaceAll("\\", "/");
+  const normalized = fileName.replaceAll("", "/");
   if (/\/node_modules\/typescript\/lib\/lib\..+\.d\.ts$/.test(normalized)) return null;
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be 'react' // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:72:7
 
 export function packageNameFromFileName(fileName: string): string | null {
   const normalized = fileName.replaceAll("\\", "/");
-  if (/\/node_modules\/typescript\/lib\/lib\..+\.d\.ts$/.test(normalized)) return null;
+  if (false) return null;
 
   const marker = "/node_modules/";
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'typescript' to be null

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:74:18
   const normalized = fileName.replaceAll("\\", "/");
   if (/\/node_modules\/typescript\/lib\/lib\..+\.d\.ts$/.test(normalized)) return null;
 
-  const marker = "/node_modules/";
+  const marker = "";
   const markerIndex = normalized.lastIndexOf(marker);
   if (markerIndex === -1) {
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be 'react' // Object.is equality

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:76:27
 
   const marker = "/node_modules/";
   const markerIndex = normalized.lastIndexOf(marker);
-  if (markerIndex === -1) {
-    return /\/(__generated__|generated)\//.test(normalized) ? "generated-vendor" : null;
-  }
+  if (markerIndex === -1) {}
 
   const afterNodeModules = normalized.slice(markerIndex + marker.length);
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'erated' to be 'generated-vendor' // Object.is equality

[Killed] EqualityOperator
src/topology/check-public-type-leaks.ts:76:7
 
   const marker = "/node_modules/";
   const markerIndex = normalized.lastIndexOf(marker);
-  if (markerIndex === -1) {
+  if (markerIndex !== -1) {
     return /\/(__generated__|generated)\//.test(normalized) ? "generated-vendor" : null;
   }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be 'react' // Object.is equality

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:77:63
   const marker = "/node_modules/";
   const markerIndex = normalized.lastIndexOf(marker);
   if (markerIndex === -1) {
-    return /\/(__generated__|generated)\//.test(normalized) ? "generated-vendor" : null;
+    return /\/(__generated__|generated)\//.test(normalized) ? "" : null;
   }
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '' to be 'generated-vendor' // Object.is equality

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:80:28
     return /\/(__generated__|generated)\//.test(normalized) ? "generated-vendor" : null;
   }
 
-  const afterNodeModules = normalized.slice(markerIndex + marker.length);
+  const afterNodeModules = normalized;
   const rawPackageName = packageNameFromNodeModulesPath(afterNodeModules);
   return rawPackageName ? normalizeTypePackageName(rawPackageName) : null;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be 'react' // Object.is equality

[Killed] ArithmeticOperator
src/topology/check-public-type-leaks.ts:80:45
     return /\/(__generated__|generated)\//.test(normalized) ? "generated-vendor" : null;
   }
 
-  const afterNodeModules = normalized.slice(markerIndex + marker.length);
+  const afterNodeModules = normalized.slice(markerIndex - marker.length);
   const rawPackageName = packageNameFromNodeModulesPath(afterNodeModules);
   return rawPackageName ? normalizeTypePackageName(rawPackageName) : null;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'ndex.d.ts' to be 'react' // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:86:7
 }
 
 export function normalizeTypePackageName(packageName: string): string {
-  if (!packageName.startsWith("@types/")) return packageName;
+  if (false) return packageName;
 
   const withoutPrefix = packageName.slice("@types/".length);
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '' to be 'openai' // Object.is equality

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:86:8
 }
 
 export function normalizeTypePackageName(packageName: string): string {
-  if (!packageName.startsWith("@types/")) return packageName;
+  if (!packageName.endsWith("@types/")) return packageName;
 
   const withoutPrefix = packageName.slice("@types/".length);
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@types/react' to be 'react' // Object.is equality

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:88:25
 export function normalizeTypePackageName(packageName: string): string {
   if (!packageName.startsWith("@types/")) return packageName;
 
-  const withoutPrefix = packageName.slice("@types/".length);
+  const withoutPrefix = packageName;
   const scopedMatch = /^([^_]+)__([^_]+)$/.exec(withoutPrefix);
   return scopedMatch ? `@${scopedMatch[1]}/${scopedMatch[2]}` : withoutPrefix;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@types/react' to be 'react' // Object.is equality

[Killed] Regex
src/topology/check-public-type-leaks.ts:89:23
   if (!packageName.startsWith("@types/")) return packageName;
 
   const withoutPrefix = packageName.slice("@types/".length);
-  const scopedMatch = /^([^_]+)__([^_]+)$/.exec(withoutPrefix);
+  const scopedMatch = /^([_]+)__([^_]+)$/.exec(withoutPrefix);
   return scopedMatch ? `@${scopedMatch[1]}/${scopedMatch[2]}` : withoutPrefix;
 }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'aws__lambda' to be '@aws/lambda' // Object.is equality

[Killed] Regex
src/topology/check-public-type-leaks.ts:89:23
   if (!packageName.startsWith("@types/")) return packageName;
 
   const withoutPrefix = packageName.slice("@types/".length);
-  const scopedMatch = /^([^_]+)__([^_]+)$/.exec(withoutPrefix);
+  const scopedMatch = /^([^_]+)__([^_])$/.exec(withoutPrefix);
   return scopedMatch ? `@${scopedMatch[1]}/${scopedMatch[2]}` : withoutPrefix;
 }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected 'aws__lambda' to be '@aws/lambda' // Object.is equality

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:90:24
 
   const withoutPrefix = packageName.slice("@types/".length);
   const scopedMatch = /^([^_]+)__([^_]+)$/.exec(withoutPrefix);
-  return scopedMatch ? `@${scopedMatch[1]}/${scopedMatch[2]}` : withoutPrefix;
+  return scopedMatch ? `` : withoutPrefix;
 }
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '' to be '@aws/lambda' // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:97:7
   packageName: string,
   options: Pick<NormalizedTopologyOptions, "packageRuntime" | "publicTypePackages">,
 ): boolean {
-  if (options.publicTypePackages.includes(packageName)) return true;
+  if (false) return true;
   if (packageName !== "node") return false;
   return options.packageRuntime === "node";
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:97:7
   packageName: string,
   options: Pick<NormalizedTopologyOptions, "packageRuntime" | "publicTypePackages">,
 ): boolean {
-  if (options.publicTypePackages.includes(packageName)) return true;
+  if (true) return true;
   if (packageName !== "node") return false;
   return options.packageRuntime === "node";
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/topology/check-public-type-leaks.ts:98:38
   options: Pick<NormalizedTopologyOptions, "packageRuntime" | "publicTypePackages">,
 ): boolean {
   if (options.publicTypePackages.includes(packageName)) return true;
-  if (packageName !== "node") return false;
+  if (packageName !== "node") return true;
   return options.packageRuntime === "node";
 }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:98:7
   options: Pick<NormalizedTopologyOptions, "packageRuntime" | "publicTypePackages">,
 ): boolean {
   if (options.publicTypePackages.includes(packageName)) return true;
-  if (packageName !== "node") return false;
+  if (false) return false;
   return options.packageRuntime === "node";
 }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:99:10
 ): boolean {
   if (options.publicTypePackages.includes(packageName)) return true;
   if (packageName !== "node") return false;
-  return options.packageRuntime === "node";
+  return true;
 }
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/topology/check-public-type-leaks.ts:99:10
 ): boolean {
   if (options.publicTypePackages.includes(packageName)) return true;
   if (packageName !== "node") return false;
-  return options.packageRuntime === "node";
+  return options.packageRuntime !== "node";
 }
 
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/topology/check-public-type-leaks.ts:112:25
   if (!moduleSymbol) return [];
 
   return checker.getExportsOfModule(moduleSymbol).flatMap((exportedSymbol) => {
-    const declaration = exportedSymbol.valueDeclaration ?? exportedSymbol.declarations?.[0];
+    const declaration = exportedSymbol.valueDeclaration && exportedSymbol.declarations?.[0];
     if (!declaration) return [];
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1251119891, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:129:11
         file: sourceFile.fileName,
         severity: publicTypeLeakSeverity(packageName, packageJson),
         message:
-          `Public API export "${exportedSymbol.getName()}" references "${packageName}" ` +
+          `` +
           "types. Wrap vendor types behind domain-owned public types, or list the " +
           "package in publicTypePackages when it is intentionally part of the contract.",
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -1166630078, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:130:11
         severity: publicTypeLeakSeverity(packageName, packageJson),
         message:
           `Public API export "${exportedSymbol.getName()}" references "${packageName}" ` +
-          "types. Wrap vendor types behind domain-owned public types, or list the " +
+          "" +
           "package in publicTypePackages when it is intentionally part of the contract.",
       },
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -1754551023, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:142:7
   packageName: string,
   packageJson: PackageJson | null,
 ): TopologySeverity {
-  if (packageName === "node") return "warn";
+  if (false) return "warn";
   return packageJson?.peerDependencies.has(packageName) ? "warn" : "error";
 }
killedBy: topology helper units reports infrastructure and Node public re-export policy separately
statusReason: expected [ { …(4) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/topology/check-public-type-leaks.ts:142:7
   packageName: string,
   packageJson: PackageJson | null,
 ): TopologySeverity {
-  if (packageName === "node") return "warn";
+  if (packageName !== "node") return "warn";
   return packageJson?.peerDependencies.has(packageName) ? "warn" : "error";
 }
killedBy: topology helper units Property: external public re-export diagnostics follow ownership and allowlist policy
statusReason: Property failed after 1 tests
{ seed: 1192774693, path: "0:0:0", endOnFailure: true }
Counterexample: ["a",false]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/topology/check-public-type-leaks.ts:151:7
   packageName: string,
   options: NormalizedTopologyOptions,
 ): readonly TopologyDiagnostic[] {
-  if (!options.infrastructureTypePackages.includes(packageName)) return [];
+  if (options.infrastructureTypePackages.includes(packageName)) return [];
 
   return [
killedBy: topology helper units Property: external public re-export diagnostics follow ownership and allowlist policy
statusReason: Property failed after 1 tests
{ seed: -1888344517, path: "0:0", endOnFailure: true }
Counterexample: ["a",false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:151:7
   packageName: string,
   options: NormalizedTopologyOptions,
 ): readonly TopologyDiagnostic[] {
-  if (!options.infrastructureTypePackages.includes(packageName)) return [];
+  if (true) return [];
 
   return [
killedBy: topology helper units reports infrastructure and Node public re-export policy separately
statusReason: expected [ { …(4) } ] to deeply equal [ ObjectContaining{…}, …(1) ]

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:159:9
       file: fileName,
       severity: "error",
       message:
-        `Public API references infrastructure package "${packageName}". Database, ` +
+        `` +
         "logging, transport, and SDK implementation choices should be hidden behind " +
         "package-owned ports or DTOs.",
killedBy: topology helper units reports infrastructure and Node public re-export policy separately
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ ObjectContaining{…}, …(1) ]

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:171:7
   symbol: ts.Symbol,
   declaration: ts.Declaration,
 ): ts.Type {
-  if (ts.isInterfaceDeclaration(declaration) || ts.isTypeAliasDeclaration(declaration)) {
+  if (true) {
     return checker.getDeclaredTypeOfSymbol(symbol);
   }
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 443210846, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:171:89
   symbol: ts.Symbol,
   declaration: ts.Declaration,
 ): ts.Type {
-  if (ts.isInterfaceDeclaration(declaration) || ts.isTypeAliasDeclaration(declaration)) {
-    return checker.getDeclaredTypeOfSymbol(symbol);
-  }
+  if (ts.isInterfaceDeclaration(declaration) || ts.isTypeAliasDeclaration(declaration)) {}
 
   return checker.getTypeOfSymbolAtLocation(symbol, declaration);
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -410893756, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:187:64
   const packages = new Set<string>();
   const seenTypes = new Set<ts.Type>();
 
-  const visit = (currentType: ts.Type, depth: number): void => {
-    if (depth > MAX_TYPE_DEPTH || seenTypes.has(currentType)) return;
-    seenTypes.add(currentType);
-
-    const owningPackage = packageNameFromType(currentType);
-    if (owningPackage) {
-      if (!packageAllowedInPublicTypes(owningPackage, options)) packages.add(owningPackage);
-      visitTypeArguments(checker, currentType, depth, visit);
-      return;
-    }
-
-    visitCompositeType(checker, currentType, location, depth, visit);
-  };
+  const visit = (currentType: ts.Type, depth: number): void => {};
 
   visit(type, 0);
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -608258478, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:188:9
   const seenTypes = new Set<ts.Type>();
 
   const visit = (currentType: ts.Type, depth: number): void => {
-    if (depth > MAX_TYPE_DEPTH || seenTypes.has(currentType)) return;
+    if (false) return;
     seenTypes.add(currentType);
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -737901739, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:188:9
   const seenTypes = new Set<ts.Type>();
 
   const visit = (currentType: ts.Type, depth: number): void => {
-    if (depth > MAX_TYPE_DEPTH || seenTypes.has(currentType)) return;
+    if (false || seenTypes.has(currentType)) return;
     seenTypes.add(currentType);
 
killedBy: topology helper units limits public signature traversal depth while preserving exact-boundary leaks
statusReason: expected [ 'PublicTooDeepProperty', …(5) ] to deeply equal []

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:192:24
     seenTypes.add(currentType);
 
     const owningPackage = packageNameFromType(currentType);
-    if (owningPackage) {
-      if (!packageAllowedInPublicTypes(owningPackage, options)) packages.add(owningPackage);
-      visitTypeArguments(checker, currentType, depth, visit);
-      return;
-    }
+    if (owningPackage) {}
 
     visitCompositeType(checker, currentType, location, depth, visit);
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -1000604712, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:193:11
 
     const owningPackage = packageNameFromType(currentType);
     if (owningPackage) {
-      if (!packageAllowedInPublicTypes(owningPackage, options)) packages.add(owningPackage);
+      if (true) packages.add(owningPackage);
       visitTypeArguments(checker, currentType, depth, visit);
       return;
killedBy: topology helper units warns for peer dependency public types while dependencies and devDependencies are errors
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] BooleanLiteral
src/topology/check-public-type-leaks.ts:193:11
 
     const owningPackage = packageNameFromType(currentType);
     if (owningPackage) {
-      if (!packageAllowedInPublicTypes(owningPackage, options)) packages.add(owningPackage);
+      if (packageAllowedInPublicTypes(owningPackage, options)) packages.add(owningPackage);
       visitTypeArguments(checker, currentType, depth, visit);
       return;
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -713946332, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
