[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:211:9
   location: ts.Node,
   depth: number,
   visit: (type: ts.Type, depth: number) => void,
-): void {
-  if (type.isUnionOrIntersection()) {
-    for (const member of type.types) visit(member, depth + 1);
-  }
-
-  visitTypeArguments(checker, type, depth, visit);
-
-  for (const signature of [
-    ...type.getCallSignatures(),
-    ...type.getConstructSignatures(),
-  ]) {
-    visit(signature.getReturnType(), depth + 1);
-    for (const parameter of signature.getParameters()) {
-      const declaration = parameter.valueDeclaration ?? parameter.declarations?.[0] ?? location;
-      visit(checker.getTypeOfSymbolAtLocation(parameter, declaration), depth + 1);
-    }
-  }
-
-  for (const property of type.getProperties()) {
-    const declaration = property.declarations?.[0];
-    if (declaration) visit(checker.getTypeOfSymbolAtLocation(property, declaration), depth + 1);
-  }
-}
+): void {}
 
 function visitTypeArguments(
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -207924982, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:212:37
   depth: number,
   visit: (type: ts.Type, depth: number) => void,
 ): void {
-  if (type.isUnionOrIntersection()) {
-    for (const member of type.types) visit(member, depth + 1);
-  }
+  if (type.isUnionOrIntersection()) {}
 
   visitTypeArguments(checker, type, depth, visit);
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1237736215, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/topology/check-public-type-leaks.ts:213:52
   visit: (type: ts.Type, depth: number) => void,
 ): void {
   if (type.isUnionOrIntersection()) {
-    for (const member of type.types) visit(member, depth + 1);
+    for (const member of type.types) visit(member, depth - 1);
   }
 
killedBy: topology helper units limits public signature traversal depth while preserving exact-boundary leaks
statusReason: expected [ 'PublicTooDeepUnion' ] to deeply equal []

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:221:6
   for (const signature of [
     ...type.getCallSignatures(),
     ...type.getConstructSignatures(),
-  ]) {
-    visit(signature.getReturnType(), depth + 1);
-    for (const parameter of signature.getParameters()) {
-      const declaration = parameter.valueDeclaration ?? parameter.declarations?.[0] ?? location;
-      visit(checker.getTypeOfSymbolAtLocation(parameter, declaration), depth + 1);
-    }
-  }
+  ]) {}
 
   for (const property of type.getProperties()) {
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1435173338, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/topology/check-public-type-leaks.ts:222:38
     ...type.getCallSignatures(),
     ...type.getConstructSignatures(),
   ]) {
-    visit(signature.getReturnType(), depth + 1);
+    visit(signature.getReturnType(), depth - 1);
     for (const parameter of signature.getParameters()) {
       const declaration = parameter.valueDeclaration ?? parameter.declarations?.[0] ?? location;
killedBy: topology helper units limits public signature traversal depth while preserving exact-boundary leaks
statusReason: expected [ 'PublicTooDeepReturn' ] to deeply equal []

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:223:56
     ...type.getConstructSignatures(),
   ]) {
     visit(signature.getReturnType(), depth + 1);
-    for (const parameter of signature.getParameters()) {
-      const declaration = parameter.valueDeclaration ?? parameter.declarations?.[0] ?? location;
-      visit(checker.getTypeOfSymbolAtLocation(parameter, declaration), depth + 1);
-    }
+    for (const parameter of signature.getParameters()) {}
   }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1036020927, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/topology/check-public-type-leaks.ts:225:72
     visit(signature.getReturnType(), depth + 1);
     for (const parameter of signature.getParameters()) {
       const declaration = parameter.valueDeclaration ?? parameter.declarations?.[0] ?? location;
-      visit(checker.getTypeOfSymbolAtLocation(parameter, declaration), depth + 1);
+      visit(checker.getTypeOfSymbolAtLocation(parameter, declaration), depth - 1);
     }
   }
killedBy: topology helper units limits public signature traversal depth while preserving exact-boundary leaks
statusReason: expected [ 'PublicTooDeepParam' ] to deeply equal []

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:229:48
     }
   }
 
-  for (const property of type.getProperties()) {
-    const declaration = property.declarations?.[0];
-    if (declaration) visit(checker.getTypeOfSymbolAtLocation(property, declaration), depth + 1);
-  }
+  for (const property of type.getProperties()) {}
 }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 914756745, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/topology/check-public-type-leaks.ts:231:86
 
   for (const property of type.getProperties()) {
     const declaration = property.declarations?.[0];
-    if (declaration) visit(checker.getTypeOfSymbolAtLocation(property, declaration), depth + 1);
+    if (declaration) visit(checker.getTypeOfSymbolAtLocation(property, declaration), depth - 1);
   }
 }
killedBy: topology helper units limits public signature traversal depth while preserving exact-boundary leaks
statusReason: expected [ 'PublicTooDeepProperty', …(5) ] to deeply equal []

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:240:9
   type: ts.Type,
   depth: number,
   visit: (type: ts.Type, depth: number) => void,
-): void {
-  for (const argument of checker.getTypeArguments(type as ts.TypeReference)) {
-    visit(argument, depth + 1);
-  }
-}
+): void {}
 
 function packageNameFromType(type: ts.Type): string | null {
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -309840818, path: "0", endOnFailure: true }
Counterexample: ["j"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:241:78
   depth: number,
   visit: (type: ts.Type, depth: number) => void,
 ): void {
-  for (const argument of checker.getTypeArguments(type as ts.TypeReference)) {
-    visit(argument, depth + 1);
-  }
+  for (const argument of checker.getTypeArguments(type as ts.TypeReference)) {}
 }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1785639725, path: "0:0:1:0", endOnFailure: true }
Counterexample: ["a-"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/topology/check-public-type-leaks.ts:242:21
   visit: (type: ts.Type, depth: number) => void,
 ): void {
   for (const argument of checker.getTypeArguments(type as ts.TypeReference)) {
-    visit(argument, depth + 1);
+    visit(argument, depth - 1);
   }
 }

[Killed] LogicalOperator
src/topology/check-public-type-leaks.ts:248:10
 
 function packageNameFromType(type: ts.Type): string | null {
   const aliasPackage = packageNameFromSymbol(type.aliasSymbol);
-  return aliasPackage ?? packageNameFromSymbol(type.symbol);
+  return aliasPackage && packageNameFromSymbol(type.symbol);
 }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -511838414, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/topology/check-public-type-leaks.ts:253:43
 
 function packageNameFromSymbol(symbol: ts.Symbol | undefined): string | null {
   const declarations = symbol?.getDeclarations() ?? [];
-  for (const declaration of declarations) {
-    const packageName = packageNameFromFileName(declaration.getSourceFile().fileName);
-    if (packageName !== null) return packageName;
-  }
+  for (const declaration of declarations) {}
 
   return null;
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: 1803793595, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/topology/check-public-type-leaks.ts:255:9
   const declarations = symbol?.getDeclarations() ?? [];
   for (const declaration of declarations) {
     const packageName = packageNameFromFileName(declaration.getSourceFile().fileName);
-    if (packageName !== null) return packageName;
+    if (packageName === null) return packageName;
   }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -991833214, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:255:9
   const declarations = symbol?.getDeclarations() ?? [];
   for (const declaration of declarations) {
     const packageName = packageNameFromFileName(declaration.getSourceFile().fileName);
-    if (packageName !== null) return packageName;
+    if (false) return packageName;
   }
 
killedBy: topology helper units Property: public signature diagnostics inspect properties, unions, generics, calls, and constructors
statusReason: Property failed after 1 tests
{ seed: -2055719103, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/topology/check-public-type-leaks.ts:263:10
 
 function packageNameFromNodeModulesPath(afterNodeModules: string): string | null {
   const [firstSegment, secondSegment] = afterNodeModules.split("/");
-  return firstSegment.startsWith("@") && secondSegment
+  return firstSegment.endsWith("@") && secondSegment
     ? `${firstSegment}/${secondSegment}`
     : firstSegment;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@types' to be 'react' // Object.is equality

[Killed] ConditionalExpression
src/topology/check-public-type-leaks.ts:263:10
 
 function packageNameFromNodeModulesPath(afterNodeModules: string): string | null {
   const [firstSegment, secondSegment] = afterNodeModules.split("/");
-  return firstSegment.startsWith("@") && secondSegment
+  return false
     ? `${firstSegment}/${secondSegment}`
     : firstSegment;
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected '@types' to be 'react' // Object.is equality

[Killed] StringLiteral
src/topology/check-public-type-leaks.ts:264:7
 function packageNameFromNodeModulesPath(afterNodeModules: string): string | null {
   const [firstSegment, secondSegment] = afterNodeModules.split("/");
   return firstSegment.startsWith("@") && secondSegment
-    ? `${firstSegment}/${secondSegment}`
+    ? ``
     : firstSegment;
 }
killedBy: topology helper units normalizes external type package names and public allowances
statusReason: expected null to be 'react' // Object.is equality
